[
   {
      "facts":[
         { "day":"10", "month":"10", "year":"19", "text": "Germanicus, the best loved of Roman princes, dies of poisoning. On his deathbed he accuses Piso, the governor of Syria, of poisoning him." },
         { "day":"10", "month":"10", "year":"732", "text": "At Tours, France, Charles Martel kills Abd el-Rahman and halts the Muslim invasion of Europe." },
         { "day":"10", "month":"10", "year":"1733", "text": "France declares war on Austria over the question of Polish succession." },
         { "day":"10", "month":"10", "year":"1789", "text": "In Versailles France, Joseph Guillotin says the most humane way of carrying out a death sentence is decapitation by a single blow of a blade." },
         { "day":"10", "month":"10", "year":"1794", "text": "Russian General Alexander Vasilyevich Suvorov crushes the rebel Polish army at Maciejowice, Poland." },
         { "day":"10", "month":"10", "year":"1845", "text": "The U.S. Naval Academy is founded at Annapolis, Md." },
         { "day":"10", "month":"10", "year":"1863", "text": "The first telegraph line to Denver is completed." },
         { "day":"10", "month":"10", "year":"1877", "text": "Lt. Col. George Armstrong Custer is buried at West Point in New York." },
         { "day":"10", "month":"10", "year":"1911", "text": "Revolution in China begins with a bomb explosion and the discovery of revolutionary headquarters in Hankow. The revolutionary movement spread rapidly through west and southern China, forcing the abdication of the last Ch’ing emperor, six-year-old Henry Pu-Yi. By October 26, the Chinese Republic will be proclaimed, and on December 4, Premier Yuan Shih-K’ai will sign a truce with rebel general Li Yuan-hung." },
         { "day":"10", "month":"10", "year":"1911", "text": "The Panama Canal opens." },
         { "day":"10", "month":"10", "year":"1933", "text": "At Rio de Janeiro, nations of the Western Hemisphere sign a non-aggression and conciliation treaty. President Roosevelt adopts a "good neighbor" policy toward Latin America and announces a policy of nonintervention in Latin American affairs at the December 7th International American Conference at Montevideo, Uruguay." },
         { "day":"10", "month":"10", "year":"1941", "text": "Soviet troops halt the German advance on Moscow." },
         { "day":"10", "month":"10", "year":"1953", "text": "The Mutual Defense Treaty between the US and South Korea signed." },
         { "day":"10", "month":"10", "year":"1966", "text": "U.S. Forces launch Operation Robin, in Hoa Province south of Saigon in South Vietnam, to provide road security between villages." },
         { "day":"10", "month":"10", "year":"1970", "text": "The Quebec Provincial Minister of Labour, Pierre Laporte, is kidnapped by terrorists." },
         { "day":"10", "month":"10", "year":"1971", "text": "The London Bridge, built in 1831 and dismantled in 1967, reopens in Lake Havusu City, Arizona, after being sold to Robert P. McCulloch and moved to the United States." },
         { "day":"10", "month":"10", "year":"1973", "text": "Spiro Agnew resigns the vice presidency amid accusations of income tax evasion. President Richard Nixon names Gerald Ford as the new vice president. Agnew is later convicted and sentenced to three years probation and fined $10,000." },
         { "day":"10", "month":"10", "year":"1985", "text": "An Egyptian plane carrying hijackers of the Achille Lauro cruise ship is intercepted by US Navy F-14s and forced to land at a NATO base in Sicily." },
         { "day":"10", "month":"10", "year":"2008", "text": "Orakzai bombing, Afghanistan: members of the Taliban drive an explosive-laden truck into a meeting of 600 people discussing ways to rid their area of the Taliban; the bomb kills 110." },
      ]
   }
]
