[
   {
      "facts":[
         { "day":"11", "month":"10", "year":"1531", "text": "The Catholics defeat the Protestants at Kappel during Switzerland’s second civil war." },
         { "day":"11", "month":"10", "year":"1540", "text": "Charles V of Milan puts his son Philip in control." },
         { "day":"11", "month":"10", "year":"1727", "text": "George II of England crowned." },
         { "day":"11", "month":"10", "year":"1795", "text": "In graditude for putting down a rebellion in the streets of Paris, France’s National Convention appoints Napoleon Bonaparte second in command of the Army of the Interior." },
         { "day":"11", "month":"10", "year":"1862", "text": "The Confederate Congress in Richmond passes a draft law allowing anyone owning 20 or more slaves to be exempt from military service. This law confirms many southerners opinion that they are in a ‘rich man’s war and a poor man’s fight.’" },
         { "day":"11", "month":"10", "year":"1877", "text": "Outlaw Wild Bill Longley, who killed at least a dozen men, is hanged, but it took two tries; on the first try, the rope slipped and his knees drug the ground." },
         { "day":"11", "month":"10", "year":"1899", "text": "South African Boers, settler from the Netherlands, declare war on Great Britain." },
         { "day":"11", "month":"10", "year":"1906", "text": "San Francisco school board orders the segregation of Oriental schoolchildren, inciting Japanese outrage." },
         { "day":"11", "month":"10", "year":"1942", "text": "In the Battle of Cape Esperance, near the Solomon Islands, U.S. cruisers and destroyers decisively defeat a Japanese task force in a night surface encounter." },
         { "day":"11", "month":"10", "year":"1945", "text": "Negotiations between Nationalist leader Chiang Kai-shek and Communist leader Mao Tse-tung break down. Nationalist and Communist troops are soon engaged in a civil war." },
         { "day":"11", "month":"10", "year":"1950", "text": "The Federal Communications Commission authorizes the Columbia Broadcasting System (CBS) to begin commercial color TV broadcasts." },
         { "day":"11", "month":"10", "year":"1962", "text": "Pope John XXIII opens the 21st Ecumenical Council (Vatican II) with a call for Christian unity. This is the largest gathering of the Roman Catholic hierarchy in history; among delegate-observers are representatives of major Protestant denominations, in itself a sign of sweeping change." },
         { "day":"11", "month":"10", "year":"1968", "text": "Apollo 7, with three men aboard, is successfully launched from Cape Kennedy." },
         { "day":"11", "month":"10", "year":"1972", "text": "A French mission in Vietnam is destroyed by a U.S. bombing raid." },
         { "day":"11", "month":"10", "year":"1972", "text": "Race riot breaks out aboard carrier USS Kitty Hawk off Vietnam during Operation Linebacker." },
         { "day":"11", "month":"10", "year":"1975", "text": "Saturday Night Live comedy-variety show premiers on NBC, with guest host comedian George Carlin and special guests Janis Ian, Andy Kaufman and Billy Preston; at this writing (2013) the show is still running." },
         { "day":"11", "month":"10", "year":"1976", "text": "The so-called “Gang of Four,” Chairman Mao Tse-tung’s widow and three associates, are arrested in Peking, setting in motion an extended period of turmoil in the Chinese Communist Party." },
         { "day":"11", "month":"10", "year":"1984", "text": "Astronaut Kathryn D. Sullivan, part of the crew of Space Shuttle Challenger, becomes the first American woman to walk in space." },
         { "day":"11", "month":"10", "year":"1987", "text": "Operation Pawan by Indian Peace Keeping Force begins in Sri Lanka; thousands of Tamil citizens, along with hundreds of Tamil Tigers militants and Indian Army soldiers will die in the operation." },
         { "day":"11", "month":"10", "year":"1991", "text": "Confirmation hearings for Supreme Court Justice Clarence Thomas begin." },
         { "day":"11", "month":"10", "year":"2000", "text": "NASA launches its 100th Space Shuttle mission." },
         { "day":"11", "month":"10", "year":"2001", "text": "The Polaroid Corporation, which had provided shutterbugs with photo prints in minutes with its “instant cameras” since 1947, files for bankruptcy." }
      ]
   }
]
