[
   {
      "facts":[
         { "day":"12", "month":"10", "year":"1492", "text": "Christopher Columbus and his crew land in the Bahamas." },
         { "day":"12", "month":"10", "year":"1576", "text": "Rudolf II, the king of Hungary and Bohemia, succeeds his father, Maximillian II, as Holy Roman Emperor." },
         { "day":"12", "month":"10", "year":"1609", "text": "The song “Three Blind Mice” is published in London, believed to be the earliest printed secular song." },
         { "day":"12", "month":"10", "year":"1702", "text": "Admiral Sir George Rooke defeats the French fleet off Vigo." },
         { "day":"12", "month":"10", "year":"1722", "text": "Shah Sultan Husayn surrenders the Persian capital of Isfahan to Afgan rebels after a seven month siege." },
         { "day":"12", "month":"10", "year":"1809", "text": "Meriwether Lewis, of the Lewis and Clark expedition, dies under mysterious circumstances in Tennessee." },
         { "day":"12", "month":"10", "year":"1899", "text": "The Anglo-Boer War begins." },
         { "day":"12", "month":"10", "year":"1872", "text": "Apache leader Cochise signs a peace treaty with General Howard in Arizona Territory." },
         { "day":"12", "month":"10", "year":"1915", "text": "Despite international protests, Edith Cavell, an English nurse in Belgium, is executed by Germans for aiding the escape of Allied prisoners." },
         { "day":"12", "month":"10", "year":"1933", "text": "Alcatraz Island is made a federal maximum security prison." },
         { "day":"12", "month":"10", "year":"1943", "text": "The U.S. Fifth Army begins an assault crossing of the Volturno River in Italy." },
         { "day":"12", "month":"10", "year":"1949", "text": "Eugenie Anderson becomes the first woman U.S. ambassador." },
         { "day":"12", "month":"10", "year":"1960", "text": "Inejiro Asanuma, leaders of the Japan Socialist Party, is assassinated during a live TV broadcast." },
         { "day":"12", "month":"10", "year":"1964", "text": "1964 USSR launches Voskhod I, first spacecraft with multi-person crew; it is also the first mission in which the crew did not wear space suits." },
         { "day":"12", "month":"10", "year":"1970", "text": "President Richard Nixon announces the pullout of 40,000 more American troops in Vietnam by Christmas." },
         { "day":"12", "month":"10", "year":"1971", "text": "The House of Representatives passes the Equal Rights Amendment 354-23." },
         { "day":"12", "month":"10", "year":"1984", "text": "The Provisional Irish Republican Army detonates at bomb at the Grand Hotel in Brighton, England, in an unsuccessful attempt to assassinate British Prime Minister Margaret Thatcher; 5 others are killed and 31 wounded." },
         { "day":"12", "month":"10", "year":"1994", "text": "NASA loses contact with the Magellan probe spacecraft in the thick atmosphere of Venus." },
         { "day":"12", "month":"10", "year":"1999", "text": "Chief of Army Staff Perez Musharraf seizes power in Pakistan through a bloodless military coup." },
         { "day":"12", "month":"10", "year":"2000", "text": "Suicide bombers at Aden, Yemen, damage USS Cole; 17 crew members killed and over 35 wounded." },
         { "day":"12", "month":"10", "year":"2002", "text": "Terrorist bombers kill over 200 and wound over 300 more at the Sari Club in Kuta, Bali." }
      ]
   }
]
