[
   {
      "facts":[
         { "day":"15", "month":"10", "year":"1529", "text": "Ottoman armies under Suleiman end their siege of Vienna and head back to Belgrade." },
         { "day":"15", "month":"10", "year":"1582", "text": "The Gregorian (or New World) calendar is adopted in Italy, France, Spain, and Portugal; and the preceding ten days are lost to history." },
         { "day":"15", "month":"10", "year":"1783", "text": "Francois Pilatre de Rozier makes the first manned flight in a hot air balloon. The first flight was let out to 82 feet, but over the next few days the altitude increased up to 6,500 feet." },
         { "day":"15", "month":"10", "year":"1813", "text": "During the land defeat of the British on the Thames River in Canada, the Indian chief Tecumseh, now a brigadier general with the British Army (War of 1812), is killed." },
         { "day":"15", "month":"10", "year":"1863", "text": "For the second time, the Confederate submarine H L Hunley sinks during a practice dive in Charleston Harbor, this time drowning its inventor along with seven crew members." },
         { "day":"15", "month":"10", "year":"1878", "text": "Thomas A. Edison founds the Edison Electric Light Co." },
         { "day":"15", "month":"10", "year":"1880", "text": "Victorio, feared leader of the Minbreno Apache, is killed by Mexican troops in northwestern Chihuahua, Mexico." },
         { "day":"15", "month":"10", "year":"1892", "text": "An attempt to rob two banks in Coffeyville, Kan., ends in disaster for the Dalton gang as four of the five outlaws are killed and Emmet Dalton is seriously wounded." },
         { "day":"15", "month":"10", "year":"1894", "text": "Captain Alfred Dreyfus, a Jewish army officer, is arrested for betraying military secrets to Germany." },
         { "day":"15", "month":"10", "year":"1914", "text": "Congress passes the Clayton Anti-Trust Act, which labor leader Samuel Gompers calls “labor’s charter of freedom.” The act exempts unions from anti-trust laws; strikes, picketing and boycotting become legal; corporate interlocking directorates become illegal, as does setting prices which would effect a monopoly." },
         { "day":"15", "month":"10", "year":"1917", "text": "Mata Hari, a Paris dancer, is executed by the French after being convicted of passing military secrets to the Germans." },
         { "day":"15", "month":"10", "year":"1924", "text": "German ZR-3 flies 5000 miles, the furthest Zeppelin flight to date." },
         { "day":"15", "month":"10", "year":"1941", "text": "Odessa, a Russian port on the Black Sea which has been surrounded by German troops for several weeks, is evacuated by Russian troops." },
         { "day":"15", "month":"10", "year":"1945", "text": "Vichy French Premier Pierre Laval is executed by a firing squad for his wartime collaboration with the Germans." },
         { "day":"15", "month":"10", "year":"1950", "text": "President Harry Truman meets with General Douglas MacArthur at Wake Island to discuss U.N. progress in the Korean War." },
         { "day":"15", "month":"10", "year":"1964", "text": "Nikita Khrushchev is replaced by Leonid Brezhnev as leader of the Soviet Union." },
         { "day":"15", "month":"10", "year":"1966", "text": "Huey P. Newton and Bobby Seale establish the Black Panther Party, an African-American revolutionary socialist political group, in the US." },
         { "day":"15", "month":"10", "year":"1969", "text": "Rallies for The Moratorium to End the War  in Vietnam draw over 2 million demonstrators across the US, a quarter million of them in the nation’s capital." },
         { "day":"15", "month":"10", "year":"1987", "text": "The Great Storm of 1987 strikes the UK and Europe during the night of Oct 15-16, killing over 20 people and causing widespread damage." },
         { "day":"15", "month":"10", "year":"1989", "text": "Canadian hockey player Wayne Gretzky makes his 1,851st goal, breaking the all-time scoring record in the National Hockey League." },
         { "day":"15", "month":"10", "year":"1990", "text": "Mikhail Gorbachev, leader of the USSR, receives Nobel Peace Prize for his work in making his country more open and reducing Cold War tensions." },
         { "day":"15", "month":"10", "year":"1997", "text": "Andy Green of the UK becomes the first person to break the sound barrier in the Earth’s atmosphere, driving the ThrustSSC supersonic car to a record 763 mph (1,228 km/h)." },
         { "day":"15", "month":"10", "year":"2003", "text": "China launches its first manned space mission, Shenzhou I." },
         { "day":"15", "month":"10", "year":"2007", "text": "New Zealand police arrest 17 people believed to be part of a paramilitary training camp." },
         { "day":"15", "month":"10", "year":"2008", "text": "Dow Jones Industrial Average plummets 733.08 points, the second-largest percentage drop in the Dow’s history." },
         { "day":"15", "month":"10", "year":"2011", "text": "Protests break out in countries around the globe, under the slogan “United for Global Democracy.”" }
      ]
   }
]
