[
   {
      "facts":[
         { "day":"19", "month":"10", "year":"439", "text": "The Vandals, led by King Gaiseric, take Carthage in North Africa." },
         { "day":"19", "month":"10", "year":"1216", "text": "King John of England dies at Newark and is succeeded by his nine-year-old son Henry." },
         { "day":"19", "month":"10", "year":"1448", "text": "The Ottoman Sultan Murat II defeats Hungarian General Janos Hunyadi at Kosovo, Serbia." },
         { "day":"19", "month":"10", "year":"1466", "text": "The peace of Torun ends the war between the Teutonic knights and their own disaffected subjects in Prussia." },
         { "day":"19", "month":"10", "year":"1739", "text": "England declares war on Spain over borderlines in Florida. The War is known as the War of Jenkins’ Ear because the Spanish coast guards cut off the ear of British seaman Robert Jenkins." },
         { "day":"19", "month":"10", "year":"1781", "text": "Major General Lord Charles Cornwallis surrenders to George Washington and Count de Rochambeau at Yorktown, Va. Cornwallis surrenders 7,157 troops, including sick and wounded, and 840 sailors, along with 244 artillery pieces. Losses in this battle had been light on both sides. The Revolutionary War is effectively ended." },
         { "day":"19", "month":"10", "year":"1812", "text": "Napoleon Bonaparte begins his retreat from Moscow." },
         { "day":"19", "month":"10", "year":"1848", "text": "John \"The Pathfinder\" Fremont moves out from near Westport, Missouri, on his fourth Western expedition–a failed attempt to open a trail across the Rocky Mountains along the 38th parallel." },
         { "day":"19", "month":"10", "year":"1864", "text": "At the Battle of Cedar Creek, Va., a narrow victory helps the Union secure the Shenandoah Valley." },
         { "day":"19", "month":"10", "year":"1873", "text": "Yale, Princeton, Columbia and Rutgers universities draft the first code of football rules." },
         { "day":"19", "month":"10", "year":"1914", "text": "The German cruiser Emden captures her thirteenth Allied merchant ship in 24 days." },
         { "day":"19", "month":"10", "year":"1917", "text": "The first doughnut is fried by Salvation Army volunteer women for American troops in France during World War I." },
         { "day":"19", "month":"10", "year":"1942", "text": "The Japanese submarine I-36 launches a floatplane for a reconnaissance flight over Pearl Harbor. The pilot and crew report on the ships in the harbor, after which the aircraft is lost at sea." },
         { "day":"19", "month":"10", "year":"1949", "text": "The People’s Republic of China is formally proclaimed." },
         { "day":"19", "month":"10", "year":"1950", "text": "The North Korean capital of Pyongyang is captured by U.N. troops." },
         { "day":"19", "month":"10", "year":"1954", "text": "Egypt and Britain conclude a pact on the Suez Canal, ending 72 years of British military occupation. Britain agrees to withdraw its 80,000-man force within 20 months, and Egypt agrees to maintain freedom of canal navigation." },
         { "day":"19", "month":"10", "year":"1960", "text": "Canada and the United States agree to undertake a joint Columbia River project to provide hydroelectric power and flood control." },
         { "day":"19", "month":"10", "year":"1973", "text": "President Richard Nixon rejects an Appeals Court demand to turn over the Watergate tapes." },
         { "day":"19", "month":"10", "year":"1987", "text": "In retaliation for Iranian attacks on ships in the Persian Gulf, the U. S. navy disables three of Iran’s offshore oil platforms." },
         { "day":"19", "month":"10", "year":"1988", "text": "British government bans TV and radio interviews with members of Irish political group Sinn Fein and 11 paramilitary groups." },
         { "day":"19", "month":"10", "year":"1989", "text": "The 1975 conviction of the Guilford Four overturned by British courts; the 4 men had been convicted in the 1974 Guilford pub bombings." },
         { "day":"19", "month":"10", "year":"2003", "text": "Mother Teresa is beatified by Pope John Paul II for her work among \"the poorest of the poor\" in India." },
         { "day":"19", "month":"10", "year":"2005", "text": "Former Iraqi dictator Saddam Hussein’s trail for crimes against humanity begins in Baghdad." }
      ]
   }
]
