[
   {
      "facts":[
         { "day":"2", "month":"10", "year":"1263", "text": "At Largs, King Alexander III of Scotland repels an amphibious invasion by King Haakon IV of Norway." },
         { "day":"2", "month":"10", "year":"1535", "text": "Having landed in Quebec a month ago, Jacques Cartier reaches a town, which he names Montreal." },
         { "day":"2", "month":"10", "year":"1862", "text": "An Army under Union General Joseph Hooker arrives in Bridgeport, Alabama to support the Union forces at Chattanooga. Chattanooga’s Lookout Mountain provides a dramatic setting for the Civil War’s battle above the clouds." },
         { "day":"2", "month":"10", "year":"1870", "text": "The papal states vote in favor of union with Italy. The capital is moved from Florence to Rome." },
         { "day":"2", "month":"10", "year":"1871", "text": "Morman leader Brigham Young, 70, is arrested for polygamy. He was later convicted, but the U.S. Supreme Court overturned the conviction." },
         { "day":"2", "month":"10", "year":"1879", "text": "A dual alliance is formed between Austria and Germany, in which the two countries agree to come to the other’s aid in the event of aggression." },
         { "day":"2", "month":"10", "year":"1909", "text": "Orville Wright sets an altitude record, flying at 1,600 feet. This exceeded Hubert Latham’s previous record of 508 feet." },
         { "day":"2", "month":"10", "year":"1931", "text": "Aerial circus star Clyde Pangborn and playboy Hugh Herndon, Jr. set off to complete the first nonstop flight across the Pacific Ocean from Misawa City, Japan." },
         { "day":"2", "month":"10", "year":"1941", "text": "The German army launches Operation Typhoon, the drive towards Moscow." },
         { "day":"2", "month":"10", "year":"1950", "text": "The comic strip Peanuts, by Charles M. Schultz, makes its first appearance in newspapers." },
         { "day":"2", "month":"10", "year":"1959", "text": "The groundbreaking TV series The Twilight Zone, hosted by Rod Serling, premiers on CBS." },
         { "day":"2", "month":"10", "year":"1964", "text": "Scientists announce findings that smoking can cause cancer." },
         { "day":"2", "month":"10", "year":"1967", "text": "Thurgood Marshall, the first African-American Supreme Court justice, is sworn in. Marshall had previously been the solicitor general, the head of the legal staff of the National Association for the Advancement of Colored People (NAACP), and a leading American civil rights lawyer." },
         { "day":"2", "month":"10", "year":"1970", "text": "A plane carrying the Wichita State University football team, staff, and supporters crashes in Colorado; 31 of the 40 people aboard die." },
         { "day":"2", "month":"10", "year":"1980", "text": "Congressional Representative Mike Myers is expelled from the US House for taking a bribe in the Abscam scandal, the first member to be expelled since 1861." },
         { "day":"2", "month":"10", "year":"1990", "text": "Flight 8301 of China’s Xiamen Airlines is hijacked and crashed into Baiyun International Airport, hitting two other aircraft and killing 128 people." },
         { "day":"2", "month":"10", "year":"2001", "text": "NATO backs US military strikes in the wake of the September 11 terrorist attacks." }
      ]
   }
]
