[
   {
      "facts":[
         { "day":"23", "month":"10", "year":"4004 BC", "text": "According to 17th century divine James Ussher, Archbishop of Armagh, and Dr. John Lightfoot of Cambridge, the world was created on this day, a Sunday, at 9 a.m." },
         { "day":"23", "month":"10", "year":"1641", "text": "Rebellion in Ireland. Catholics, under Phelim O’Neil, rise against the Protestants and massacred men, women and children to the number of 40,000 (some say 100,000)." },
         { "day":"23", "month":"10", "year":"1694", "text": "American colonial forces led by Sir William Phips, fail in their attempt to seize Quebec." },
         { "day":"23", "month":"10", "year":"1707", "text": "The first Parliament of Great Britain meets." },
         { "day":"23", "month":"10", "year":"1783", "text": "Virginia emancipates slaves who fought for independence during the Revolutionary War." },
         { "day":"23", "month":"10", "year":"1861", "text": "President Abraham Lincoln suspends the writ of habeas corpus in Washington, D.C. for all military-related cases." },
         { "day":"23", "month":"10", "year":"1918", "text": "President Wilson feels satisfied that the Germans are accepting his armistice terms and agrees to transmit their request for an armistice to the Allies. The Germans have agreed to suspend submarine warfare, cease inhumane practices such as the use of poison gas, and withdraw troops back into Germany." },
         { "day":"23", "month":"10", "year":"1929", "text": "The first transcontinental air service begins from New York to Los Angeles." },
         { "day":"23", "month":"10", "year":"1942", "text": "The Western Task Force, destined for North Africa, departs from Hampton Roads, Virginia." },
         { "day":"23", "month":"10", "year":"1952", "text": "The Nobel Prize for Medicine is awarded to Ukranian-born microbiologist Selmart A. Waksman for his discovery of an effective treatment of tuberculosis." },
         { "day":"23", "month":"10", "year":"1954", "text": "In Paris, an agreement is signed providing for West German sovereignty and permitting West Germany to rearm and enter NATO and the Western European Union." },
         { "day":"23", "month":"10", "year":"1973", "text": "A U.N. sanctioned cease-fire officially ends the Yom Kippur war between Israel and Syria." },
         { "day":"23", "month":"10", "year":"1983", "text": "A truck filled with explosives, driven by a Moslem terrorist, crashes into the U.S. Marine barracks in Beirut, Lebanon. The bomb kills 237 Marines and injures 80. Almost simultaneously, a similar incident occurs at French military headquarters, where 58 die and 15 are injured." },
         { "day":"23", "month":"10", "year":"1989", "text": "The Hungarian Republic replaces the communist Hungarian People’s Republic." },
         { "day":"23", "month":"10", "year":"1998", "text": "Israeli Prime Minister Benjamin Netanyahu and Palestinian Chairman Yasser Arafat reach a \"land for peace\" agreement." },
         { "day":"23", "month":"10", "year":"2002", "text": "Chechen terrorists take 700 theater-goers hostage at the House of Culture theater in Moscow." },
         { "day":"23", "month":"10", "year":"2004", "text": "An earthquake in Japan kills 35, injures 2,200, and leaves 85,000 homeless or displaced." },
         { "day":"23", "month":"10", "year":"2011", "text": "Libiyan National Transition Council declares the Libyan civil war is over." },
         { "day":"23", "month":"10", "year":"2012", "text": "The world’s oldest teletext service, BBC’s Ceefax, ceases operation." }
      ]
   }
]
