[
   {
      "facts":[
         { "day":"25", "month":"10", "year":"1415", "text": "An English army under Henry V defeats the French at Agincourt, France. The French had out numbered Henry’s troops 60,000 to 12,000 but British longbows turned the tide of the battle." },
         { "day":"25", "month":"10", "year":"1760", "text": "George III of England crowned." },
         { "day":"25", "month":"10", "year":"1854", "text": "During the Crimean War, a brigade of British light infantry is destroyed by Russian artillery as they charge down a narrow corridor in full view of the Russians." },
         { "day":"25", "month":"10", "year":"1916", "text": "German pilot Rudolf von Eschwege shoots down his first enemy plane, a Nieuport 12 of the Royal Naval Air Service over Bulgaria." },
         { "day":"25", "month":"10", "year":"1923", "text": "The Teapot Dome scandal comes to public attention as Senator Thomas J. Walsh of Montana, subcommittee chairman, reveals the findings of the past 18 months of investigation. His case will result in the conviction of Harry F. Sinclair of Mammoth Oil, and later Secretary of the Interior Albert B. Fall, the first cabinet member in American history to go to jail. The scandal, named for the Teapot Dome oil reserves in Wyoming, involved Fall secretly leasing naval oil reserve lands to private companies." },
         { "day":"25", "month":"10", "year":"1940", "text": "German troops capture Kharkov and launch a new drive toward Moscow." },
         { "day":"25", "month":"10", "year":"1944", "text": "The Japanese are defeated in the Battle of Leyte Gulf, the world’s largest sea engagement. From this point on, the depleted Japanese Navy increasingly resorts to the suicidal attacks of Kamikaze fighters." },
         { "day":"25", "month":"10", "year":"1950", "text": "Chinese Communist Forces launch their first-phase offensive across the Yalu River into North Korea." },
         { "day":"25", "month":"10", "year":"1951", "text": "In a general election, England’s Labour Party loses to Conservatives. Winston Churchill becomes prime minister, and Anthony Eden becomes foreign secretary." },
         { "day":"25", "month":"10", "year":"1954", "text": "President Eisenhower conducts the first televised Cabinet meeting." },
         { "day":"25", "month":"10", "year":"1958", "text": "The last U.S. troops leave Beirut." },
         { "day":"25", "month":"10", "year":"1960", "text": "Martin Luther King, Jr., is sentenced to four months in jail for a sit-in." },
         { "day":"25", "month":"10", "year":"1962", "text": "Adlai Stevenson shows photos to the UN Security Council that prove Soviet missiles have been installed in Cuba." },
         { "day":"25", "month":"10", "year":"1962", "text": "In South Africa, civil rights activist Nelson Mandela is sentenced to 5 years in prison." },
         { "day":"25", "month":"10", "year":"1971", "text": "United Nations expels the Republic of China and seats the People’s Republic of China." },
         { "day":"25", "month":"10", "year":"1983", "text": "1,800 U.S. troops and 300 Caribbean troops land on Grenada. U.S. forces soon turn up evidence of a strong Cuban and Soviet presence–large stores of arms and documents suggesting close links to Cuba." },
         { "day":"25", "month":"10", "year":"1991", "text": "The last soldiers of the Yugoslav People’s Army leaves the Republic of Slovenia." },
         { "day":"25", "month":"10", "year":"2009", "text": "Terrorist bombings in Baghdad kill over 150 and wound over 700." }
      ]
   }
]
