[
   {
      "facts":[
         { "day":"26", "month":"10", "year":"1774", "text": "The first Continental Congress, which protested British measures and called for civil disobedience, concludes in Philadelphia." },
         { "day":"26", "month":"10", "year":"1795", "text": "When General Paul Barras resigns his commission as head of France’s Army of the Interior to become head of the Directory, his second-in-command becomes the army’s commander—Napoleon Bonaparte." },
         { "day":"26", "month":"10", "year":"1825", "text": "The first boat on the Erie Canal leaves Buffalo, N.Y." },
         { "day":"26", "month":"10", "year":"1881", "text": "Three Earp brothers and Doc Holliday have a shootout with the Clantons and McLaurys at the O.K. Corral in Tombstone, Arizona Territory." },
         { "day":"26", "month":"10", "year":"1905", "text": "Norway signs a treaty of separation with Sweden. Norway chooses Prince Charles of Denmark as the new king; he becomes King Haakon VII." },
         { "day":"26", "month":"10", "year":"1918", "text": "Germany’s supreme commander, General Erich Ludendorff, resigns, protesting the terms to which the German Government has agreed in negotiating the armistice. This sets the stage for his later support for Hitler and the Nazis, who claim that Germany did not lose the war on the battlefield but were \"stabbed in the back\" by politicians." },
         { "day":"26", "month":"10", "year":"1942", "text": "Japanese attack Guadalcanal, sinking two U.S. carriers." },
         { "day":"26", "month":"10", "year":"1942", "text": "U.S. Navy aircraft carrier Hornet is sunk in the Battle of Santa Cruz Island, in the South Pacific." },
         { "day":"26", "month":"10", "year":"1950", "text": "A reconnaissance platoon for a South Korean division reaches the Yalu River. They are the only elements of the U.N. force to reach the river before the Chinese offensive pushes the whole army down into South Korea." },
         { "day":"26", "month":"10", "year":"1955", "text": "The Village Voice is first published, backed in part by Norman Mailer." },
         { "day":"26", "month":"10", "year":"1955", "text": "Ngo Dinh Diem declares himself Premier of South Vietnam." },
         { "day":"26", "month":"10", "year":"1957", "text": "The Russian government announces that Marshal Georgi Zhukov, the nation’s most prominent military hero, has been relieved of his duties as Minister of Defense. Khrushchev accused Zhukov as promoting his own \"cult of personality\" and saw him as a threat to his own popularity." },
         { "day":"26", "month":"10", "year":"1958", "text": "The first New York – Paris transatlantic jet passenger service is inaugurated by Pan Am, while the first New York – London transatlantic jet passenger service is inaugurated by BOAC." },
         { "day":"26", "month":"10", "year":"1967", "text": "Mohammad Reza Pahlavi crowns himself Emperor of Iran and his wife Farah as empress." },
         { "day":"26", "month":"10", "year":"1970", "text": "Gary Trudeau’s comic strip Doonesbury first appears." },
         { "day":"26", "month":"10", "year":"1979", "text": "The President of South Korea, Park Chung-hee, asssinated by Kim Jae-kyu, head of the country’s Central intelligence Agency; Choi Kyu-ha is named acting president." },
         { "day":"26", "month":"10", "year":"1994", "text": "Israel and Jordan sign a peace treaty." },
         { "day":"26", "month":"10", "year":"2001", "text": "The USA PATRIOT Act signed into law by Pres. George W. Bush, greatly expanding intelligence and legal agencies’ ability to utilize wiretaps, records searches and surveillance." },
         { "day":"26", "month":"10", "year":"2002", "text": "Russian Spetsnaz storm the Moscow Theatre, where Chechen terrorists had taken the audience and performers hostage three days earlier; 50 terrorists and 150 hostages die in the assault." }
      ]
   }
]
