[
   {
      "facts":[
         { "day":"27", "month":"10", "year":"97", "text": "To placate the Praetorians of Germany, Nerva of Rome adopts Trajan, the Spanish-born governor of lower Germany." },
         { "day":"27", "month":"10", "year":"1553", "text": "Michael Servetus, who discovered the pulmonary circulation of the blood, is burned for heresy in Switzerland." },
         { "day":"27", "month":"10", "year":"1612", "text": "A Polish army that invaded Russia capitulates to Prince Dimitri Pojarski and his Cossacks." },
         { "day":"27", "month":"10", "year":"1791", "text": "President George Washington transmits to Congress the results of the first US census, exclusive of South Carolina which had not yet submitted its findings." },
         { "day":"27", "month":"10", "year":"1806", "text": "Emperor Napoleon enters Berlin." },
         { "day":"27", "month":"10", "year":"1809", "text": "President James Madison orders the annexation of the western part of West Florida. Settlers there had rebelled against Spanish authority." },
         { "day":"27", "month":"10", "year":"1862", "text": "A Confederate force is routed at the Battle of Georgia Landing, near Bayou Lafourche in Louisiana." },
         { "day":"27", "month":"10", "year":"1870", "text": "The French fortress of Metz surrenders to the Prussian Army." },
         { "day":"27", "month":"10", "year":"1873", "text": "Farmer Joseph F. Glidden applies for a patent on barbed wire. Glidden eventually received five patents and is generally considered the inventor of barbed wire." },
         { "day":"27", "month":"10", "year":"1891", "text": "D. B. Downing, inventor, is awarded a patent for the street letter (mail) box." },
         { "day":"27", "month":"10", "year":"1904", "text": "The New York subway officially opens running from the Brooklyn Bridge uptown to Broadway at 145th Street." },
         { "day":"27", "month":"10", "year":"1907", "text": "The first trial in the Eulenberg Affair ends in Germany." },
         { "day":"27", "month":"10", "year":"1917", "text": "20,000 women march in a suffrage parade in New York. As the largest state and the first on the East Coast to do so, New York has an important effect on the movement to grant all women the vote in all elections." },
         { "day":"27", "month":"10", "year":"1922", "text": "In Italy, liberal Luigi Facta’s cabinet resigns after threats from Mussolini that \"either the government will be given to us or we will seize it by marching on Rome.\" Mussolini calls for a general mobilization of all Fascists." },
         { "day":"27", "month":"10", "year":"1927", "text": "Fox Movie-tone news, the first sound news film, is released." },
         { "day":"27", "month":"10", "year":"1941", "text": "In a broadcast to the nation on Navy Day, President Franklin Roosevelt declares: \"America has been attacked, the shooting has started.\" He does not ask for full-scale war yet, realizing that many Americans are not yet ready for such a step." },
         { "day":"27", "month":"10", "year":"1954", "text": "Benjamin O. Davis Jr. becomes the first African-American general in the US Air Force." },
         { "day":"27", "month":"10", "year":"1962", "text": "American U-2 reconnaissance plane shot down by a surface-to-air missile over Cuba, killing the pilot, Maj. Rudolf Anderson, the only direct human casualty of the Cuban Missile Crisis." },
         { "day":"27", "month":"10", "year":"1962", "text": "Soviet Premier Nikita Khrushchev offers to remove Soviet missile bases in Cuba if the U.S. removes its missile bases in Turkey." },
         { "day":"27", "month":"10", "year":"1964", "text": "The political career of future US president Ronald Reagan is launched when he delivers a speech on behalf of Republican presidential candidate Barry Goldwater." },
         { "day":"27", "month":"10", "year":"1971", "text": "The Democratic Republic of the Congo renamed Zaire." },
         { "day":"27", "month":"10", "year":"1986", "text": "London Stock Exchange rules change as Britain suddenly deregulates financial markets, an event called the Big Bang." },
         { "day":"27", "month":"10", "year":"1988", "text": "US President Ronald Reagan decides to tear down a new US Embassy in Moscow because Soviet listening devices were built into the structure." },
         { "day":"27", "month":"10", "year":"1997", "text": "Stock markets crash around the world over fears of a global economic meltdown." }
      ]
   }
]
