[
   {
      "facts":[
         { "day":"3", "month":"10", "year":"1739", "text": "Russia signs a treaty with the Turks, ending a three-year conflict between the two countries." },
         { "day":"3", "month":"10", "year":"1776", "text": "Congress borrows five million dollars to halt the rapid depreciation of paper money in the colonies." },
         { "day":"3", "month":"10", "year":"1862", "text": "At the Battle of Corinth, in Mississippi, a Union army defeats the Confederates." },
         { "day":"3", "month":"10", "year":"1873", "text": "Captain Jack and three other Modoc Indians are hanged in Oregon for the murder of General Edward Canby." },
         { "day":"3", "month":"10", "year":"1876", "text": "John L. Routt, the Colorado Territory governor, is elected the first state governor of Colorado in the Centennial year of the U.S." },
         { "day":"3", "month":"10", "year":"1906", "text": "The first conference on wireless telegraphy in Berlin adopts SOS as warning signal." },
         { "day":"3", "month":"10", "year":"1929", "text": "The Kingdom of Serbs, Croats and Slovenes officially changes its name to Yugoslavia." },
         { "day":"3", "month":"10", "year":"1931", "text": "The comic strip Dick Tracy first appears in the New York News." },
         { "day":"3", "month":"10", "year":"1940", "text": "U.S. Army adopts airborne, or parachute, soldiers. Airborne troops were later used in World War II for landing troops in combat and infiltrating agents into enemy territory." },
         { "day":"3", "month":"10", "year":"1941", "text": "The Maltese Falson, starring Humphrey Bogart as detective Sam Spade, opens." },
         { "day":"3", "month":"10", "year":"1942", "text": "Germany conducts the first successful test flight of a V-2 missile, which flies perfectly over a 118-mile course." },
         { "day":"3", "month":"10", "year":"1944", "text": "German troops evacuate Athens, Greece." },
         { "day":"3", "month":"10", "year":"1951", "text": "A \"shot is heard around the world\" when New York Giants outfielder Bobby Thomson hits a home run in the bottom of the ninth inning, beating the Brooklyn Dodgers to win the National League pennant." },
         { "day":"3", "month":"10", "year":"1952", "text": "The UK successfully conducts a nuclear weapon, becoming the world’s third nuclear power" },
         { "day":"3", "month":"10", "year":"1955", "text": "Two children’s television programs and a family sitcom all destined to become classics debut: Captain Kangaroo, Mickey Mouse Club, and The Dick Van Dyke Show." },
         { "day":"3", "month":"10", "year":"1963", "text": "A violent coup in Honduras ends a period of political reform and ushers in two decades of military rule." },
         { "day":"3", "month":"10", "year":"1985", "text": "The Space Shuttle Atlantis makes its maiden flight." },
         { "day":"3", "month":"10", "year":"1989", "text": "Art Shell becomes the first African American to coach a professional football team, the Los Angeles Raiders." },
         { "day":"3", "month":"10", "year":"1990", "text": "After 40 years of division, East and West Germany are reunited as one nation." },
         { "day":"3", "month":"10", "year":"1993", "text": "Battle of Mogadishu, in which 18 US soldiers and some 1,000 Somalis are killed during an attempt to capture officials of the warlord Mohamed Farrah Aidid’s organization." },
         { "day":"3", "month":"10", "year":"1995", "text": "Former pro football star and actor O.J. Simpson is acquitted of the murders of his wife Nicole Brown Simpson and Ronald Goldman, ending what many called \"the Trial of the Century.\"." },
         { "day":"3", "month":"10", "year":"2008", "text": "The Emergency Economic Stabilization Act of 2008 authorizes the Secretary of the Treasury to purchase distressed assets of financial corporations and supply cash directly to banks to keep them afloat." }
      ]
   }
]
