[
   {
      "facts":[
         { "day":"4", "month":"10", "year":"1777", "text": "At Germantown, Pa., British General Sir William Howe repels George Washington’s last attempt to retake Philadelphia, compelling Washington to spend the winter at Valley Forge." },
         { "day":"4", "month":"10", "year":"1795", "text": "General Napoleon Bonaparte leads the rout of counterrevolutionaries in the streets of Paris, beginning his rise to power." },
         { "day":"4", "month":"10", "year":"1861", "text": "The Union ship USS South Carolina captures two Confederate blockade runners outside of New Orleans, La." },
         { "day":"4", "month":"10", "year":"1874", "text": "Kiowa leader Satanta, known as \"the Orator of the Plains,\" surrenders in Darlington, Texas. He is later sent to the state penitentiary, where he commits suicide October 11, 1878." },
         { "day":"4", "month":"10", "year":"1905", "text": "Orville Wright pilots the first flight longer than 30 minutes. The flight lasted 33 minutes, 17 seconds and covered 21 miles." },
         { "day":"4", "month":"10", "year":"1914", "text": "The first German Zeppelin raids London." },
         { "day":"4", "month":"10", "year":"1917", "text": "Battle of Broodseinde near Ypres, Flanders, a part of the larger Battle of Passchendaele, between British 2nd and 5th armies and the defenders of German 4th Army; most successful Allied attack of the Passchendaele offensive." },
         { "day":"4", "month":"10", "year":"1927", "text": "Gutzon Borglum begins sculpting the heads of 4 US presidents on Mount Rushmore." },
         { "day":"4", "month":"10", "year":"1940", "text": "Germany’s Adolf Hitler and Italy’s Benito Mussolini meet at the Brenner Pass." },
         { "day":"4", "month":"10", "year":"1941", "text": "Willie Gillis Jr., a fictional everyman created by illustrator Norman Rockwell, makes his first appearance, on the cover of The Saturday Evening Post; a series of illustrations on several magazines’ covers would depict young Gillis throughout World War II." },
         { "day":"4", "month":"10", "year":"1943", "text": "US captures the Solomon Islands in the Pacific." },
         { "day":"4", "month":"10", "year":"1957", "text": "Sputnik 1, the first man-made satellite, is launched, beginning the \"space race.\" The satellite, built by Valentin Glushko, weighed 184 pounds and was launched by a converted Intercontinental Ballistic Missile (ICBM). Sputnik orbited the earth every 96 minutes at a maximum height of 584 miles. In 1958, it reentered the earth’s atmosphere and burned up." },
         { "day":"4", "month":"10", "year":"1963", "text": "Hurricane Flora storms through the Caribbean, killing 6,000 in Cuba and Haiti." },
         { "day":"4", "month":"10", "year":"1965", "text": "Pope Paul VI arrives in New York, the first Pope ever to visit the US and the Western hemisphere." },
         { "day":"4", "month":"10", "year":"1968", "text": "Cambodia admits that the Viet Cong use their country for sanctuary." },
         { "day":"4", "month":"10", "year":"1972", "text": "Judge John Sirca imposes a gag order on the Watergate break-in case." },
         { "day":"4", "month":"10", "year":"1976", "text": "In Gregg v. Georgia, the U.S. Supreme Court lifts the ban on the death sentence in murder cases. This restores the legality of capital punishment, which had not been practiced since 1967. The first execution following this ruling was Gary Gilmore in 1977." },
         { "day":"4", "month":"10", "year":"1985", "text": "Free Software Foundation founded to promote universal freedom to create, distribute and modify computer software." },
         { "day":"4", "month":"10", "year":"1992", "text": "Mozambique’s 16-year civil war ends with the Rome General Peace Accords." },
         { "day":"4", "month":"10", "year":"1993", "text": "Russia’s constitutional crisis over President Boris Yeltsin’s attempts to dissolve the legislature: the army violently arrests civilian protesters occupying government buildings." },
         { "day":"4", "month":"10", "year":"2004", "text": "SpaceShipOne, which had achieved the first privately funded human space flight on June 21, wins the Ansari X Prize for the first non-government organization to successfully launch a reusable manned spacecraft into space." }
      ]
   }
]
