[
   {
      "facts":[
         { "day":"5", "month":"10", "year":"1762", "text": "The British fleet bombards and captures Spanish-held Manila in the Philippines." },
         { "day":"5", "month":"10", "year":"1795", "text": "The day after he routed counterrevolutionaries in Paris, Napoleon Bonaparte accepts their formal surrender." },
         { "day":"5", "month":"10", "year":"1813", "text": "U.S. victory at the Battle of the Thames, in Ontario, broke Britain’s Indian allies with the death of Shawnee Chief Tecumseh, and made the Detroit frontier safe." },
         { "day":"5", "month":"10", "year":"1821", "text": "Greek rebels capture Tripolitza, the main Turkish fort in the Peloponnese area of Greece." },
         { "day":"5", "month":"10", "year":"1864", "text": "At the Battle of Allatoona, a small Union post is saved from Lt. Gen. John Bell Hood’s army." },
         { "day":"5", "month":"10", "year":"1877", "text": "Nez Perce Chief Joseph surrenders to Colonel Nelson Miles in Montana Territory, after a 1,700-mile trek to reach Canada falls 40 miles short." },
         { "day":"5", "month":"10", "year":"1880", "text": "The first ball-point pen is patented on this day by Alonzo T. Cross." },
         { "day":"5", "month":"10", "year":"1882", "text": "Outlaw Frank James surrenders in Missouri six months after brother Jesse’s assassination." },
         { "day":"5", "month":"10", "year":"1915", "text": "Germany issues an apology and promises for payment for the 128 American passengers killed in the sinking of the British ship Lusitania." },
         { "day":"5", "month":"10", "year":"1915", "text": "Bulgaria enters World War I on the side of the Central Powers." },
         { "day":"5", "month":"10", "year":"1921", "text": "The World Series is broadcast on radio for the first time." },
         { "day":"5", "month":"10", "year":"1931", "text": "Clyde Pangborn and Hugh Herndon complete the first heavier than air nonstop flight over the Pacific. Their flight, begun October 3, lasted 41 hours, 31 minutes and covered 5,000 miles. They piloted their Bellanca CH-200 monoplane from Samushiro, 300 miles north of Tokyo, Japan, to Wenatchee, Washington." },
         { "day":"5", "month":"10", "year":"1938", "text": "Germany invalidates Jews’ passports." },
         { "day":"5", "month":"10", "year":"1943", "text": "Imperial Japanese forces execute 98 American POWs on Wake Island." },
         { "day":"5", "month":"10", "year":"1947", "text": "US President Harry S Truman delivers the first televised White House address." },
         { "day":"5", "month":"10", "year":"1948", "text": "A magnitude 7.3 earthquake near Ashgabat in the USSR kills tens of thousands; estimates range from 110,000 to 176,000." },
         { "day":"5", "month":"10", "year":"1962", "text": "The first James Bond film, Dr. No starring Sean Connery, debuts." },
         { "day":"5", "month":"10", "year":"1965", "text": "U.S. forces in Saigon receive permission to use tear gas." },
         { "day":"5", "month":"10", "year":"1966", "text": "A sodium cooling system malfunction causes a partial core meltdown at the Enrico Fermi demonstration breeder reactor near Detroit. Radiation is contained." },
         { "day":"5", "month":"10", "year":"1968", "text": "Police attack civil rights demonstrators in Derry, Northern Ireland; the event is considered to be the beginning of \"The Troubles.\"" },
         { "day":"5", "month":"10", "year":"1969", "text": "Monty Python’s Flying Circus debuts on BBC One." },
         { "day":"5", "month":"10", "year":"1970", "text": "The US Public Broadcasting Service (PBS) is established." },
         { "day":"5", "month":"10", "year":"1970", "text": "Members of the Quebec Liberation Front (QLF) kidnap British Trade Commissioner James Cross in Montreal, resulting in the October Crisis and Canada’s first peacetime use of the War Measures Act." },
         { "day":"5", "month":"10", "year":"1986", "text": "Britain’s The Sunday Times newspaper publishes details of Israel’s secret nuclear weapons development program." },
         { "day":"5", "month":"10", "year":"1988", "text": "Brazil’s Constituent Assembly authorizes the nation’s new constitution." },
         { "day":"5", "month":"10", "year":"2000", "text": "Slobodan Milosevic, president of the Federal Republic of Yugoslavia, resigns in the wake of mass protest demonstrations." }
      ]
   }
]
