[
   {
      "facts":[
         { "day":"7", "month":"10", "year":"1571", "text": "In the last great clash of galleys, the Ottoman navy is defeated at Lepanto, Greece, by a Christian naval coalition under the overall command of Spain’s Don Juan de Austria." },
         { "day":"7", "month":"10", "year":"1765", "text": "Delegates from nine of the American colonies meet in New York to discuss the Stamp Act Crisis and colonial response to it." },
         { "day":"7", "month":"10", "year":"1849", "text": "Edgar Allan Poe, aged 40, dies a tragic death in Baltimore. Never able to overcome his drinking habits, he was found in a delirious condition outside a saloon that was used as a voting place." },
         { "day":"7", "month":"10", "year":"1870", "text": "French Minister of the Interior Leon Gambetta escapes besieged Paris by balloon, reaching the French provisional government in Tours." },
         { "day":"7", "month":"10", "year":"1913", "text": "In attempting to find ways to lower the cost of the automobile and make it more affordable to ordinary Americans, Henry Ford took note of the work of efficiency experts like Frederick Taylor, the \"father of scientific management.\" The result was the assembly line that reduced the time it took to manufacture a car, from 12 hours to 93 minutes." },
         { "day":"7", "month":"10", "year":"1944", "text": "Prisoner uprising at Birkenau concentration camp." },
         { "day":"7", "month":"10", "year":"1949", "text": "Iva Toguri D’Aquino, better known as Tokyo Rose, is sentenced to 10 years in prison for treason." },
         { "day":"7", "month":"10", "year":"1949", "text": "East Germany, the German Democratic Republic, is formed." },
         { "day":"7", "month":"10", "year":"1957", "text": "A fire in the Windscale plutonium production reactor (later called Sellafield) north of Liverpool, England, spreads radioactive iodine and polonium through the countryside and into the Irish Sea. Livestock in the immediate area were destroyed, along with 500,000 gallons of milk. At least 30, and possibly as many as 1,000, cancer deaths were subsequently linked to the accident." },
         { "day":"7", "month":"10", "year":"1976", "text": "Hua Guofeng, premier of the People’s Republic of China, succeeds the late Mao Zedong as chairman of the Communist Party of China." },
         { "day":"7", "month":"10", "year":"1985", "text": "Four Palestinian Liberation Organization (PLO) hijackers seize the Italian cruise ship Achille Lauro and demand the release of 50 Palestinians held by Israel." },
         { "day":"7", "month":"10", "year":"1993", "text": "The Great Flood of 1993 on the Mississippi and Missouri rivers ends, the worst US flood since 1927." },
         { "day":"7", "month":"10", "year":"1996", "text": "Fox News Channel begins broadcasting." },
         { "day":"7", "month":"10", "year":"2001", "text": "US invasion of Afghanistan in reaction to the terrorist attacks of 9/11 begins; it will become the longest war in US history." },
         { "day":"7", "month":"10", "year":"2003", "text": "California voters remove Democratic governor Gray Davis from office in the state’s first successful recall of a sitting governor (only the second successful recall of a governor in US history); a Republican candidate, bodybuilder/actor Arnold Schwarzenegger wins the election to replace Davis 17 days later." },
      ]
   }
]
