[
   {
      "facts":[
         { "day":"8", "month":"10", "year":"876", "text": "Charles the Bald is defeated at the Battle of Andernach." },
         { "day":"8", "month":"10", "year":"1690", "text": "Belgrade is retaken by the Turks." },
         { "day":"8", "month":"10", "year":"1840", "text": "King William I of Holland abdicates." },
         { "day":"8", "month":"10", "year":"1855", "text": "Arrow, a ship flying the British flag, is boarded by Chinese who arrest the crew, thus beginning the Second Chinese War." },
         { "day":"8", "month":"10", "year":"1862", "text": "The Union is victorious at the Battle of Perryville, the largest Civil War combat to take place in Kentucky." },
         { "day":"8", "month":"10", "year":"1871", "text": "The Great Chicago Fire begins in southwest Chicago, possibly in a barn owned by Patrick and Katherine O’Leary. Fanned by strong southwesterly winds, the flames raged for more than 24 hours, eventually leveling three and a half square miles and wiping out one-third of the city. Approximately 250 people were killed in the fire; 98,500 people were left homeless; 17,450 buildings were destroyed." },
         { "day":"8", "month":"10", "year":"1897", "text": "Journalist Charles Henry Dow, founder of the Wall Street Journal, begins charting trends of stocks and bonds." },
         { "day":"8", "month":"10", "year":"1900", "text": "Maximilian Harden is sentenced to six months in prison for publishing an article critical of the German Kaiser." },
         { "day":"8", "month":"10", "year":"1906", "text": "Karl Ludwig Nessler first demonstrates a machine in London that puts permenant waves in hair. The client wears a dozen brass curlers, each wearing two pounds, for the six-hour process." },
         { "day":"8", "month":"10", "year":"1912", "text": "First Balkan War begins as Montenegro declares war against the Ottoman Empire." },
         { "day":"8", "month":"10", "year":"1918", "text": "US Army corporal Alvin C. York kills 28 German soldiers and captures 132 in the Argonne Forest; promoted to sergeant and awarded US Medal of Honor and French Croix de Guerre." },
         { "day":"8", "month":"10", "year":"1919", "text": "The U.S. Senate and House of Representatives pass the Volstead Prohibition Enforcement Bill." },
         { "day":"8", "month":"10", "year":"1921", "text": "First live radio broadcast of a football game; Harold W. Arlin was the announcer when KDKA of Pittsburgh broadcast live from Forbes Field as the University of Pittsburgh beat West Virginia University 21–13." },
         { "day":"8", "month":"10", "year":"1922", "text": "Lilian Gatlin becomes the first woman pilot to fly across the United States." },
         { "day":"8", "month":"10", "year":"1932", "text": "Indian Air Force established." },
         { "day":"8", "month":"10", "year":"1939", "text": "Nazi Germany annexes Western Poland." },
         { "day":"8", "month":"10", "year":"1956", "text": "Don Larsen of the New York Yankees pitches the first perfect game in World Series history against the Brooklyn Dodgers." },
         { "day":"8", "month":"10", "year":"1967", "text": "Guerrilla Che Guevara captured in Bolivia." },
         { "day":"8", "month":"10", "year":"1968", "text": "U.S. forces in Vietnam launch Operation SEALORDS (South East Asia Lake, Ocean, River and Delta Strategy), an attack on communist supply lines and base areas in and around the Mekong Delta." },
         { "day":"8", "month":"10", "year":"1969", "text": "The \"Days of Rage\" begin in Chicago; the Weathermen faction of the Students for a Democratic Society initiate 3 days of violent antiwar protests." },
         { "day":"8", "month":"10", "year":"1973", "text": "In the Yom Kippur War an Israeli armored brigade makes an unsuccessful attack on Egyptian positions on the Israeli side of the Suez Canal." },
         { "day":"8", "month":"10", "year":"1978", "text": "Ken Warby of Australia sets the world water speed record, 317.60 mph, at Blowering Dam in Australia; no other human has yet (2013) exceeded 300 mph on water and survived." },
         { "day":"8", "month":"10", "year":"1982", "text": "The musical Cats begins a run of nearly 18 years on Broadway." },
         { "day":"8", "month":"10", "year":"1991", "text": "Croatia votes to sever its ties with Yugoslavia." },
         { "day":"8", "month":"10", "year":"2001", "text": "US President George W. Bush establishes the Office of Homeland Security." }
      ]
   }
]
