[
   {
      "facts":[
         { "day":"1", "month":"5", "year":"408", "text": "Theodosius II succeeds to the throne of Constantinople." },
         { "day":"1", "month":"5", "year":"1308", "text": "King Albert is murdered by his nephew John, because he refused his share of the Habsburg lands." },
         { "day":"1", "month":"5", "year":"1486", "text": "Christopher Columbus convinces Queen Isabella to fund expedition to the West Indies." },
         { "day":"1", "month":"5", "year":"1805", "text": "The state of Virginia passes a law requiring all freed slaves to leave the state, or risk either imprisonment or deportation." },
         { "day":"1", "month":"5", "year":"1863", "text": "The Battle of Chancellorsville begins as Union Gen. Joe Hooker starts his three-pronged attack against Confederate Gen. Robert E. Lee." },
         { "day":"1", "month":"5", "year":"1867", "text": "Reconstruction in the South begins with black voter registration." },
         { "day":"1", "month":"5", "year":"1877", "text": "President Ruthoford B. Hayes withdraws all Federal troops from the South, ending Reconstruction." },
         { "day":"1", "month":"5", "year":"1898", "text": "The U.S. Navy under Dewey defeats the Spanish fleet at the Battle of Manila Bay in the Philippines." },
         { "day":"1", "month":"5", "year":"1915", "text": "The luxury liner Lusitania leaves New York Harbor for a voyage to Europe." },
         { "day":"1", "month":"5", "year":"1927", "text": "Adolf Hitler holds his first Nazi meeting in Berlin." },
         { "day":"1", "month":"5", "year":"1931", "text": "The Empire State Building opens in New York." },
         { "day":"1", "month":"5", "year":"1934", "text": "The Philippine legislature accepts a U.S. proposal for independence." },
         { "day":"1", "month":"5", "year":"1937", "text": "President Franklin Roosevelt signs an act of neutrality, keeping the United States out of World War II." },
         { "day":"1", "month":"5", "year":"1941", "text": "The film Citizen Kane–directed and starring Orson Welles–opens in New York." },
         { "day":"1", "month":"5", "year":"1944", "text": "The Messerschmitt Me 262, the first combat jet, makes its first flight." },
         { "day":"1", "month":"5", "year":"1945", "text": "Martin Bormann, private secretary to Adolf Hitler, escapes the Fuehrerbunker as the Red Army advances on Berlin." },
         { "day":"1", "month":"5", "year":"1948", "text": "North Korea is established." },
         { "day":"1", "month":"5", "year":"1950", "text": "Gwendolyn Brooks becomes the first African American to win the Pulitzer Prize for her book of poetry called Annie Allen." },
         { "day":"1", "month":"5", "year":"1960", "text": "Francis Gary Powers’ U-2 spy plane is shot down over Russia." },
         { "day":"1", "month":"5", "year":"1961", "text": "Fidel Castro announces there will be no more elections in Cuba." },
         { "day":"1", "month":"5", "year":"1968", "text": "In the second day of battle, U.S. Marines, with the support of naval fire, continue their attack on a North Vietnamese Division at Dai Do." },
         { "day":"1", "month":"5", "year":"1970", "text": "Students from Kent State University riot in downtown Kent, Ohio, in protest of the American invasion of Cambodia." },
         { "day":"1", "month":"5", "year":"1986", "text": "The Tass News Agency reports the Chernobyl nuclear power plant accident." },
         { "day":"1", "month":"5", "year":"2011", "text": "Osama Bin Laden is killed in Abbottabad Pakistan by US Navy SEALS in Operation Neptune Spear." }
      ]
   }
]
