[
   {
      "facts":[
         { "day":"14", "month":"5", "year":"1264", "text": "King Henry III is captured by his brother-in-law, Simon de Montfort, at the Battle of Lewes." },
         { "day":"14", "month":"5", "year":"1509", "text": "At the Battle of Agnadello, the French defeat the Venitians in Northern Italy." },
         { "day":"14", "month":"5", "year":"1610", "text": "French King Henri IV (Henri de Navarre) is assassinated by François Ravillac, a fanatical monk." },
         { "day":"14", "month":"5", "year":"1796", "text": "English physician Edward Jenner gives the first successful smallpox vaccination." },
         { "day":"14", "month":"5", "year":"1804", "text": "Explorer William Clark sets off from St. Louis, Missouri." },
         { "day":"14", "month":"5", "year":"1853", "text": "Gail Borden applies for a patent for condensed milk." },
         { "day":"14", "month":"5", "year":"1863", "text": "Union General Nathanial Banks heads towards Port Hudson along the Mississippi River." },
         { "day":"14", "month":"5", "year":"1897", "text": "Guglielmo Marconi sends first communication by wireless telegraph." },
         { "day":"14", "month":"5", "year":"1897", "text": "\"Stars and Stripes Forever\" by John Phillip Sousa is performed for the first time in Philadelphia." },
         { "day":"14", "month":"5", "year":"1935", "text": "A plebiscite in the Philippines ratifies an independence agreement." },
         { "day":"14", "month":"5", "year":"1940", "text": "Holland surrenders to Germany." },
         { "day":"14", "month":"5", "year":"1942", "text": "The British Army, in retreat from Burma, reach India." },
         { "day":"14", "month":"5", "year":"1948", "text": "Prime Minister David Ben-Gurion establishes the State of Israel." },
         { "day":"14", "month":"5", "year":"1961", "text": "A bus carrying black and white civil rights activists is bombed and burned in Alabama." },
         { "day":"14", "month":"5", "year":"1969", "text": "Three companies of the 101st Airborne Division fail to push North Vietnamese forces off Hill 937 in South Vietnam." },
         { "day":"14", "month":"5", "year":"1973", "text": "The U.S. space station Skylab is launched." },
         { "day":"14", "month":"5", "year":"1991", "text": "In South Africa, Winnie Mandela is sentenced to six years in prison for her part in the kidnapping and beating of three black youths and the death of a fourth." }
      ]
   }
]
