[
   {
      "facts":[
         { "day":"19", "month":"5", "year":"715", "text": "St. Gregory II begins his reign as Catholic Pope." },
         { "day":"19", "month":"5", "year":"1535", "text": "French explorer Jacques Cartier sets sail for North America." },
         { "day":"19", "month":"5", "year":"1536", "text": "Anne Boleyn, Henry VIII’s second wife, is beheaded on Tower Green." },
         { "day":"19", "month":"5", "year":"1568", "text": "Defeated by the Protestants, Mary, Queen of Scots, flees to England where Queen Elizabeth imprisons her." },
         { "day":"19", "month":"5", "year":"1588", "text": "The Spanish Armada sets sail from Lisbon, Spain." },
         { "day":"19", "month":"5", "year":"1608", "text": "The Protestant states form the Evangelical Union of Lutherans and Calvinists." },
         { "day":"19", "month":"5", "year":"1635", "text": "Cardinal Richelieu of France intervenes in the great conflict in Europe by declaring war on the Hapsburgs in Spain." },
         { "day":"19", "month":"5", "year":"1643", "text": "The French army defeats a Spanish army at Rocroi, France." },
         { "day":"19", "month":"5", "year":"1780", "text": "Near total darkness descends on New England at noon. No explanation is found." },
         { "day":"19", "month":"5", "year":"1856", "text": "Senator Charles Sumner speaks out against slavery." },
         { "day":"19", "month":"5", "year":"1858", "text": "A pro-slavery band led by Charles Hameton executes unarmed Free State men near Marais des Cygnes on the Kansas-Missouri border." },
         { "day":"19", "month":"5", "year":"1863", "text": "Union General Ulysses S. Grant’s first attack on Vicksburg is repulsed." },
         { "day":"19", "month":"5", "year":"1864", "text": "The Union and Confederate armies launch their last attacks against each other at Spotsylvania, Virginia." },
         { "day":"19", "month":"5", "year":"1921", "text": "Congress sharply curbs immigration, setting a national quota system." },
         { "day":"19", "month":"5", "year":"1935", "text": "The National Football League adopts an annual college draft to begin in 1936." },
         { "day":"19", "month":"5", "year":"1964", "text": "U.S. diplomats find at least 40 microphones planted in the American embassy in Moscow." },
         { "day":"19", "month":"5", "year":"1967", "text": "U.S. planes bomb Hanoi for the first time." }
      ]
   }
]
