[
   {
      "facts":[
         { "day":"23", "month":"5", "year":"1430", "text": "Burgundians capture Joan of Arc and sell her to the English." },
         { "day":"23", "month":"5", "year":"1533", "text": "Henry VIII’s marriage to Catherine of Aragon is declared null and void." },
         { "day":"23", "month":"5", "year":"1618", "text": "The Thirty Years War begins." },
         { "day":"23", "month":"5", "year":"1701", "text": "Captain William Kidd, the Scottish pirate, is hanged on the banks of the Thames." },
         { "day":"23", "month":"5", "year":"1785", "text": "Benjamin Franklin announces his invention of bifocals." },
         { "day":"23", "month":"5", "year":"1788", "text": "South Carolina becomes the eighth state to ratify U.S. Constitution." },
         { "day":"23", "month":"5", "year":"1861", "text": "Pro-Union and pro-Confederate forces clash in western Virginia." },
         { "day":"23", "month":"5", "year":"1862", "text": "Confederate General \"Stonewall\" Jackson takes Front Royal, Virginia." },
         { "day":"23", "month":"5", "year":"1864", "text": "Union General Ulysses Grant attempts to outflank Confederate Robert E. Lee in the Battle of North Anna, Virginia." },
         { "day":"23", "month":"5", "year":"1900", "text": "Civil War hero Sgt. William H. Carney becomes the first African American to receive the Medal of Honor, thirty-seven years after the Battle of Fort Wagner." },
         { "day":"23", "month":"5", "year":"1901", "text": "American forces capture Filipino rebel leader Emilio Aguinaldo." },
         { "day":"23", "month":"5", "year":"1915", "text": "Italy declares war on Austria-Hungary." },
         { "day":"23", "month":"5", "year":"1934", "text": "Gangsters Bonnie Parker and Clyde Barrow are killed by Texas Rangers." },
         { "day":"23", "month":"5", "year":"1945", "text": "Heinrich Himmler, the head of the Nazi Gestapo, commits suicide after being captured by Allied forces." },
         { "day":"23", "month":"5", "year":"1949", "text": "The Federal Republic of West Germany is proclaimed." },
         { "day":"23", "month":"5", "year":"1960", "text": "Israel announces the capture of Nazi Adolf Eichmann in Argentina." }
      ]
   }
]
