[
   {
      "facts":[
         { "day":"26", "month":"5", "year":"17", "text": "Germanicus of Rome celebrates his victory over the Germans." },
         { "day":"26", "month":"5", "year":"1328", "text": "William of Ockham forced to flee from Avignon by Pope John XXII." },
         { "day":"26", "month":"5", "year":"1647", "text": "A new law bans Catholic priests from the colony of Massachusetts. The penalty is banishment or death for a second offense." },
         { "day":"26", "month":"5", "year":"1670", "text": "Charles II and Louis XIV sign a secret treaty in Dover, England, ending hostilities between England and France." },
         { "day":"26", "month":"5", "year":"1691", "text": "Jacob Leiser, leader of the popular uprising in support of William and Mary’s succession to the throne, is executed for treason." },
         { "day":"26", "month":"5", "year":"1736", "text": "British and Chickasaw forces defeat the French at the Battle of Ackia." },
         { "day":"26", "month":"5", "year":"1831", "text": "The Russians defeat the Poles at the Battle of Ostrolenska." },
         { "day":"26", "month":"5", "year":"1835", "text": "A resolution is passed in the U.S. Congress stating that Congress has no authority over state slavery laws." },
         { "day":"26", "month":"5", "year":"1864", "text": "The territory of Montana is organized." },
         { "day":"26", "month":"5", "year":"1865", "text": "The last Confederate army surrenders in Shreveport, Louisiana." },
         { "day":"26", "month":"5", "year":"1868", "text": "President Andrew Johnson is aquitted of all charges of impeachment." },
         { "day":"26", "month":"5", "year":"1896", "text": "The last czar of Russia, Nicholas II, is crowned." },
         { "day":"26", "month":"5", "year":"1938", "text": "The House Committee on Un-American Activities begins its work of searching for subversives in the United States." },
         { "day":"26", "month":"5", "year":"1940", "text": "The evacuation of Allied forces from Dunkirk begins." },
         { "day":"26", "month":"5", "year":"1946", "text": "A patent is filed in the United States for the H-bomb." },
         { "day":"26", "month":"5", "year":"1958", "text": "Union Square, San Francisco, becomes a state historical landmark." },
         { "day":"26", "month":"5", "year":"1961", "text": "The civil rights activist group, Freedom Ride Coordinating Committee, is established in Atlanta." },
         { "day":"26", "month":"5", "year":"1961", "text": "A U.S. Air Force bomber flies across the Atlantic in a record of just over three hours." },
         { "day":"26", "month":"5", "year":"1969", "text": "Apollo 10 returns to Earth." },
         { "day":"26", "month":"5", "year":"1977", "text": "The movie Star Wars debuts." }
      ]
   }
]
