[
   {
      "facts":[
         { "day":"7", "month":"5", "year":"558", "text": "The dome of the church of St. Sophia in Constantinople collapses. Its immediate rebuilding is ordered by Justinian." },
         { "day":"7", "month":"5", "year":"1274", "text": "The Second Council of Lyons opens in France to regulate the election of the pope." },
         { "day":"7", "month":"5", "year":"1429", "text": "Joan of Arc breaks the English siege of Orleans." },
         { "day":"7", "month":"5", "year":"1525", "text": "The German peasants’ revolt is crushed by the ruling class and church." },
         { "day":"7", "month":"5", "year":"1763", "text": "Indian chief Pontiac begins his attack on a British fort in present-day Detroit, Michigan." },
         { "day":"7", "month":"5", "year":"1800", "text": "Congress divides the Northwest Territory into two parts. The western part will becomes the Indiana Territory and the eastern section remains the Northwest Territory." },
         { "day":"7", "month":"5", "year":"1824", "text": "Beethoven’s ]\"Ninth Symphony\" premiers in Vienna." },
         { "day":"7", "month":"5", "year":"1847", "text": "The American Medical Association is formed in Philadelphia." },
         { "day":"7", "month":"5", "year":"1862", "text": "Confederate troops strike Union troops at the Battle of Eltham’s Landing in Virginia." },
         { "day":"7", "month":"5", "year":"1864", "text": "The Battle of Wilderness ends with heavy losses to both sides." },
         { "day":"7", "month":"5", "year":"1877", "text": "Indian chief Sitting Bull enters Canada with a trail of Indians after the Battle of Little Big Horn." },
         { "day":"7", "month":"5", "year":"1915", "text": "The German submarine U-20 torpedoes the passenger ship Lusitiania, sinking her in 21 minutes with 1,978 people on board." },
         { "day":"7", "month":"5", "year":"1937", "text": "The German Condor Legion arrives in Spain to assist Fransico Franco’s forces." },
         { "day":"7", "month":"5", "year":"1942", "text": "In the Battle of the Coral Sea, Japanese and American navies attack each other with carrier-launched warplanes. It is the first time in the history of naval warfare where two fleets fought without seeing each other.Two crucial battles in 1942 marked the turning point of the war in the Pacific." },
         { "day":"7", "month":"5", "year":"1943", "text": "The last major German strongholds in North Africa–Tunis and Bizerte–fall to Allied forces." },
         { "day":"7", "month":"5", "year":"1945", "text": "Germany signs an unconditional surrender, effectively ending World War II in Europe." },
         { "day":"7", "month":"5", "year":"1952", "text": "In Korea, Communist POWs at Koje-do riot against their American captors." },
         { "day":"7", "month":"5", "year":"1954", "text": "French troops surrender to the Vietminh at Dien Bien Phu." },
         { "day":"7", "month":"5", "year":"1958", "text": "Howard Johnson sets an aircraft altitude record in F-104." },
         { "day":"7", "month":"5", "year":"1960", "text": "Leonid Brezhnev becomes president of the Soviet Union." }
      ]
   }
]
