[
   {
      "facts":[
        { "day":"1", "month":"7", "year":"69", "text": "Vespasian, a Roman army leader, is hailed as a Roman emperor by the Egyptian legions." },
        { "day":"1", "month":"7", "year":"1543", "text": "England and Scotland sign the Peace of Greenwich." },
        { "day":"1", "month":"7", "year":"1596", "text": "An English fleet under the Earl of Essex, Lord Howard of Effingham and Francis Vere capture and sack Cadiz, Spain." },
        { "day":"1", "month":"7", "year":"1690", "text": "Led by Marshall Luxembourg, the French defeat the forces of the Grand Alliance at Fleurus in the Netherlands." },
        { "day":"1", "month":"7", "year":"1777", "text": "British troops depart from their base at the Bouquet river to head toward Ticonderoga, New York." },
        { "day":"1", "month":"7", "year":"1798", "text": "Napoleon Bonaparte takes Alexandria, Egypt." },
        { "day":"1", "month":"7", "year":"1838", "text": "Charles Darwin presents a paper on his theory of evolution to the Linnean Society in London." },
        { "day":"1", "month":"7", "year":"1862", "text": "Union artillery stops a Confederate attack at Malvern Hill, Virginia." },
        { "day":"1", "month":"7", "year":"1863", "text": "In the first day’s fighting at Gettysburg, Federal forces retreat through the town and dig in at Cemetery Ridge and Cemetery Hill." },
        { "day":"1", "month":"7", "year":"1867", "text": "Canada, by the terms of the British North America Act, becomes an independent dominion." },
        { "day":"1", "month":"7", "year":"1876", "text": "Montenegro declares war on the Turks." },
        { "day":"1", "month":"7", "year":"1898", "text": "American troops take San Juan Hill and El Caney, Cuba, from the Spaniards." },
        { "day":"1", "month":"7", "year":"1916", "text": "The Battle of the Somme begins. Approximately 30,000 men are killed on the first day, two-thirds of them British." },
        { "day":"1", "month":"7", "year":"1942", "text": "Axis troops capture Sevastapol, Crimea, in the Soviet Union." },
        { "day":"1", "month":"7", "year":"1945", "text": "The New York State Commission Against Discrimination is established–the first such agency in the United States." },
        { "day":"1", "month":"7", "year":"1950", "text": "American ground troops arrive in South Korea to halt the advancing North Korean army." },
        { "day":"1", "month":"7", "year":"1961", "text": "British troops land in Kuwait to aid against Iraqi threats." },
        { "day":"1", "month":"7", "year":"1963", "text": "The U.S. postmaster introduces the ZIP code." },
        { "day":"1", "month":"7", "year":"1966", "text": "The U.S. Marines launch Operation Holt in an attempt to finish off a Vietcong battalion in Thua Thien Province in Vietnam." }
      ]
   }
]
