[
   {
      "facts":[
         { "day":"23", "month":"7", "year":"1627", "text": "Sir George Calvert arrives in Newfoundland to develop his land grant." },
         { "day":"23", "month":"7", "year":"1637", "text": "King Charles of England hands over the American colony of Massachusetts to Sir Fernando Gorges, one of the founders of the Council of New England." },
         { "day":"23", "month":"7", "year":"1664", "text": "Wealthy, non-church members in Massachusetts are given the right to vote." },
         { "day":"23", "month":"7", "year":"1793", "text": "The French garrison at Mainz, Germany, falls to the Prussians." },
         { "day":"23", "month":"7", "year":"1803", "text": "Irish patriots throughout the country rebel against Union with Great Britain." },
         { "day":"23", "month":"7", "year":"1829", "text": "William A. Burt patents his \"typographer,\" an early typewriter." },
         { "day":"23", "month":"7", "year":"1849", "text": "German rebels in Baden capitulate to the Prussians." },
         { "day":"23", "month":"7", "year":"1863", "text": "Bill Andeson and his Confederate Bushwackers gut the railway station at Renick, Missouri." },
         { "day":"23", "month":"7", "year":"1865", "text": "William Booth founds the Salvation Army." },
         { "day":"23", "month":"7", "year":"1868", "text": "The 14th Amendment is ratified, granting citizenship to African Americans." },
         { "day":"23", "month":"7", "year":"1885", "text": "Ulysses S. Grant dies of throat cancer at the age of 63." },
         { "day":"23", "month":"7", "year":"1894", "text": "Japanese troops take over the Korean imperial palace." },
         { "day":"23", "month":"7", "year":"1903", "text": "The Ford Motor Company sells its first automobile, the Model A." },
         { "day":"23", "month":"7", "year":"1944", "text": "Soviet troops take Lublin, Poland as the German army retreats." },
         { "day":"23", "month":"7", "year":"1962", "text": "The Geneva Conference on Laos forbids the United States to invade eastern Laos." },
         { "day":"23", "month":"7", "year":"1995", "text": "Two astronomers, Alan Hale in New Mexico and Thomas Bopp in Arizona, almost simultaneouly discover a comet." }
      ]
   }
]
