[
   {
      "facts":[
         { "day":"27", "month":"7", "year":"1214", "text": "At the Battle of Bouvines in France, Philip Augustus of France defeats John of England." },
         { "day":"27", "month":"7", "year":"1245", "text": "Frederick II is deposed by a council at Lyons, which found him guilty of sacrilege." },
         { "day":"27", "month":"7", "year":"1586", "text": "Sir Walter Raleigh returns to England from Virginia." },
         { "day":"27", "month":"7", "year":"1663", "text": "British Parliament passes a second Navigation Act, requiring all goods bound for the colonies be sent in British ships from British ports." },
         { "day":"27", "month":"7", "year":"1689", "text": "Government forces defeat the Scottish Jacobites at the Battle of Killiecrankie." },
         { "day":"27", "month":"7", "year":"1777", "text": "The Marquis of Lafayette arrives in New England to help fight the British." },
         { "day":"27", "month":"7", "year":"1778", "text": "British and French fleets fight to a standoff in the first Battle of Ushant." },
         { "day":"27", "month":"7", "year":"1793", "text": "Robespierre becomes a member of the Committee of Public Safety." },
         { "day":"27", "month":"7", "year":"1861", "text": "President Abraham Lincoln replaces General Irwin McDowell with General George B. McClellen as head of the Army of the Potomac." },
         { "day":"27", "month":"7", "year":"1905", "text": "The International Workers of the World found their labor organization in Chicago." },
         { "day":"27", "month":"7", "year":"1909", "text": "Orville Wright sets a world record for staying aloft in an airplane–one hour, 12 minutes and 40 seconds." },
         { "day":"27", "month":"7", "year":"1914", "text": "British troops invade the streets of Dublin, Ireland, and begin to disarm Irish rebels." },
         { "day":"27", "month":"7", "year":"1921", "text": "Canadians Sir Frederick Banting and Charles Best isolate insulin at the University of Toronto." },
         { "day":"27", "month":"7", "year":"1944", "text": "U.S. troops complete the liberation of Guam." },
         { "day":"27", "month":"7", "year":"1953", "text": "Representatives of the United Nations, Korea and China sign an armistice at Panmunjon, Korea." },
         { "day":"27", "month":"7", "year":"1964", "text": "President Lyndon Johnson sends an additional 5,000 advisers to South Vietnam." },
         { "day":"27", "month":"7", "year":"1980", "text": "Mohammad Reza Shah Pahlavi, the last Shah of Iran dies in Cairo, Egypt." },
         { "day":"27", "month":"7", "year":"1981", "text": "William Wyler, director of Ben Hur, dies." },
         { "day":"27", "month":"7", "year":"1993", "text": "Israeli guns and aircraft pound southern Lebanon in reprisal for rocket attacks by Hezbollah guerrillas." },
         { "day":"27", "month":"7", "year":"2002", "text": "The largest air show disaster in history occurs when a Sukhoi Su-27 fighter crashes during an air show at Lviv, Ukraine, killing 85 and injuring more than 100 others." },
      ]
   }
]
