[
   {
      "facts":[
         { "day":"3", "month":"7", "year":"1775", "text": "George Washington takes command of the Continental Army." },
         { "day":"3", "month":"7", "year":"1790", "text": "In Paris, the Marquis of Condorcet proposes granting civil rights to women." },
         { "day":"3", "month":"7", "year":"1844", "text": "American ambassador Caleb Cushing successfully negotiates a commercial treaty with China." },
         { "day":"3", "month":"7", "year":"1863", "text": "Confederate forces attack the center of the Union line at Gettysburg, but fail to break it." },
         { "day":"3", "month":"7", "year":"1878", "text": "John Wise flies the first dirigible in Lancaster, Pennsylvania." },
         { "day":"3", "month":"7", "year":"1901", "text": "The Wild Bunch, led by Butch Cassidy, commits its last American robbery near Wagner, Montana, taking $65,000 from a Great Northern train." },
         { "day":"3", "month":"7", "year":"1903", "text": "The first cable across the Pacific Ocean is spliced between Honolulu, Midway, Guam and Manila." },
         { "day":"3", "month":"7", "year":"1944", "text": "The U.S. First Army opens a general offensive to break out of the hedgerow area of Normandy, France." },
         { "day":"3", "month":"7", "year":"1945", "text": "U.S. troops land at Balikpapan and take Sepinggan airfield on Borneo in the Pacific." },
         { "day":"3", "month":"7", "year":"1950", "text": "U.S. carrier-based planes attack airfields in the Pyongyang-Chinnampo area of North Korea in the first air-strike of the Korean War." },
         { "day":"3", "month":"7", "year":"1954", "text": "Food rationing ends in Great Britain almost nine years after the end of World War II." },
         { "day":"3", "month":"7", "year":"1962", "text": "Jackie Robinson becomes the first African American to be inducted into the National Baseball Hall of Fame." },
         { "day":"3", "month":"7", "year":"1967", "text": "North Vietnamese soldiers attack South Vietnam’s only producing coal mine at Nong Son." }
      ]
   }
]
