[
   {
      "facts":[
         { "day":"30", "month":"7", "year":"1619", "text": "The House of Burgesses convenes for the first time at Jamestown, Va." },
         { "day":"30", "month":"7", "year":"1787", "text": "The French parliament refuses to approve a more equitable land tax." },
         { "day":"30", "month":"7", "year":"1799", "text": "The French garrison at Mantua, Italy, surrenders to the Austrians." },
         { "day":"30", "month":"7", "year":"1864", "text": "In an effort to penetrate the Confederate lines around Petersburg, Va. Union troops explode a mine underneath the Confederate trenches but fail to break through. The ensuing action is known as the Battle of the Crater." },
         { "day":"30", "month":"7", "year":"1919", "text": "Federal troops are called out to put down Chicago race riots." },
         { "day":"30", "month":"7", "year":"1938", "text": "George Eastman demonstrates his color motion picture process." },
         { "day":"30", "month":"7", "year":"1940", "text": "A bombing lull ends the first phase of the Battle of Britain." },
         { "day":"30", "month":"7", "year":"1960", "text": "Over 60,000 Buddhists march in protest against the Diem government in South Vietnam." },
         { "day":"30", "month":"7", "year":"1965", "text": "President Lyndon Johnson signs the Medicare Bill into law." },
         { "day":"30", "month":"7", "year":"1967", "text": "General William Westmoreland claims that he is winning the war in Vietnam, but needs more men." },
         { "day":"30", "month":"7", "year":"1975", "text": "Teamster leader Jimmy Hoffa disappears, last seen coming out of a restaurant in Bloomingfield Hills, Michigan." },
         { "day":"30", "month":"7", "year":"1988", "text": "King Hussein dissolves Jordan’s Parliament, surrenders Jordan’s claims to the West Bank to the Palestinian Liberation Organization." },
         { "day":"30", "month":"7", "year":"1990", "text": "Baseball Commissioner Fay Vincent forces George Steinbrenner to resign as principal parter of the New York Yankees." },
         { "day":"30", "month":"7", "year":"2003", "text": "The last of the uniquely shaped \"old style\" Volkswagen Beetles rolls off the assembly line in Mexico." },
         { "day":"30", "month":"7", "year":"2012", "text": "Blackout in India as power grid failure leaves 300 million+ without power." }
      ]
   }
]
