[
   {
      "facts":[
         { "day":"4", "month":"7", "year":"1712", "text": "12 slaves are executed for starting a uprising in New York that killed nine whites." },
         { "day":"4", "month":"7", "year":"1776", "text": "The amended Declaration of Independence, prepared by Thomas Jefferson, is approved and signed by John Hancock–President of the Continental Congress–and Charles Thomson, Congress secretary. The state of New York abstains from signing." },
         { "day":"4", "month":"7", "year":"1817", "text": "Construction begins on the Erie Canal, to connect Lake Erie and the Hudson River." },
         { "day":"4", "month":"7", "year":"1826", "text": "Two of America’s founding fathers–Thomas Jefferson and John Adams–die." },
         { "day":"4", "month":"7", "year":"1831", "text": "The fifth president of the United States, James Monroe, dies at the age of 73." },
         { "day":"4", "month":"7", "year":"1845", "text": "Henry David Thoreau begins his 26-month stay at Walden Pond." },
         { "day":"4", "month":"7", "year":"1855", "text": "Walt Whitman publishes the first edition of Leaves of Grass at his own expense." },
         { "day":"4", "month":"7", "year":"1861", "text": "Union and Confederate forces skirmish at Harpers Ferry." },
         { "day":"4", "month":"7", "year":"1862", "text": "Charles Dodgson first tells the story of Alice’s adventures down the rabbit hole during a picnic along the Thames." },
         { "day":"4", "month":"7", "year":"1863", "text": "The Confederate town of Vicksburg, Mississippi, surrenders to General Ulysses S. Grant." },
         { "day":"4", "month":"7", "year":"1881", "text": "Billy the Kid is shot dead in New Mexico." },
         { "day":"4", "month":"7", "year":"1894", "text": "After seizing power, Judge Stanford B. Dole declares Hawaii a republic." },
         { "day":"4", "month":"7", "year":"1895", "text": "The poem America the Beautiful is first published." },
         { "day":"4", "month":"7", "year":"1901", "text": "William H. Taft becomes the American governor of the Philippines." },
         { "day":"4", "month":"7", "year":"1910", "text": "Race riots break out all over the United States after African American Jack Johnson knocks out Jim Jeffries in a heavyweight boxing match." },
         { "day":"4", "month":"7", "year":"1931", "text": "Novelist James Joyce and Nora Barnacle are married in London after being together for 26 years." },
         { "day":"4", "month":"7", "year":"1934", "text": "Boxer Joe Louis wins his first professional fight." },
         { "day":"4", "month":"7", "year":"1946", "text": "The United States grants the Philippine Islands their independence." },
         { "day":"4", "month":"7", "year":"1960", "text": "The 50-star flag makes its debut in Philadelphia." },
         { "day":"4", "month":"7", "year":"1976", "text": "An Israeli raid at Entebbe airport in Uganda rescues 105 hostages." }
      ]
   }
]
