[
   {
      "facts":[
         { "day":"6", "month":"7", "year":"1415", "text": "Jan Hus, a Czech who spoke out against Church corruption, is burned at the stake as a heretic." },
         { "day":"6", "month":"7", "year":"1519", "text": "Charles of Spain is elected Holy Roman emperor in Barcelona." },
         { "day":"6", "month":"7", "year":"1535", "text": "Sir Thomas More is beheaded in England for refusing to swear allegiance to King Henry VIII as head of the Church." },
         { "day":"6", "month":"7", "year":"1536", "text": "Jaques Cartier returns to France after discovering the St. Lawrence River in Canada." },
         { "day":"6", "month":"7", "year":"1685", "text": "James II defeats James, the Duke of Monmouth, at the Battle of Sedgemoor, the last major battle to be fought on English soil." },
         { "day":"6", "month":"7", "year":"1770", "text": "The entire Ottoman fleet is destroyed by the Russians at the battle of Cesme." },
         { "day":"6", "month":"7", "year":"1788", "text": "10,000 troops are called out in Paris as unrest mounts in the poorer districts over poverty and lack of food." },
         { "day":"6", "month":"7", "year":"1836", "text": "French General Thomas Bugeaud defeats Abd al-Kader’s forces beside the Sikkak River in Algeria." },
         { "day":"6", "month":"7", "year":"1835", "text": "John Marshall, the third chief justice of the Supreme Court, dies at the age of 79. Two days later, while tolling in his honor in Philadelphia, the Liberty Bell cracks." },
         { "day":"6", "month":"7", "year":"1854", "text": "The Republican Party is officially organized in Jackson, Michigan." },
         { "day":"6", "month":"7", "year":"1885", "text": "Louis Pasteur gives the first successful anti-rabies innoculation." },
         { "day":"6", "month":"7", "year":"1944", "text": "Lieutenant Jackie Robinson of the U.S. Army, while riding a civilian bus from Camp Hoo, Texas, refuses to give up his seat to a white man." },
         { "day":"6", "month":"7", "year":"1945", "text": "B-29 Superfortress bombers attack Honshu, Japan, using new fire-bombing techniques." },
         { "day":"6", "month":"7", "year":"1945", "text": "Operation Overcast begins in Europe–moving Austrian and German scientists and their equipment to the United States." },
         { "day":"6", "month":"7", "year":"1982", "text": "President Ronald Reagan agrees to contribute U.S. troops to the peacekeeping unit in Beruit." }
      ]
   }
]
