[
   {
      "facts":[
         { "day":"8", "month":"7", "year":"1099", "text": "Christian Crusaders march around Jerusalem as Muslims watch from within the city." },
         { "day":"8", "month":"7", "year":"1608", "text": "The first French settlement at Quebec is established by Samuel de Champlain." },
         { "day":"8", "month":"7", "year":"1663", "text": "The British crown grants Rhode Island a charter guaranteeing freedom of worship." },
         { "day":"8", "month":"7", "year":"1686", "text": "The Austrians take Budapest from the Turks and annex Hungary." },
         { "day":"8", "month":"7", "year":"1709", "text": "Peter the Great defeats Charles XII at Poltava, in the Ukraine, effectively ending the Swedish empire." },
         { "day":"8", "month":"7", "year":"1755", "text": "Britain breaks off diplomatic relations with France as their disputes in the New World intensify." },
         { "day":"8", "month":"7", "year":"1758", "text": "The British attack on Fort Carillon at Ticonderoga, New York, is foiled by the French." },
         { "day":"8", "month":"7", "year":"1794", "text": "French troops capture Brussels, Belgium." },
         { "day":"8", "month":"7", "year":"1815", "text": "With Napoleon defeated, Louis XVIII returns to Paris." },
         { "day":"8", "month":"7", "year":"1822", "text": "29-year old poet Percy Bysshe Shelley drowns while sailing in Italy." },
         { "day":"8", "month":"7", "year":"1859", "text": "The Truce at Villafranca Austria cedes Lombardy to France." },
         { "day":"8", "month":"7", "year":"1863", "text": "Demoralized by the surrender of Vicksburg, Confederates in Port Hudson, Louisiana, surrender to Union forces." },
         { "day":"8", "month":"7", "year":"1864", "text": "Confederate General Joseph E. Johnston retreats into Atlanta to prevent being flanked by Union General William T. Sherman." },
         { "day":"8", "month":"7", "year":"1865", "text": "Four of the conspirators in President Abraham Lincoln’s assassination are hanged in Washington, D.C." },
         { "day":"8", "month":"7", "year":"1879", "text": "The first ship to use electric lights departs from San Francisco, California." },
         { "day":"8", "month":"7", "year":"1905", "text": "The mutinous crew of the battleship Potemkin surrenders to Rumanian authorities." },
         { "day":"8", "month":"7", "year":"1918", "text": "Ernest Hemingway is wounded in Italy while working as an ambulance driver for the American Red Cross." },
         { "day":"8", "month":"7", "year":"1941", "text": "20 B-17s fly in their first mission with the Royal Air Force over Wilhelmshaven, Germany." },
         { "day":"8", "month":"7", "year":"1943", "text": "American B-24 bombers strike Japanese-held Wake Island for the first time." },
         { "day":"8", "month":"7", "year":"1960", "text": "The Soviet Union charges American pilot Francis Gary Powers with espionage." }
      ]
   }
]
