[
   {
      "facts":[
         { "day":"1", "month":"6", "year":"193", "text": "The Roman emperor, Marcus Didius, is murdered in his palace." },
         { "day":"1", "month":"6", "year":"1533", "text": "Anne Boleyn, Henry VIII’s new queen, is crowned." },
         { "day":"1", "month":"6", "year":"1774", "text": "The British government orders the port of Boston closed." },
         { "day":"1", "month":"6", "year":"1789", "text": "The first U.S. congressional act on administering oaths becomes law." },
         { "day":"1", "month":"6", "year":"1812", "text": "American navy captain James Lawrence, mortally wounded in a naval engagement with the British, exhorts to the crew of his vessel, the Chesapeake, "Don’t give up the ship!"" },
         { "day":"1", "month":"6", "year":"1862", "text": "General Robert E. Lee assumes command of the Confederate army outside Richmond after General Joe Johnston is injured at Seven Pines." },
         { "day":"1", "month":"6", "year":"1864", "text": "The Battle of Cold Harbor, Virginia, begins as Confederate general Robert E. Lee tries to turn Union general Ulysses S. Grant’s flank." },
         { "day":"1", "month":"6", "year":"1868", "text": "James Buchanan, the 15th president of the United States, dies." },
         { "day":"1", "month":"6", "year":"1877", "text": "U.S. troops are authorized to pursue bandits into Mexico." },
         { "day":"1", "month":"6", "year":"1915", "text": "Germany conducts the first zeppelin air raid over England." },
         { "day":"1", "month":"6", "year":"1916", "text": "The National Defense Act increases the strength of the U.S. National Guard by 450,000 men." },
         { "day":"1", "month":"6", "year":"1921", "text": "A race riot erupts in Tulsa, Oklahoma, killing 85 people." },
         { "day":"1", "month":"6", "year":"1939", "text": "The Douglas DC-4 makes its first passenger flight from Chicago to New York." },
         { "day":"1", "month":"6", "year":"1941", "text": "The German Army completes the capture of Crete as the Allied evacuation ends." },
         { "day":"1", "month":"6", "year":"1942", "text": "America begins sending Lend-Lease materials to the Soviet Union." },
         { "day":"1", "month":"6", "year":"1958", "text": "Charles de Gaulle becomes premier of France." },
         { "day":"1", "month":"6", "year":"1963", "text": "Governor George Wallace vows to defy an injunction ordering integration of the University of Alabama." },
         { "day":"1", "month":"6", "year":"1978", "text": "The U.S. reports finding wiretaps in the American embassy in Moscow." }
      ]
   }
]
