[
   {
      "facts":[
         { "day":"10", "month":"6", "year":"1190", "text": "Frederick Barbarossa drowns in a river while leading an army of the Third Crusade."},
         { "day":"10", "month":"6", "year":"1692", "text": "Bridget Bishop is hanged in Salem, Mass., for witchcraft."},
         { "day":"10", "month":"6", "year":"1776", "text": "The Continental Congress appoints a committee to write a Declaration of Independence."},
         { "day":"10", "month":"6", "year":"1801", "text": "Tripoli declares war on the U.S. for refusing to pay tribute."},
         { "day":"10", "month":"6", "year":"1854", "text": "The U.S. Naval Academy in Annapolis, Maryland, holds its first graduation."},
         { "day":"10", "month":"6", "year":"1861", "text": "Dorothea Dix is appointed superintendent of female nurses for the Union army."},
         { "day":"10", "month":"6", "year":"1864", "text": "At the Battle of Brice’s Crossroads in Mississippi, Confederate General Nathan Bedford Forrest defeats the numerically superior Union troops."},
         { "day":"10", "month":"6", "year":"1898", "text": "U.S. Marines land in Cuba."},
         { "day":"10", "month":"6", "year":"1905", "text": "Japan and Russia agree to peace talks brokered by President Theodore Roosevelt."},
         { "day":"10", "month":"6", "year":"1909", "text": "An SOS signal is transmitted for the first time in an emergency when the Cunard liner SS Slavonia is wrecked off the Azores."},
         { "day":"10", "month":"6", "year":"1916", "text": "Mecca, under control of the Turks, falls to the Arabs during the Great Arab Revolt."},
         { "day":"10", "month":"6", "year":"1920", "text": "The Republican convention in Chicago endorses woman suffrage."},
         { "day":"10", "month":"6", "year":"1924", "text": "The Italian socialist leader Giacomo Matteotti is kidnapped and assassinated by Fascists in Rome."},
         { "day":"10", "month":"6", "year":"1925", "text": "Tennessee adopts a new biology text book denying the theory of evolution."},
         { "day":"10", "month":"6", "year":"1940", "text": "The Norwegian army capitulates to the Germans."},
         { "day":"10", "month":"6", "year":"1942", "text": "Germany razes the town of Lidice, Czechoslovakia and kills more than 1,300 citizens in retribution of the murder of Reinhard Heydrich."},
         { "day":"10", "month":"6", "year":"1943", "text": "The Allies begin bombing Germany around the clock."},
         { "day":"10", "month":"6", "year":"1944", "text": "The U.S. VII and V corps, advancing from Normandy’s beaches, link up and begin moving inland."},
         { "day":"10", "month":"6", "year":"1948", "text": "The news that the sound barrier has been broken is finally released to the public by the U.S. Air Force. Chuck Yeager, piloting the rocket airplane X-1, exceeded the speed of sound on October 14, 1947."},
         { "day":"10", "month":"6", "year":"1963", "text": "Buddhist monk Ngo Quang Duc dies by self immolation in Saigon to protest persecution by the Diem government."},
         { "day":"10", "month":"6", "year":"1970", "text": "A 15-man group of special forces troops begin training for Operation Kingpin, a POW rescue mission in North Vietnam."},
         { "day":"10", "month":"6", "year":"1985", "text": "The Israeli army pulls out of Lebanon after 1,099 days of occupation."},
         { "day":"10", "month":"6", "year":"1999", "text": "Serb forces begin their withdrawl from Kosovo after signing an agreement with the NATO powers."},
      ]
   }
]
