[
   {
      "facts":[
         { "day":"14", "month":"6", "year":"1381", "text": "The Peasant’s Revolt, led by Wat Tyler, climaxes when rebels plunder and burn the Tower of London and kill the Archbishop of Canterbury." },
         { "day":"14", "month":"6", "year":"1642", "text": "Massachusetts passes the first compulsory education law in the colonies." },
         { "day":"14", "month":"6", "year":"1645", "text": "Oliver Cromwell’s army routs the king’s army at Naseby." },
         { "day":"14", "month":"6", "year":"1775", "text": "The U.S. Army is founded when the Continental Congress authorizes the muster of troops." },
         { "day":"14", "month":"6", "year":"1777", "text": "The Continental Congress authorizes the "stars and stripes" flag for the new United States." },
         { "day":"14", "month":"6", "year":"1789", "text": "Captain William Bligh of the HMS Bounty arrives in Timor in a small boat. He had been forced to leave his ship when his crew mutinied." },
         { "day":"14", "month":"6", "year":"1846", "text": "A group of settlers declare California to be a republic." },
         { "day":"14", "month":"6", "year":"1864", "text": "At the Battle of Pine Mountain, Georgia, Confederate General Leonidas Polk is killed by a Union shell." },
         { "day":"14", "month":"6", "year":"1893", "text": "The city of Philadelphia observes the first Flag Day." },
         { "day":"14", "month":"6", "year":"1907", "text": "Women in Norway win the right to vote." },
         { "day":"14", "month":"6", "year":"1919", "text": "John William Alcot and Arthur Witten Brown take off from St. John’s, Newfoundland, for Clifden, Ireland, on the first nonstop transatlantic flight." },
         { "day":"14", "month":"6", "year":"1922", "text": "President Warren G. Harding becomes the first president to speak on the radio." },
         { "day":"14", "month":"6", "year":"1927", "text": "Nicaraguan President Porfirio Diaz signs a treaty with the U.S. allowing American intervention in his country." },
         { "day":"14", "month":"6", "year":"1932", "text": "Representative Edward Eslick dies on the floor of the House of Representatives while pleading for the passage of the bonus bill." },
         { "day":"14", "month":"6", "year":"1940", "text": "German forces occupy Paris." },
         { "day":"14", "month":"6", "year":"1942", "text": "The Supreme Court rules that requiring students to salute the American flag is unconstitutional." },
         { "day":"14", "month":"6", "year":"1944", "text": "Boeing B-29 bombers conduct their first raid against mainland Japan." },
         { "day":"14", "month":"6", "year":"1945", "text": "Burma is liberated by the British." },
         { "day":"14", "month":"6", "year":"1949", "text": "The State of Vietnam is formed." },
         { "day":"14", "month":"6", "year":"1951", "text": "UNIVAC, the first computer built for commercial purposes, is demonstrated in Philadelphia by Dr. John W. Mauchly and J. Prosper Eckert, Jr." },
         { "day":"14", "month":"6", "year":"1954", "text": "Americans take part in the first nation-wide civil defense test against atomic attack." },
         { "day":"14", "month":"6", "year":"1965", "text": "A military triumvirate takes control in Saigon, South Vietnam." },
         { "day":"14", "month":"6", "year":"1982", "text": "Argentina surrenders to the United Kingdom ending the Falkland Islands War." },
         { "day":"14", "month":"6", "year":"1985", "text": "Gunmen hijack a passenger jet over the Middle East." },
         { "day":"14", "month":"6", "year":"1989", "text": "Congressman William Gray, an African American, is elected Democratic Whip of the House of Representatives." },
         { "day":"14", "month":"6", "year":"1995", "text": "Chechen rebels take 2,000 people hostage in a hospital in Russia." }
      ]
   }
]
