[
   {
      "facts":[
         { "day":"17", "month":"6", "year":"362", "text": "Emperor Julian issues an edict banning Christians from teaching in Syria." },
         { "day":"17", "month":"6", "year":"1579", "text": "Sir Francis Drake claims San Francisco Bay for England." },
         { "day":"17", "month":"6", "year":"1775", "text": "The British take Bunker Hill outside of Boston, after a costly battle." },
         { "day":"17", "month":"6", "year":"1799", "text": "Napoleon Bonaparte incorporates Italy into his empire." },
         { "day":"17", "month":"6", "year":"1848", "text": "Austrian General Alfred Windischgratz crushes a Czech uprising in Prague." },
         { "day":"17", "month":"6", "year":"1854", "text": "The Red Turban revolt breaks out in Guangdong, China." },
         { "day":"17", "month":"6", "year":"1856", "text": "The Republican Party opens its first national convention in Philadelphia." },
         { "day":"17", "month":"6", "year":"1861", "text": "President Abraham Lincoln witnesses Dr. Thaddeus Lowe demonstrate the use of a hot-air balloon." },
         { "day":"17", "month":"6", "year":"1863", "text": "On the way to Gettysburg, Union and Confederate forces skirmish at Point of Rocks, Maryland." },
         { "day":"17", "month":"6", "year":"1872", "text": "George M. Hoover begins selling whiskey in Dodge City, Kansas–a town which had previously been \"dry.\"" },
         { "day":"17", "month":"6", "year":"1876", "text": "General George Crook’s command is attacked and bested on the Rosebud River by 1,500 Sioux and Cheyenne under the leadership of Crazy Horse." },
         { "day":"17", "month":"6", "year":"1912", "text": "The German Zeppelin SZ 111 burns in its hangar in Friedrichshafen." },
         { "day":"17", "month":"6", "year":"1913", "text": "U.S. Marines set sail from San Diego to protect American interests in Mexico." },
         { "day":"17", "month":"6", "year":"1917", "text": "The Russian Duma meets in secret session in Petrograd and votes for an immediate Russian offensive against the German Army." },
         { "day":"17", "month":"6", "year":"1924", "text": "The Fascist militia marches into Rome." },
         { "day":"17", "month":"6", "year":"1926", "text": "Spain threatens to quit the League of Nations if Germany is allowed to join." },
         { "day":"17", "month":"6", "year":"1930", "text": "The Smoot-Hawley Tariff Bill becomes law, placing the highest tariff on imports to the United States." },
         { "day":"17", "month":"6", "year":"1931", "text": "British authorities in China arrest Indochinese Communist leader Ho Chi Minh." },
         { "day":"17", "month":"6", "year":"1932", "text": "The U.S. Senate defeats the Bonus Bill as 10,000 veterans mass around the Capitol." },
         { "day":"17", "month":"6", "year":"1940", "text": "The Soviet Union occupies Lithuania, Latvia, and Estonia." },
         { "day":"17", "month":"6", "year":"1942", "text": "Yank a weekly magazine for the U.S. armed services, begins publication." },
         { "day":"17", "month":"6", "year":"1944", "text": "French troops land on the island of Elba in the Mediterranean." },
         { "day":"17", "month":"6", "year":"1950", "text": "Surgeon Richard Lawler performs the first kidney transplant operation in Chicago." },
         { "day":"17", "month":"6", "year":"1953", "text": "Soviet tanks fight thousands of Berlin workers rioting against the East German government." },
         { "day":"17", "month":"6", "year":"1963", "text": "The U.S. Supreme Court bans the required reading of the Lord’s prayer and Bible in public schools." },
         { "day":"17", "month":"6", "year":"1965", "text": "27 B-52s hit Viet Cong outposts, but lose two planes in South Vietnam." },
         { "day":"17", "month":"6", "year":"1970", "text": "North Vietnamese troops cut the last operating rail line in Cambodia." },
         { "day":"17", "month":"6", "year":"1972", "text": "Five men are arrested for burglarizing Democratic Party headquarters at the Watergate complex in Washington, D.C." },
         { "day":"17", "month":"6", "year":"1994", "text": "Millions of Americans watch former football player O.J. Simpson–facing murder charges–drive his Ford Bronco through Los Angeles, followed by police." }      ]
   }
]
