[
   {
      "facts":[
         { "day":"19", "month":"6", "year":"240 BC", "text": "Eratosthenes estimates the circumference of Earth using two sticks." },
         { "day":"19", "month":"6", "year":"1778", "text": "General George Washington’s troops finally leave Valley Forge after a winter of training." },
         { "day":"19", "month":"6", "year":"1821", "text": "The Ottomans defeat the Greeks at the Battle of Dragasani." },
         { "day":"19", "month":"6", "year":"1846", "text": "The New York Knickerbocker Club plays the New York Club in the first baseball game at Elysian Field, Hoboken, New Jersey." },
         { "day":"19", "month":"6", "year":"1848", "text": "The first Women’s Rights Convention convenes in Seneca Falls, New York." },
         { "day":"19", "month":"6", "year":"1861", "text": "Virginians, in what will soon be West Virginia, elect Francis Pierpoint as their provisional governor." },
         { "day":"19", "month":"6", "year":"1862", "text": "President Abraham Lincoln outlines his Emancipation Proclamation. News of the document reaches the South." },
         { "day":"19", "month":"6", "year":"1864", "text": "The USS Kearsarge sinks the CSS Alabama off of Cherbourg, France." },
         { "day":"19", "month":"6", "year":"1867", "text": "Mexican Emperor Maximillian is executed." },
         { "day":"19", "month":"6", "year":"1885", "text": "The Statue of Liberty arrives in New York City from France." },
         { "day":"19", "month":"6", "year":"1903", "text": "The young school teacher, Benito Mussolini, is placed under investigation by police in Bern, Switzerland." },
         { "day":"19", "month":"6", "year":"1919", "text": "Mustafa Kemal founds the Turkish National Congress at Ankara and denounces the Treaty of Versailles." },
         { "day":"19", "month":"6", "year":"1933", "text": "France grants Leon Trotsky political asylum." },
         { "day":"19", "month":"6", "year":"1934", "text": "The National Archives and Records Administration is established." },
         { "day":"19", "month":"6", "year":"1937", "text": "The town of Bilbao, Spain, falls to the Nationalist forces." },
         { "day":"19", "month":"6", "year":"1942", "text": "Prime Minister Winston Churchill arrives in Washington D.C. to discuss the invasion of North Africa with President Roosevelt." },
         { "day":"19", "month":"6", "year":"1944", "text": "U.S. Navy carrier-based planes shatter the remaining Japanese carrier forces in the Battle of the Marianas." },
         { "day":"19", "month":"6", "year":"1951", "text": "President Harry S. Truman signs the Universal Military Training and Service Act, which extends Selective Service until July 1, 1955 and lowers the draft age to 18." },
         { "day":"19", "month":"6", "year":"1958", "text": "Nine entertainers refuse to answer a congressional committee’s questions on communism." },
         { "day":"19", "month":"6", "year":"1961", "text": "Kuwait regains complete independence from Britain." },
         { "day":"19", "month":"6", "year":"1963", "text": "Soviet cosmonaut, Valentia Tereshkova, becomes the first woman in space." },
         { "day":"19", "month":"6", "year":"1965", "text": "Air Marshall Nguyen Cao Ky becomes South Vietnam’s youngest premier at age 34." },
         { "day":"19", "month":"6", "year":"1968", "text": "Over 50,000 people march on Washington, D.C. to support the Poor People’s Campaign." },
         { "day":"19", "month":"6", "year":"1973", "text": "The Case-Church Amendment prevents further U.S. involvement in Southeast Asia." },
         { "day":"19", "month":"6", "year":"1987", "text": "The U.S. Supreme Court voids the Louisiana law requiring schools to teach creationism." },
         { "day":"19", "month":"6", "year":"1995", "text": "The Richmond Virginia Planning Commission approves plans to place a memorial statue of tennis professional Arthur Ashe." }
      ]
   }
]
