[
   {
      "facts":[
         { "day":"2", "month":"6", "year":"1537", "text": "Pope Paul III bans the enslavement of Indians in the New World." },
         { "day":"2", "month":"6", "year":"1774", "text": "The Quartering Act, requiring American colonists to allow British soldiers into their houses, is reenacted." },
         { "day":"2", "month":"6", "year":"1793", "text": "Maximillian Robespierre, a member of France’s Committee on Public Safety, initiates the \"Reign of Terror.\"" },
         { "day":"2", "month":"6", "year":"1818", "text": "The British army defeats the Maratha alliance in Bombay, India." },
         { "day":"2", "month":"6", "year":"1859", "text": "French forces cross the Ticino River." },
         { "day":"2", "month":"6", "year":"1865", "text": "At Galveston, Texas, Confederate general Edmund Kirby Smith surrenders the Trans-Mississippi Department to Union forces." },
         { "day":"2", "month":"6", "year":"1883", "text": "The first baseball game under electric lights is played in Fort Wayne, Indiana." },
         { "day":"2", "month":"6", "year":"1886", "text": "Grover Cleveland becomes the first American president to wed while in office." },
         { "day":"2", "month":"6", "year":"1910", "text": "Charles Stewart Rolls, one of the founders of Rolls-Royce, becomes the first man to fly an airplane nonstop across the English Channel both ways. Tragically, he becomes Britain’s first aircraft fatality the following month when his biplane breaks up in midair." },
         { "day":"2", "month":"6", "year":"1924", "text": "The United States grants full citizenship to American Indians." },
         { "day":"2", "month":"6", "year":"1928", "text": "Nationalist Chiang Kai-shek captures Peking, China, in a bloodless takeover." },
         { "day":"2", "month":"6", "year":"1942", "text": "The American aircraft carriers Enterprise, Hornet and Yorktown move into their battle positions for the Battle of Midway." },
         { "day":"2", "month":"6", "year":"1944", "text": "Allied \"shuttle bombing\" of Germany begins, with bombers departing from Italy and landing in the Soviet Union." },
         { "day":"2", "month":"6", "year":"1946", "text": "Italian citizens vote by referendum for a republic." },
         { "day":"2", "month":"6", "year":"1948", "text": "Jamaican-born track star Herb McKenley sets a new world record for the 400 yard dash." },
         { "day":"2", "month":"6", "year":"1953", "text": "Elizabeth II is crowned queen of England at Westminster Abbey." },
         { "day":"2", "month":"6", "year":"1954", "text": "Senator Joseph McCarthy charges that there are communists working in the CIA and atomic weapons plants." },
         { "day":"2", "month":"6", "year":"1969", "text": "The Australian aircraft carrier Melbourne slices the destroyer USS Frank E. Evans in half off the shore of South Vietnam." }
      ]
   }
]
