[
   {
      "facts":[
         { "day":"20", "month":"6", "year":"451", "text": "Roman and barbarian warriors halt Attila’s army at the Catalaunian Plains in eastern France." },
         { "day":"20", "month":"6", "year":"1397", "text": "The Union of Kalmar unites Denmark, Sweden, and Norway under one monarch." },
         { "day":"20", "month":"6", "year":"1756", "text": "Nearly 150 British soldiers are imprisoned in the ‘Black Hole’ cell of Calcutta. Most die." },
         { "day":"20", "month":"6", "year":"1793", "text": "Eli Whitney applies for a cotton gin patent." },
         { "day":"20", "month":"6", "year":"1819", "text": "The paddle-wheel steamship Savannah arrives in Liverpool, England, after a voyage of 27 days and 11 hours–the first steamship to successfully cross the Atlantic." },
         { "day":"20", "month":"6", "year":"1837", "text": "18-year-old Victoria is crowned Queen of England." },
         { "day":"20", "month":"6", "year":"1863", "text": "President Abraham Lincoln admits West Virginia into the Union as the 35th state." },
         { "day":"20", "month":"6", "year":"1898", "text": "On the way to the Philippines to fight the Spanish, the U.S. Navy seizes the island of Guam." },
         { "day":"20", "month":"6", "year":"1901", "text": "Charlotte M. Manye of South Africa becomes the first native African to graduate from an American University." },
         { "day":"20", "month":"6", "year":"1910", "text": "Mexican President Porfirio Diaz proclaims martial law and arrests hundreds." },
         { "day":"20", "month":"6", "year":"1920", "text": "Race riots in Chicago, Illinois leave two dead and many wounded." },
         { "day":"20", "month":"6", "year":"1923", "text": "France announces it will seize the Rhineland to assist Germany in paying her war debts." },
         { "day":"20", "month":"6", "year":"1941", "text": "The U.S. Army Air Force is established, replacing the Army Air Corps." },
         { "day":"20", "month":"6", "year":"1955", "text": "The AFL and CIO agree to combine names for a merged group." },
         { "day":"20", "month":"6", "year":"1963", "text": "The United States and the Soviet Union agree to establish a hot line between Washington and Moscow." },
         { "day":"20", "month":"6", "year":"1964", "text": "General William Westmoreland succeeds General Paul Harkins as head of the U.S. forces in Vietnam." },
         { "day":"20", "month":"6", "year":"1967", "text": "Boxing champion Muhammad Ali is convicted of refusing induction into the American armed services." },
         { "day":"20", "month":"6", "year":"1972", "text": "President Richard Nixon names General Creigton Abrams as Chief of Staff of the United States Army." },
         { "day":"20", "month":"6", "year":"1999", "text": "NATO declares an official end to its bombing campaign of Yugoslavia." }
      ]
   }
]
