[
   {
      "facts":[
         { "day":"21", "month":"6", "year":"1667", "text": "The Peace of Breda ends the Second Anglo-Dutch War as the Dutch cede New Amsterdam to the English." },
         { "day":"21", "month":"6", "year":"1675", "text": "Christopher Wren begins work on rebuilding St. Paul’s Cathedral in London after the Great Fire." },
         { "day":"21", "month":"6", "year":"1791", "text": "The French royal family is arrested in Varennes." },
         { "day":"21", "month":"6", "year":"1834", "text": "C. H. McCormick patents the first practical reaper." },
         { "day":"21", "month":"6", "year":"1862", "text": "Union and Confederate forces skirmish at the Chickahominy Creek." },
         { "day":"21", "month":"6", "year":"1863", "text": "In the second day of fighting, Confederate troops fails to dislodge a Union force at the Battle of LaFourche Crossing." },
         { "day":"21", "month":"6", "year":"1887", "text": "Britain celebrates the golden jubilee of Queen Victoria." },
         { "day":"21", "month":"6", "year":"1900", "text": "General Arthur MacArthur offers amnesty to Filipinos rebelling against American rule." },
         { "day":"21", "month":"6", "year":"1908", "text": "Mulai Hafid again proclaims himself the true sultan of Morocco." },
         { "day":"21", "month":"6", "year":"1911", "text": "Porforio Diaz, the ex-president of Mexico, exiles himself to Paris." },
         { "day":"21", "month":"6", "year":"1915", "text": "Germany uses poison gas for the first time in warfare in the Argonne Forest." },
         { "day":"21", "month":"6", "year":"1919", "text": "Germans scuttle their own fleet at Scapa Flow, Scotland." },
         { "day":"21", "month":"6", "year":"1939", "text": "Baseball legend Lou Gehrig is forced to quit baseball because of amyotrophic lateral sclerosis–a disease which wastes muscles." },
         { "day":"21", "month":"6", "year":"1942", "text": "German General Erwin Rommel captures the port city of Tobruk in North Africa." },
         { "day":"21", "month":"6", "year":"1945", "text": "Japanese forces on Okinawa surrender to American troops." },
         { "day":"21", "month":"6", "year":"1948", "text": "Dr. Peter Goldmark demonstrates his “long-playing” record." },
         { "day":"21", "month":"6", "year":"1958", "text": "A federal judge allows Little Rock, Arkansas to delay school integration." },
         { "day":"21", "month":"6", "year":"1963", "text": "France announces it will withdraw from the NATO fleet in the North Atlantic." },
         { "day":"21", "month":"6", "year":"1964", "text": "Three civil rights workers disappear in Meridian, Mississippi." },
         { "day":"21", "month":"6", "year":"1982", "text": "John Hinkley Jr. is found not guilty by reason of insanity for attempting to assassinate President Ronald Reagan." },
         { "day":"21", "month":"6", "year":"1995", "text": "The U.S. Senate votes against the nomination of Dr. Henry W. Foster for Surgeon General." }
      ]
   }
]
