[
   {
      "facts":[
         { "day":"22", "month":"6", "year":"1377", "text": "Richard II, who is still a child, begins his reign, following the death of his grandfather, Edward III. His coronation takes place July 16." },
         { "day":"22", "month":"6", "year":"1558", "text": "The French take the French town of Thioville from the English." },
         { "day":"22", "month":"6", "year":"1772", "text": "Slavery is outlawed in England." },
         { "day":"22", "month":"6", "year":"1807", "text": "British seamen board the USS Chesapeake, a provocation leading to the War of 1812." },
         { "day":"22", "month":"6", "year":"1864", "text": "Confederate General A. P. Hill turns back a Federal flanking movement at the Weldon Railroad near Petersburg, Virginia." },
         { "day":"22", "month":"6", "year":"1876", "text": "General Alfred Terry sends Lieutenant Colonel George A. Custer to the Rosebud and Little Bighorn rivers to search for Indian villages." },
         { "day":"22", "month":"6", "year":"1910", "text": "German bacteriologist Paul Ehrlich announces a definitive cure for syphilis." },
         { "day":"22", "month":"6", "year":"1911", "text": "King George V of England crowned." },
         { "day":"22", "month":"6", "year":"1915", "text": "Austro-German forces occupy Lemberg on the Eastern Front as the Russians retreat." },
         { "day":"22", "month":"6", "year":"1925", "text": "France and Spain agree to join forces against Abd el Krim in Morocco." },
         { "day":"22", "month":"6", "year":"1930", "text": "A son is born to Charles and Anne Morrow Lindbergh." },
         { "day":"22", "month":"6", "year":"1933", "text": "Hitler bans political parties in Germany other than the Nazis." },
         { "day":"22", "month":"6", "year":"1938", "text": "Joe Louis floors Max Schmeling in the first round of the heavyweight bout at Yankee Stadium." },
         { "day":"22", "month":"6", "year":"1940", "text": "France and Germany sign an armistice at Compiegne, on terms dictated by the Nazis." },
         { "day":"22", "month":"6", "year":"1941", "text": "Under the codename Barbarossa, Germany invades the Soviet Union." },
         { "day":"22", "month":"6", "year":"1942", "text": "A Japanese submarine shells Fort Stevens at the mouth of the Columbia River." },
         { "day":"22", "month":"6", "year":"1944", "text": "President Franklin Roosevelt signs the “GI Bill of Rights” to provide broad benefits for veterans of the war." },
         { "day":"22", "month":"6", "year":"1956", "text": "The battle for Algiers begins as three buildings in Casbah are blown up." },
         { "day":"22", "month":"6", "year":"1970", "text": "President Richard Nixon signs the 26th amendment, lowering the voting age to 18." },
         { "day":"22", "month":"6", "year":"1973", "text": "Skylab astronauts splash down safely in the Pacific after a record 28 days in space." },
         { "day":"22", "month":"6", "year":"1980", "text": "The Soviet Union announces a partial withdrawal of its forces from Afghanistan." },
         { "day":"22", "month":"6", "year":"1981", "text": "Mark David Chapman pleads guilty to killing John Lennon." },
         { "day":"22", "month":"6", "year":"1995", "text": "Nigeria’s former military ruler Gen. Olusegun Obasanjo and his chief deputy are charged with conspiracy to overthrow Gen. Sami Abacha’s military government." }
      ]
   }
]
