[
   {
      "facts":[
         { "day":"26", "month":"6", "year":"1096", "text": "Peter the Hermit’s crusaders force their way across Sava, Hungary." },
         { "day":"26", "month":"6", "year":"1243", "text": "The Seljuk Turkish army in Asia Minor is wiped out by the Mongols." },
         { "day":"26", "month":"6", "year":"1541", "text": "Former followers murder Francisco Pizarro, the Spanish Conqueror of Peru." },
         { "day":"26", "month":"6", "year":"1794", "text": "The French defeat an Austrian army at the Battle of Fleurus." },
         { "day":"26", "month":"6", "year":"1804", "text": "The Lewis and Clark Expedition reaches the mouth of the Kansas River after completing a westward trek of nearly 400 river miles." },
         { "day":"26", "month":"6", "year":"1844", "text": "Julia Gardiner and President John Tyler are married in New York City." },
         { "day":"26", "month":"6", "year":"1862", "text": "General Robert E. Lee attacks McClellen’s line at Mechanicsville during the Seven Days’ campaign." },
         { "day":"26", "month":"6", "year":"1863", "text": "Jubal Early and his Confederate forces move into Gettysburg, Pennsylvania." },
         { "day":"26", "month":"6", "year":"1900", "text": "The United States announces it will send troops to fight against the Boxer Rebellion in China." },
         { "day":"26", "month":"6", "year":"1907", "text": "Russia’s nobility demands drastic measures to be taken against revolutionaries." },
         { "day":"26", "month":"6", "year":"1908", "text": "Shah Muhammad Ali’s forces squelch the reform elements of Parliament in Persia." },
         { "day":"26", "month":"6", "year":"1916", "text": "Russian General Aleksei Brusilov renews his offensive against the Germans." },
         { "day":"26", "month":"6", "year":"1917", "text": "General Pershing arrives in France with the American Expeditionary Force." },
         { "day":"26", "month":"6", "year":"1918", "text": "The Germans begin firing their huge 420 mm howitzer, \"Big Bertha,\" at Paris." },
         { "day":"26", "month":"6", "year":"1926", "text": "A memorial to the first U.S. troops in France is unveiled at St. Nazaire." },
         { "day":"26", "month":"6", "year":"1924", "text": "After eight years of occupation, American troops leave the Dominican Republic." },
         { "day":"26", "month":"6", "year":"1942", "text": "The Grumman F6F Hellcat fighter flies for the first time." },
         { "day":"26", "month":"6", "year":"1945", "text": "The U.N. Charter is signed by 50 nations in San Francisco, California." },
         { "day":"26", "month":"6", "year":"1951", "text": "The Soviet Union proposes a cease-fire in the Korean War." },
         { "day":"26", "month":"6", "year":"1961", "text": "A Kuwaiti vote opposes Iraq’s annexation plans." },
         { "day":"26", "month":"6", "year":"1963", "text": "President John Kennedy announces \"Ich bin ein Berliner\" at the Berlin Wall." },
         { "day":"26", "month":"6", "year":"1971", "text": "The U.S. Justice Department issues a warrant for Daniel Ellsberg, accusing him of giving away the Pentagon Papers." },
         { "day":"26", "month":"6", "year":"1975", "text": "Indian Prime Minister Indira Gandhi is convicted of election fraud." },
         { "day":"26", "month":"6", "year":"1993", "text": "Roy Campanella, legendary catcher for the Negro Leagues and the Los Angeles Dodgers, dies." }
      ]
   }
]
