[
   {
      "facts":[
         { "day":"8", "month":"6", "year":"452", "text": "Attila the Hun invades Italy." },
         { "day":"8", "month":"6", "year":"632", "text": "Mohammed, the founder of Islam and unifier of Arabia, dies." },
         { "day":"8", "month":"6", "year":"793", "text": "The Vikings raid the Northumbrian coast of England." },
         { "day":"8", "month":"6", "year":"1861", "text": "Tennessee votes to secede from the Union and join the Confederacy." },
         { "day":"8", "month":"6", "year":"1862", "text": "The Army of the Potomac defeats Confederate forces at Battle of Cross Keys, Virginia." },
         { "day":"8", "month":"6", "year":"1863", "text": "Residents of Vicksburg flee into caves as General Ulysses S. Grant’s army begins shelling the town." },
         { "day":"8", "month":"6", "year":"1866", "text": "Prussia annexes the region of Holstein." },
         { "day":"8", "month":"6", "year":"1904", "text": "U.S. Marines land in Tangiers, Morocco, to protect U.S. citizen." },
         { "day":"8", "month":"6", "year":"1908", "text": "King Edward VII of England visits Czar Nicholas II of Russia in an effort to improve relations between the two countries." },
         { "day":"8", "month":"6", "year":"1915", "text": "William Jennings Bryan quits as Secretary of State under President Wilson." },
         { "day":"8", "month":"6", "year":"1953", "text": "The Supreme Court forbids segregated lunch counters in Washington, D.C." },
         { "day":"8", "month":"6", "year":"1965", "text": "President Johnson authorizes commanders in Vietnam to commit U.S. ground forces to combat." },
         { "day":"8", "month":"6", "year":"1966", "text": "Gemini astronaut Gene Cernan attempts to become the first man to orbit the Earth untethered to a space capsule, but is unable to when he exhausts himself fitting into his rocket pack." },
         { "day":"8", "month":"6", "year":"1967", "text": "Israel airplanes attack the USS Liberty, a surveillance ship, in the Mediterranean, killing 34 Navy crewmen." },
         { "day":"8", "month":"6", "year":"1968", "text": "James Earl Ray, the alleged assassin of Martin Luther King, Jr., is captured at the London Airport." },
         { "day":"8", "month":"6", "year":"1969", "text": "President Richard Nixon meets with President Thieu of South Vietnam to tell him 25,000 U.S. troops will pull out by August." },
         { "day":"8", "month":"6", "year":"1995", "text": "U.S. Air Force pilot Captain Scott O’Grady is rescued by U.S. Marines in Bosnia." }
      ]
   }
]
