[
   {
      "facts":[
         { "day":"9", "month":"6", "year":"1064", "text": "Coimbra, Portugal falls to Ferdinand, king of Castile." },
         { "day":"9", "month":"6", "year":"1534", "text": "Jacques Cartier sails into the mouth of the St. Lawrence River in Canada." },
         { "day":"9", "month":"6", "year":"1790", "text": "Civil war breaks out in Martinique." },
         { "day":"9", "month":"6", "year":"1861", "text": "Mary Ann \"Mother\" Bickerdyke begins working in Union hospitals." },
         { "day":"9", "month":"6", "year":"1863", "text": "At the Battle of Brandy Station in Virginia, Union and Confederate cavalries clash in the largest cavalry battle of the Civil War." },
         { "day":"9", "month":"6", "year":"1923", "text": "Bulgaria’s government is overthrown by the military." },
         { "day":"9", "month":"6", "year":"1931", "text": "Robert H. Goddard patents a rocket-fueled aircraft design." },
         { "day":"9", "month":"6", "year":"1942", "text": "The Japanese high command announces that \"The Midway Occupation operations have been temporarily postponed.\"" },
         { "day":"9", "month":"6", "year":"1945", "text": "Japanese Premier Kantaro Suzuki declares that Japan will fight to the last rather than accept unconditional surrender." },
         { "day":"9", "month":"6", "year":"1951", "text": "After several unsuccessful attacks on French colonial troops, North Vietnam’s General Vo Nguyen Giap orders Viet Minh to withdraw from the Red River Delta." },
         { "day":"9", "month":"6", "year":"1954", "text": "At the Army-McCarthy hearings, attorney Joseph Welch asks Senator Joseph McCarthy \"Have you no sense of decency?\"" },
         { "day":"9", "month":"6", "year":"1959", "text": "The first ballistic missile-carrying submarine, the USS George Washington, is launched." },
         { "day":"9", "month":"6", "year":"1972", "text": "American advisor John Paul Vann is killed in a helicopter accident in Vietnam." },
         { "day":"9", "month":"6", "year":"1986", "text": "NASA publishes a report on the Challenger accident." }
      ]
   }
]
