[
   {
      "facts":[
         { "day":"24", "month":"2", "year": "786", "text" : "Pepin the Short of Gaul dies. His dominions are divided between his sons Charles (Charlemagne) and Carloman." },
         { "day":"24", "month":"2", "year": "1525", "text": "In the first of the Franco-Habsburg Wars, the Holy Roman Emperor Charles V captures the French king Francis I at the Battle of Pavia, Italy." },
         { "day":"24", "month":"2", "year": "1538", "text": "Ferdinand of Hapsburg and John Zapolyai, the two kings of Hungary, conclude the peace of Grosswardein." },
         { "day":"24", "month":"2", "year": "1803", "text": "Chief Justice John Marshall, by refusing to rule on the case of Marbury vs. Madison, asserts the authority of the judicial branch." },
         { "day":"24", "month":"2", "year": "1813", "text": "Off Guiana, the American sloop Hornet sinks the British sloop Peacock." },
         { "day":"24", "month":"2", "year": "1821", "text": "Mexico gains independence from Spain." },
         { "day":"24", "month":"2", "year": "1836", "text": "Some 3,000 Mexicans launch an assault on the Alamo with its 182 Texan defenders." },
         { "day":"24", "month":"2", "year": "1895", "text": "The Cuban War of Independence begins." },
         { "day":"24", "month":"2", "year": "1908", "text": "Japan officially agrees to restrict emigration to the U.S." },
         { "day":"24", "month":"2", "year": "1912", "text": "Italy bombs Beirut in the first act of war against the Ottoman Empire." },
         { "day":"24", "month":"2", "year": "1912", "text": "The Jewish organization Hadassah is founded in New York City." },
         { "day":"24", "month":"2", "year": "1914", "text": "Civil War soldier Joshua Chamberlain dies." },
         { "day":"24", "month":"2", "year": "1916", "text": "A film version of Jules Verne’s 20,000 Leagues Under the Sea opens in New York." },
         { "day":"24", "month":"2", "year": "1921", "text": "Herbert Hoover becomes Secretary of Commerce." },
         { "day":"24", "month":"2", "year": "1928", "text": "The New Gallery of New York exhibits works of Archibald Motley, its first show to feature a black artist." },
         { "day":"24", "month":"2", "year": "1944", "text": "Merrill’s Marauders, a specially trained group of American soldiers, begin their ground campaign against Japan into Burma." },
         { "day":"24", "month":"2", "year": "1945", "text": "U.S. forces liberate prisoners of war in the Los Baños Prison in the Philippines." },
         { "day":"24", "month":"2", "year": "1947", "text": "Franz von Papen is sentenced to eight years in a labor camp for war crimes." },
         { "day":"24", "month":"2", "year": "1959", "text": "Khrushchev rejects the Western plan for the Big Four meeting on Germany." },
         { "day":"24", "month":"2", "year": "1968", "text": "North Vietnamese troops capture the imperial palace in Hue, South Vietnam." },
         { "day":"24", "month":"2", "year": "1972", "text": "Hanoi negotiators walks out of the peace talks in Paris to protest U.S. air raids on North Vietnam." },
         { "day":"24", "month":"2", "year": "1991", "text": "General Norman Schwarzkopf, commander of the coalition army, sends in ground forces during the Gulf War." }
      ]
   }
]
