[
   {
      "facts":[
         { "day":"25", "month":"2", "year": "1570", "text": "Pope Pius V issues the bull Regnans in Excelsis which excommunicates Queen Elizabeth of England." },
         { "day":"25", "month":"2", "year": "1601", "text": "Robert Devereux, the second Earl of Essex and former favorite of Elizabeth I, is beheaded in the Tower of London for high treason." },
         { "day":"25", "month":"2", "year": "1642", "text": "Dutch settlers slaughter lower Hudson Valley Indians in New Netherland, North America, who sought refuge from Mohawk attackers." },
         { "day":"25", "month":"2", "year": "1779", "text": "The British surrender the Illinois country to George Rogers Clark at Vincennes." },
         { "day":"25", "month":"2", "year": "1781", "text": "American General Nathaniel Greene crosses the Dan River on his way to attack Cornwallis." },
         { "day":"25", "month":"2", "year": "1791", "text": "President George Washington sign a bill creating the Bank of the United States." },
         { "day":"25", "month":"2", "year": "1804", "text": "Thomas Jefferson is nominated for president at the Democratic-Republican caucus." },
         { "day":"25", "month":"2", "year": "1815", "text": "Napoleon leaves his exile on the island of Elba, returning to France." },
         { "day":"25", "month":"2", "year": "1831", "text": "The Polish army halts the Russian advance into their country at the Battle of Grochow." },
         { "day":"25", "month":"2", "year": "1836", "text": "Samuel Colt patents the first revolving cylinder multi-shot firearm." },
         { "day":"25", "month":"2", "year": "1862", "text": "Confederate troops abandon Nashville, Tennessee, in the face of Grant’s advance. The ironclad Monitor is commissioned at the Brooklyn Navy Yard." },
         { "day":"25", "month":"2", "year": "1865", "text": "General Joseph E. Johnston replaces John Bell Hood as Commander of the Confederate Army of Tennessee." },
         { "day":"25", "month":"2", "year": "1904", "text": "J.M. Synge’s play Riders to the Sea opens in Dublin." },
         { "day":"25", "month":"2", "year": "1910", "text": "The Dalai Lama flees from the Chinese and takes refuge in India." },
         { "day":"25", "month":"2", "year": "1919", "text": "Oregon introduces the first state tax on gasoline at one cent per gallon, to be used for road construction." },
         { "day":"25", "month":"2", "year": "1913", "text": "The 16th Amendment to the constitution is adopted, setting the legal basis for the income tax." },
         { "day":"25", "month":"2", "year": "1926", "text": "Poland demands a permanent seat on the League of Nations council." },
         { "day":"25", "month":"2", "year": "1928", "text": "Bell Labs introduces a new device to end the fluttering of the television image." },
         { "day":"25", "month":"2", "year": "1943", "text": "U.S. troops retake the Kasserine Pass in Tunisia, where they had been defeated five days before." },
         { "day":"25", "month":"2", "year": "1944", "text": "U.S. forces destroy 135 Japanese planes in Marianas and Guam." },
         { "day":"25", "month":"2", "year": "1952", "text": "French colonial forces evacuate Hoa Binh in Indochina." },
         { "day":"25", "month":"2", "year": "1956", "text": "Stalin is secretly disavowed by Khrushchev at a party congress for promoting the \"cult of the individual.\"" },
         { "day":"25", "month":"2", "year": "1976", "text": "The U.S. Supreme Court rules that states may ban the hiring of illegal aliens." }
      ]
   }
]
