[
   {
      "facts":[
         { "day":"26", "month":"2", "year": "364", "text" : "On the death of Jovian, a conference at Nicaea chooses Valentinan, an army officer who was born in the central European region of Pannania, to succeed him in Asia Minor." },
         { "day":"26", "month":"2", "year": "1154", "text": "William the Bad succeeds his father, Roger the II, in Sicily." },
         { "day":"26", "month":"2", "year": "1790", "text": "As a result of the Revolution, France is divided into 83 departments." },
         { "day":"26", "month":"2", "year": "1815", "text": "Napoleon and 1,200 of his men leave Elba to start the 100-day re-conquest of France." },
         { "day":"26", "month":"2", "year": "1848", "text": "Karl Marx and Frederick Engels publish The Communist Manifesto in London." },
         { "day":"26", "month":"2", "year": "1871", "text": "France and Prussia sign a preliminary peace treaty at Versailles." },
         { "day":"26", "month":"2", "year": "1901", "text": "Boxer Rebellion leaders Chi-Hsin and Hsu-Cheng-Yu are publicly executed in Peking." },
         { "day":"26", "month":"2", "year": "1914", "text": "Russian aviator Igor Sikorsky carries 17 passengers in a twin engine plane in St. Petersburg." },
         { "day":"26", "month":"2", "year": "1916", "text": "General Henri Philippe Petain takes command of the French forces at Verdun." },
         { "day":"26", "month":"2", "year": "1917", "text": "President Wilson publicly asks congress for the power to arm merchant ships." },
         { "day":"26", "month":"2", "year": "1924", "text": "U.S. steel industry finds claims an eight-hour day increases efficiency and employee relations." },
         { "day":"26", "month":"2", "year": "1933", "text": "Ground is broken for the Golden Gate Bridge in San Francisco." },
         { "day":"26", "month":"2", "year": "1936", "text": "Japanese military troops march into Tokyo to conduct a coup and assassinate political leaders." },
         { "day":"26", "month":"2", "year": "1941", "text": "British take the Somali capital in East Africa." },
         { "day":"26", "month":"2", "year": "1943", "text": "U.S. Flying Fortresses and Liberators pound German docks and U-boat lairs at Wilhelmshaven." },
         { "day":"26", "month":"2", "year": "1945", "text": "Syria declares war on Germany and Japan." },
         { "day":"26", "month":"2", "year": "1951", "text": "The 22nd Amendment is added to the Constitution limiting the Presidency to two terms." },
         { "day":"26", "month":"2", "year": "1964", "text": "Lyndon B. Johnson signs a tax bill with $11.5 billion in cuts." },
         { "day":"26", "month":"2", "year": "1965", "text": "Norman Butler is arrested for the murder of Malcom X." },
         { "day":"26", "month":"2", "year": "1968", "text": "Thirty-two African nations agree to boycott the Olympics because of the presence of South Africa." },
         { "day":"26", "month":"2", "year": "1970", "text": "Five Marines are arrested on charges of murdering 11 South Vietnamese women and children." },
         { "day":"26", "month":"2", "year": "1972", "text": "Soviets recover Luna 20 with a cargo of moon rocks." },
         { "day":"26", "month":"2", "year": "1973", "text": "A publisher and 10 reporters are subpoenaed to testify on Watergate." },
         { "day":"26", "month":"2", "year": "1990", "text": "Daniel Ortega, communist president of Nicaragua, suffers a shocking election defeat at the hands of Violeta Chamorro." },
         { "day":"26", "month":"2", "year": "1993", "text": "A bomb rocks the World Trade Center in New York City. Five people are killed and hundreds suffer from smoke inhalation." }
      ]
   }
]
