[
   {
      "facts":[
         { "day":"29", "month":"2", "year": "45 BC", "text": "The first Leap Day is recognized by proclamation of Julius Caesar. Under the old Roman calendar, the last day of February was the last day of the year." },
         { "day":"29", "month":"2", "year": "1692", "text": "Sarah Goode and Tituba are accused of witchcraft in Salem, Massachusetts, sparking the hysteria that started the Salem Witch Trials." },
         { "day":"29", "month":"2", "year": "1784", "text": "The Marquis de Sade is transferred from Vincennes fortress to the Bastille." },
         { "day":"29", "month":"2", "year": "1856", "text": "Hostilities in Russo-Turkish war cease." },
         { "day":"29", "month":"2", "year": "1864", "text": "Union Grig. Gen. Judson Kilpatrick splits his forces at the Rapidan River ordering Col. Ulric Dahlgren to lead 500 men his men to Goochland Court House, while the remainder followed Kilpatrick in his raid on Richmond." },
         { "day":"29", "month":"2", "year": "1864", "text": "Lt. William B. Cushing leads a landing party from the USS Monticello to Smithville, NC, in an attempt to capture Confederate Brig. Gen. Louis Hebert, only to discover that Hebert and his men had already moved on Wilmington." },
         { "day":"29", "month":"2", "year": "1868", "text": "British Prime Minister Benjamin Disreali forms his first cabinet." },
         { "day":"29", "month":"2", "year": "1940", "text": "Hattie McDaniel is first African American to win an Academy Award–best supporting actress–for her performance in Gone With The Wind." },
         { "day":"29", "month":"2", "year": "1944", "text": "US forces catch Japanese troops off-guard and easily take control of the Admiralty Islands in Papua New Guinea." },
         { "day":"29", "month":"2", "year": "1944", "text": "Dorothy Vredenburgh accepts an appointment by the Democratic National Committee becoming the first woman secretary of a national political party in the U.S." },
         { "day":"29", "month":"2", "year": "1952", "text": "The first pedestrian \"Walk/Don’t Walk\" signs are installed at 44th Street and Broadway at Times Square." },
         { "day":"29", "month":"2", "year": "1956", "text": "President Dwight D. Eisenhower announces he will seek second term." },
         { "day":"29", "month":"2", "year": "1964", "text": "President Lyndon B. Johnson reveals U.S. secretly developed the Lockheed A-11 jet fighter." },
         { "day":"29", "month":"2", "year": "1968", "text": "Jocelyn Burnell, of Cambridge University, discovers first pulsar." },
         { "day":"29", "month":"2", "year": "1968", "text": "The Beatles win a Grammy Award for their album Sergeant Pepper’s Lonely Heart Club Band." },
         { "day":"29", "month":"2", "year": "1972", "text": "Henry \"Hank\" Aaron becomes first baseball player to sign a baseball contract for $200,000 a year." },
         { "day":"29", "month":"2", "year": "1988", "text": "A Nazi document is discovered that implicates participation of Austrian president and former U.N. Secretary General Kurt Waldheim in WWII deportations." }
      ]
   }
]
