[
   {
      "facts":[
         { "day":"1", "month":"8", "year":"902", "text": "The Aghlabid rulers of Ifriqiyah (modern day Tunisia) capture Taormina, Sicily." },
         { "day":"1", "month":"8", "year":"1096", "text": "The crusaders under Peter the Hermit reach Constantinople." },
         { "day":"1", "month":"8", "year":"1464", "text": "Piero de Medici succeeds his father, Cosimo, as ruler of Florence." },
         { "day":"1", "month":"8", "year":"1664", "text": "The Turkish army is defeated by French and German troops at St. Gotthard, Hungary." },
         { "day":"1", "month":"8", "year":"1689", "text": "James II’s siege of Londonderry, Ireland, ends in failure. James’ force had suffered some 8,000 casualties to the defenders’ 3,600." },
         { "day":"1", "month":"8", "year":"1740", "text": "Thomas Arne’s song \"Rule Britannia\" is performed for the first time." },
         { "day":"1", "month":"8", "year":"1759", "text": "British and Hanoverian armies defeat the French at the Battle of Minden, Germany." },
         { "day":"1", "month":"8", "year":"1791", "text": "Robert Carter III, a Virginia plantation owner, frees all 500 of his slaves in the largest private emancipation in U.S. history. An 1839 mutiny aboard a Spanish ship in Cuban waters raised basic questions about freedom and slavery in the United States." },
         { "day":"1", "month":"8", "year":"1798", "text": "Admiral Horatio Nelson routs the French fleet in the Battle of the Nile at Aboukir Bay, Egypt." },
         { "day":"1", "month":"8", "year":"1801", "text": "The American schooner Enterprise captures the Barbary cruiser Tripoli.Often venturing into harm’s way, America’s most famous sailing ship, the Constitution, twice came close to oblivion." },
         { "day":"1", "month":"8", "year":"1834", "text": "Slavery is abolished throughout the British Empire." },
         { "day":"1", "month":"8", "year":"1864", "text": "Union General Ulysses S. Grant gives general Philip H. Sheridan the mission of clearing the Shenandoah Valley of Confederate forces.After nearly 10 months of trench warfare, Confederate resistance at Petersburg, Virginia, suddenly collapsed." },
         { "day":"1", "month":"8", "year":"1872", "text": "The first long-distance gas pipeline in the U.S. is completed. Designed for natural gas, the two-inch pipe ran five miles from Newton Wells to Titusville, Pennsylvania." },
         { "day":"1", "month":"8", "year":"1873", "text": "San Francisco’s first cable cars begin running, operated by Hallidie’s Clay Street Hill Railroad Company." },
         { "day":"1", "month":"8", "year":"1880", "text": "Sir Frederick Roberts frees the British Afghanistan garrison of Kandahar from Afghan rebels." },
         { "day":"1", "month":"8", "year":"1893", "text": "A machine for making shredded wheat breakfast cereal is patented." },
         { "day":"1", "month":"8", "year":"1914", "text": "Germany declares war on Russia." },
         { "day":"1", "month":"8", "year":"1937", "text": "The Buchenwald concentration camp in Germany becomes operational.The Nuremberg Trial brought high-ranking Nazis to justice." },
         { "day":"1", "month":"8", "year":"1939", "text": "Synthetic vitamin K is produced for the first time." },
         { "day":"1", "month":"8", "year":"1941", "text": "The Grumman TBF Avenger torpedo plane makes its first flight." },
         { "day":"1", "month":"8", "year":"1942", "text": "Ensign Henry C. White, while flying a J4F Widgeon plane, sinks U-166 as it approaches the Mississippi River, the first U-boat sunk by the U.S. Coast Guard." },
         { "day":"1", "month":"8", "year":"1943", "text": "Over 177 B-24 Liberator bombers attack the oil fields in Ploesti, Rumania, for a second time." },
         { "day":"1", "month":"8", "year":"1944", "text": "The Polish underground begins an uprising against the occupying German army, as the Red Army approaches Warsaw." },
         { "day":"1", "month":"8", "year":"1946", "text": "President Harry S Truman establishes Atomic Energy Commission." },
         { "day":"1", "month":"8", "year":"1950", "text": "Lead elements of the U.S. 2nd Infantry Division arrive in Korea from the United States." },
         { "day":"1", "month":"8", "year":"1954", "text": "The Geneva Accords divide Vietnam into two countries at the 17th parallel." },
         { "day":"1", "month":"8", "year":"1957", "text": "US and Canada create North American Air Defense Command (NORAD)." },
         { "day":"1", "month":"8", "year":"1960", "text": "Singer Chubby Checker releases \"The Twist,\" creating a new dance craze. The song had been released by Hank Ballard and the Midnighters the previous year but got little attention." },
         { "day":"1", "month":"8", "year":"1964", "text": "Arthur Ashe becomes the first African-American to play on the U.S. Davis Cup tennis team." },
         { "day":"1", "month":"8", "year":"1966", "text": "Charles Whitman, shooting from the Texas Tower at the University of Texas, kills 16 people and wounds 31 before being killed himself." },
         { "day":"1", "month":"8", "year":"1988", "text": "Conservative commentator Rush Limbaugh begins his national radio show." },
         { "day":"1", "month":"8", "year":"2004", "text": "In Asuncion, Paraguay, a fire in the Ycua Bolanos V supermarket complex kills nearly 400 people and injures 500." },
         { "day":"1", "month":"8", "year":"2007", "text": "The I-35W bridge at Minneapolis, Minnesota, collapses into the Mississippi River during evening rush hour, killing 13 people and injuring 145." }
      ]
   }
]
