[
   {
      "facts":[
         { "day":"11", "month":"8", "year":"991", "text": "Danes under Olaf Tryggvason kill Ealdorman Brihtnoth and defeat the Saxons at Maldon." },
         { "day":"11", "month":"8", "year":"1492", "text": "Rodrigo Borgia is elected to the papacy as Pope Alexander VI." },
         { "day":"11", "month":"8", "year":"1792", "text": "A revolutionary commune is formed in Paris, France." },
         { "day":"11", "month":"8", "year":"1856", "text": "A band of rampaging settlers in California kill four Yokut Indians. The settlers had heard unproven rumors of Yokut atrocities." },
         { "day":"11", "month":"8", "year":"1862", "text": "President Abraham Lincoln appoints Union General Henry Halleck to the position of general in chief of the Union Army." },
         { "day":"11", "month":"8", "year":"1904", "text": "German General Lothar von Trotha defeats the Hereros tribe near Waterberg, South Africa." },
         { "day":"11", "month":"8", "year":"1906", "text": "In France, Eugene Lauste receives the first patent for a talking film." },
         { "day":"11", "month":"8", "year":"1908", "text": "Britain’s King Edward VII meets with Kaiser Wilhelm II to protest the growth of the German navy." },
         { "day":"11", "month":"8", "year":"1912", "text": "Moroccan Sultan Mulai Hafid abdicates his throne in the face of internal dissent." },
         { "day":"11", "month":"8", "year":"1916", "text": "The Russia army takes Stanislau, Poland, from the Germans." },
         { "day":"11", "month":"8", "year":"1929", "text": "Babe Ruth hits his 500th major league home run against the Cleveland Indians." },
         { "day":"11", "month":"8", "year":"1941", "text": "Soviet bombers raid Berlin but cause little damage." },
         { "day":"11", "month":"8", "year":"1942", "text": "The German submarine U-73 attacks a Malta-bound British convoy and sinks HMS Eagle, one of the world’s first aircraft carriers." },
         { "day":"11", "month":"8", "year":"1944", "text": "German troops abandon Florence, Italy, as Allied troops close in on the historic city." },
         { "day":"11", "month":"8", "year":"1965", "text": "A small clash between the California Highway Patrol and two black youths sets off six days of rioting in the Watts area of Los Angeles." },
         { "day":"11", "month":"8", "year":"1972", "text": "The last U.S. ground forces withdraw from Vietnam." },
         { "day":"11", "month":"8", "year":"1975", "text": "US vetoes admission of North and South Vietnam to UN." },
         { "day":"11", "month":"8", "year":"1978", "text": "Funeral of Pope Paul VI." },
         { "day":"11", "month":"8", "year":"1984", "text": "Carl Lewis wins four Olympic gold medals, tying the record Jesse Owens set in 1936." },
         { "day":"11", "month":"8", "year":"1988", "text": "Al Qaeda formed at a meeting in Peshawar, Pakistan." },
         { "day":"11", "month":"8", "year":"1989", "text": "Voyager 2 discovers two partial rings around Neptune." },
         { "day":"11", "month":"8", "year":"1990", "text": "Troops from Egypt and Morocco arrive in Saudi Arabia as part of the international operation to prevent Iraq from invading." },
         { "day":"11", "month":"8", "year":"1999", "text": "A tornado in downtown Salt Lake City, Utah, kills one person." },
         { "day":"11", "month":"8", "year":"2003", "text": "Temperatures rise to 112 degrees Fahrenheit (44 degrees Celsius); over 140 people die in the heat wave." },
         { "day":"11", "month":"8", "year":"2003", "text": "NATO assumes command of the international peacekeeping force in Afghanistan, its first major operation outside Europe." }
      ]
   }
]
