[
   {
      "facts":[
         { "day":"12", "month":"8", "year":"30 BC", "text": "Cleopatra VII, Queen of Egypt, commits suicide." },
         { "day":"12", "month":"8", "year":"1099", "text": "At the Battle of Ascalon 1,000 Crusaders, led by Godfrey of Bouillon, route an Egyptian relief column heading for Jerusalem, which had already fallen to the Crusaders." },
         { "day":"12", "month":"8", "year":"1687", "text": "At the Battle of Mohacs, Hungary, Charles of Lorraine defeats the Turks." },
         { "day":"12", "month":"8", "year":"1762", "text": "The British capture Cuba from Spain after a two month siege." },
         { "day":"12", "month":"8", "year":"1791", "text": "Black slaves on the island of Santo Domingo rise up against their white masters." },
         { "day":"12", "month":"8", "year":"1812", "text": "British commander the Duke of Wellington occupies Madrid, Spain, forcing out Joseph Bonaparte." },
         { "day":"12", "month":"8", "year":"1863", "text": "Confederate raider William Quantrill leads a massacre of 150 men and boys in Lawrence, Kansas." },
         { "day":"12", "month":"8", "year":"1864", "text": "After a week of heavy raiding, the Confederate cruiser Tallahassee claims six Union ships captured." },
         { "day":"12", "month":"8", "year":"1896", "text": "Gold is discovered near Dawson City, Yukon Territory, Canada. After word reaches the United States in June of 1897, thousands of Americans head to the Klondike to seek their fortunes." },
         { "day":"12", "month":"8", "year":"1898", "text": "The Spanish American War officially ends after three months and 22 days of hostilities." },
         { "day":"12", "month":"8", "year":"1908", "text": "Henry Ford’s first Model T rolls off the assembly line." },
         { "day":"12", "month":"8", "year":"1922", "text": "The home of Frederick Douglass in Washington, D.C. is dedicated as a memorial." },
         { "day":"12", "month":"8", "year":"1935", "text": "President Franklin Roosevelt signs the Social Security Bill." },
         { "day":"12", "month":"8", "year":"1941", "text": "French Marshal Henri Philippe Petain announces full French collaboration with Nazi Germany." },
         { "day":"12", "month":"8", "year":"1961", "text": "The erection of the Berlin Wall begins, preventing access between East and West Germany." },
         { "day":"12", "month":"8", "year":"1969", "text": "American installations at Quan-Loi, Vietnam, come under Viet Cong attack." },
         { "day":"12", "month":"8", "year":"1972", "text": "As U.S. troops leave Vietnam, B-52’s make their largest strike of the war." },
         { "day":"12", "month":"8", "year":"1977", "text": "Steven Biko, leader of the black consciousness movement in South Africa, is arrested." },
         { "day":"12", "month":"8", "year":"1977", "text": "Space shuttle Enterprise makes its first free flight and landing." },
         { "day":"12", "month":"8", "year":"1978", "text": "Tel al-Zaatar massacre at Palestinian refuge camp during Lebanese Civil War." },
         { "day":"12", "month":"8", "year":"1979", "text": "Massive book burnings by press censors begin in Iran." },
         { "day":"12", "month":"8", "year":"1981", "text": "Computer giant IBM introduces its first personal computer." },
         { "day":"12", "month":"8", "year":"1985", "text": "Highest in-flight death toll as 520 die when  Japan Airlines Flight 123  crashes into Mount Takamagahara." },
         { "day":"12", "month":"8", "year":"1992", "text": "The North American Free Trade Agreement (NAFTA) is concluded between the United States, Canada and Mexico, creating the world’s wealthiest trade bloc." },
         { "day":"12", "month":"8", "year":"2000", "text": "Russian Navy submarine K-141 Kursk explodes and sinks with all hands during military exercises in the Barents Sea." },
         { "day":"12", "month":"8", "year":"2005", "text": "An LTTE (Liberation Tigers of Tamil Eelam) sniper mortally wounds Sri Lanka’s foreign minister, Lakshman Kadirgamar, at the minister’s home." },
         { "day":"12", "month":"8", "year":"2012", "text": "Summer Olympics come to a close in London." }
      ]
   }
]
