[
   {
      "facts":[
         { "day":"14", "month":"8", "year":"1457", "text": "The first book ever printed is published by a German astrologer named Faust. He is thrown in jail while trying to sell books in Paris. Authorities concluded that all the identical books meant Faust had dealt with the devil." },
         { "day":"14", "month":"8", "year":"1559", "text": "Spanish explorer de Luna enters Pensacola Bay, Florida." },
         { "day":"14", "month":"8", "year":"1605", "text": "The Popham expedition reaches the Sagadahoc River in present-day Maine and settles there." },
         { "day":"14", "month":"8", "year":"1756", "text": "French commander Louis Montcalm takes Fort Oswego, New England, from the British." },
         { "day":"14", "month":"8", "year":"1793", "text": "Republican troops in France lay siege to the city of Lyons." },
         { "day":"14", "month":"8", "year":"1900", "text": "The European allies enter Beijing, relieving their besieged legations from the Chinese Boxers." },
         { "day":"14", "month":"8", "year":"1917", "text": "The Chinese Parliament declares war on the Central Powers." },
         { "day":"14", "month":"8", "year":"1942", "text": "Dwight D. Eisenhower is named the Anglo-American commander for Operation Torch, the invasion of North Africa." },
         { "day":"14", "month":"8", "year":"1945", "text": "Japan announces its unconditional surrender in World War II." },
         { "day":"14", "month":"8", "year":"1947", "text": "Pakistan becomes an independent country." },
         { "day":"14", "month":"8", "year":"1969", "text": "British troops arrived Northern Ireland in response to sectarian violence between Protestants and Roman Catholics." },
         { "day":"14", "month":"8", "year":"1973", "text": "The United States ends the \"secret\" bombing of Cambodia." },
         { "day":"14", "month":"8", "year":"1987", "text": "Mark McGwire hits his 49th home run of the season, setting the major league home run record for a rookie." },
         { "day":"14", "month":"8", "year":"1995", "text": "Shannon Faulker becomes the first female cadet in the long history of South Carolina’s state military college, The Citadel. Her presence was met with intense resistance, reportedly including death threats, and she left the school a week later." },
         { "day":"14", "month":"8", "year":"2007", "text": "Four co-ordinated suicide bomb attacks in Yazidi towns near Mosul, Iraq, kill more than 400 people." },
         { "day":"14", "month":"8", "year":"2010", "text": "First-ever Summer Youth Olympic Games open, in Singapore. Athletes must be 14–18 years old." }
      ]
   }
]
