[
   {
      "facts":[
         { "day":"15", "month":"8", "year":"1261", "text": "Constantinople falls to Michael VIII of Nicea and his army." },
         { "day":"15", "month":"8", "year":"1385", "text": "John of Portugal defeats John of Castile at the Battle of Aljubarrota." },
         { "day":"15", "month":"8", "year":"1598", "text": "Hugh O’Neill, the Earl of Tyrone, leads an Irish force to victory over the British at Battle of Yellow Ford." },
         { "day":"15", "month":"8", "year":"1760", "text": "Frederick II defeats the Austrians at the Battle of Liegnitz." },
         { "day":"15", "month":"8", "year":"1864", "text": "The Confederate raider Tallahassee captures six Federal ships off New England." },
         { "day":"15", "month":"8", "year":"1872", "text": "The first ballot voting in England is conducted." },
         { "day":"15", "month":"8", "year":"1914", "text": "The Panama Canal opens to traffic." },
         { "day":"15", "month":"8", "year":"1935", "text": "American comedian and \"cowboy philosopher\" Will Rogers dies in an airplane accident, along with American aviation pioneer Wiley Post." },
         { "day":"15", "month":"8", "year":"1942", "text": "The Japanese submarine I-25 departs Japan with a floatplane in its hold which will be assembled upon arriving off the West Coast of the United States, and used to bomb U.S. forests." },
         { "day":"15", "month":"8", "year":"1944", "text": "American, British and French forces land on the southern coast of France, between Toulon and Cannes, in Operation Dragoon." },
         { "day":"15", "month":"8", "year":"1945", "text": "Gasoline and fuel oil rationing ends in the United States." },
         { "day":"15", "month":"8", "year":"1947", "text": "Britain grants independence to India and Pakistan." },
         { "day":"15", "month":"8", "year":"1950", "text": "Two U.S. divisions are badly mauled by the North Korean Army at the Battle of the Bowling Alley in South Korea, which rages on for five more days." },
         { "day":"15", "month":"8", "year":"1969", "text": "Over 400,000 young people attend a weekend of rock music at Woodstock, New York." },
         { "day":"15", "month":"8", "year":"1971", "text": "US President Richard Nixon announces a 90-day freeze on wages and prices in an attempt to halt rapid inflation." },
         { "day":"15", "month":"8", "year":"1986", "text": "Ignoring objections from President Ronald Reagan’s Administration, US Senate approves economic sanctions against South Africa to protest that country’s apartheid policies." },
         { "day":"15", "month":"8", "year":"1994", "text": "US Social Security Administration, previously part of the Department of Health and Human Services, becomes an independent government agency." },
         { "day":"15", "month":"8", "year":"1994", "text": "Infamous terrorist Carlos the Jackal captured in Khartoum, Sudan." },
         { "day":"15", "month":"8", "year":"2001", "text": "Astronomers announce the first solar system discovered outside our own; two planets had been found orbiting a star in the Big Dipper." },
         { "day":"15", "month":"8", "year":"2007", "text": "An earthquake of 8.0 magnitude kills over 500 and injures more than 1,000 in Peru." }
      ]
   }
]
