[
   {
      "facts":[
         { "day":"18", "month":"8", "year":"1587", "text": "In the Roanoke Island colony, Ellinor and Ananias Dare become parents of a baby girl whom they name Virginia, the first English child born in what would become the United States." },
         { "day":"18", "month":"8", "year":"1590", "text": "John White, the leader of 117 colonists sent in 1587 to Roanoke Island (North Carolina) to establish a colony, returns from a trip to England to find the settlement deserted. No trace of the settlers is ever found." },
         { "day":"18", "month":"8", "year":"1698", "text": "After invading Denmark and capturing Sweden, Charles XII of Sweden forces Frederick IV of Denmark to sign the Peace of Travendal." },
         { "day":"18", "month":"8", "year":"1759", "text": "The French fleet is destroyed by the British under “Old Dreadnought” Boscawen at the battle of Lagos Bay." },
         { "day":"18", "month":"8", "year":"1782", "text": "Poet and artist William Blake marries Catherine Sophia Boucher." },
         { "day":"18", "month":"8", "year":"1862", "text": "Confederate General J.E.B. Stuart’s headquarters is raided by Union troops of the 5th New York and 1st Michigan cavalries." },
         { "day":"18", "month":"8", "year":"1864", "text": "Union General William T. Sherman sends General Judson Kilpatrick to raid Confederate lines of communication outside Atlanta. The raid is unsuccessful." },
         { "day":"18", "month":"8", "year":"1870", "text": "Prussian forces defeat the French at the Battle of Gravelotte during the Franco-Prussian War." },
         { "day":"18", "month":"8", "year":"1898", "text": "Adolph Ochs takes over the New York Times, saying his aim is to give “the news, all the news, in concise and attractive form, in language that is permissible in good society, and give it early, if not earlier, than it can be learned through any other medium.”" },
         { "day":"18", "month":"8", "year":"1914", "text": "Germany declares war on Russia while President Woodrow Wilson issues his Proclamation of Neutrality." },
         { "day":"18", "month":"8", "year":"1920", "text": "Tennessee becomes the thirty-sixth state to ratify the nineteenth amendment granting women’s sufferage, completing the three-quarters necessary to put the amendment into effect." },
         { "day":"18", "month":"8", "year":"1929", "text": "The first cross-country women’s air derby begins. Louise McPhetride Thaden wins first prize in the heavier-plane division, while Phoebe Fairgrave Omlie finishes first in the lighter-plane category." },
         { "day":"18", "month":"8", "year":"1939", "text": "The film The Wizard of Oz opens in New York City." },
         { "day":"18", "month":"8", "year":"1942", "text": "Japan sends a crack army to Guadalcanal to repulse the U.S. Marines fighting there." },
         { "day":"18", "month":"8", "year":"1943", "text": "The Royal Air Force Bomber Command completes the first major strike against the German missile development facility at Peenemunde." },
         { "day":"18", "month":"8", "year":"1963", "text": "James Meredith, the first African American to attend University of Mississippi, graduates." },
         { "day":"18", "month":"8", "year":"1965", "text": "Operation Starlite marks the beginning of major U.S. ground combat operations in Vietnam." },
         { "day":"18", "month":"8", "year":"1966", "text": "Australian troops repulse a Viet Cong attack at Long Tan." },
         { "day":"18", "month":"8", "year":"1969", "text": "Two concert goers die at the Woodstock Music and Art Fair in Bethel, New York, one from an overdose of heroin, the other from a burst appendix." },
         { "day":"18", "month":"8", "year":"1973", "text": "Hank Aaron makes his 1,378 extra-base hit, surpassing Stan Musial’s record." },
         { "day":"18", "month":"8", "year":"1974", "text": "Luna 24, the USSR’s final major lunar exploration mission, soft-lands on moon." },
         { "day":"18", "month":"8", "year":"1979", "text": "Iran’s Ayatollah Khomeini demands a “Saint War” against Kurds." },
         { "day":"18", "month":"8", "year":"1982", "text": "Pete Rose sets record with his 13,941st plate appearance." },
         { "day":"18", "month":"8", "year":"1987", "text": "Ohio nurse Donald Harvey sentenced to triple life terms for poisoning 24 patients." },
         { "day":"18", "month":"8", "year":"1988", "text": "Republican Convention in New Orleans nominate the George H.W. Bush-Dan Quayle ticket." },
         { "day":"18", "month":"8", "year":"1991", "text": "A group of hard-line communist leaders unhappy with the drift toward the collapse of the Soviet Union seize control of the government in Moscow and place President Mikhail S. Gorbachev under house arrest" },
         { "day":"18", "month":"8", "year":"1993", "text": "Historic Kapelbrug (chapel bridge) in Luzern, Switzerland, burns, destroying 147 of its decorative paintings. It was built in 1365." },
         { "day":"18", "month":"8", "year":"1992", "text": "Dennis Rader, the BTK (Bind, Torture, Kill) killer receives 10 consecutive life sentences. He had terrorized Wichita, Kansas, murdering 10 people between 1974 and 1991." },
         { "day":"18", "month":"8", "year":"2010", "text": "Edelmiro Cavazos, mayor of Santiago, Nuevo Leon, is found handcuffed, blindfolded and dead following his abduction three days earlier. He had championed crackdowns on organized crime and police corruption." },
         { "day":"18", "month":"8", "year":"2011", "text": "Gold hits a record price of $1,826 per ounce." }
      ]
   }
]
