[
   {
      "facts":[
         { "day":"19", "month":"8", "year":"1493", "text": "Maximilian succeeds his father Frederick III as Holy Roman Emperor." },
         { "day":"19", "month":"8", "year":"1587", "text": "Sigismund III is chosen to be the king of Poland." },
         { "day":"19", "month":"8", "year":"1692", "text": "Five women are hanged in Salem, Massachusetts after being convicted of the crime of witchcraft. Fourteen more people are executed that year and 150 others are imprisoned." },
         { "day":"19", "month":"8", "year":"1772", "text": "Gustavus III of Sweden eliminates the rule of parties and establishes an absolute monarchy." },
         { "day":"19", "month":"8", "year":"1779", "text": "Americans under Major Henry Lee take the British garrison at Paulus Hook, New Jersey." },
         { "day":"19", "month":"8", "year":"1812", "text": "The USS Constitution earns the nickname \"Old Ironsides\" during the battle off Nova Scotia that saw her defeat the HMS Guerriere." },
         { "day":"19", "month":"8", "year":"1914", "text": "The British Expeditionary Force (BEF) lands in France." },
         { "day":"19", "month":"8", "year":"1934", "text": "38 million Germans vote to make Adolf Hitler the official successor to President von Hindenburg." },
         { "day":"19", "month":"8", "year":"1936", "text": "Spanish poet Frederico Garcia Lorca is shot by Franco’s troops after being forced to dig his own grave." },
         { "day":"19", "month":"8", "year":"1942", "text": "A raid on Dieppe, France by British and Canadian commandos is repulsed by the German Army." },
         { "day":"19", "month":"8", "year":"1944", "text": "In an effort to prevent a communist uprising in Paris, Charles DeGualle begins attacking German forces all around the city." },
         { "day":"19", "month":"8", "year":"1950", "text": "Edith Sampson becomes the first African-American representative to the United Nations." },
         { "day":"19", "month":"8", "year":"1957", "text": "The first balloon flight to exceed 100,000 feet takes off from Crosby, Minnesota." },
         { "day":"19", "month":"8", "year":"1965", "text": "US forces destroy a Viet Cong stronghold near Van Tuong, in South Vietnam." },
         { "day":"19", "month":"8", "year":"1974", "text": "US Ambassador to Cyrus Rodger P. Davies assassinated by a sniper of Greek Cypriot paramilitary group EOKA-B during a demonstration outside the embassy in Nicosia." },
         { "day":"19", "month":"8", "year":"1976", "text": "Gerald R Ford, who had become President of the United States after Richard Nixon resigned, wins Republican Party’s presidential nomination at Kansas City convention." },
         { "day":"19", "month":"8", "year":"1987", "text": "Hungerford Massacre in the UK; armed with semi-automatic rifles and a handgun Michael Ryan kills 16 people before committing suicide. In response, Parliament passed the Firearms (Amendment) Act of 1988 banning ownership of certain classes of firearms." },
         { "day":"19", "month":"8", "year":"1988", "text": "Cease fire begins in 8-year war between Iran and Iraq." },
         { "day":"19", "month":"8", "year":"1991", "text": "Communist hard-liners place President Mikhail Gorbachev under house arrest in an attempted coup that failed two days later." },
         { "day":"19", "month":"8", "year":"2002", "text": "A Russian Mi-26 helicopter carrying troops is hit by a Chechen missile outside of Grozny, killing 118 soldiers." },
         { "day":"19", "month":"8", "year":"2003", "text": "Shmuel Hanavi bus bombing: suicide attack on a bus in Jerusalem kills 23 Israelis, some of them children, and wounds 130. Islamist militant group Hamas claims responsibility for the attack." },
         { "day":"19", "month":"8", "year":"2004", "text": "Google Inc. stock begins selling on the Nasdaq Stock Market, with an initial price of $85; the stock ended the day at $100.34 with more than 22 million shares traded." },
         { "day":"19", "month":"8", "year":"2005", "text": "Toronto Supercell: A series of thunderstorms spawn several tornadoes and cause flash floods in Southern Ontario. Losses exceed $500 million Canadian dollars, the highest ever in the province." },
         { "day":"19", "month":"8", "year":"2010", "text": "Operation Iraqi Freedom ends; the last US combat brigade, 4th Stryker Brigade, 2nd Infantry Division, leaves the country. Six brigades remain to train Iraqi troops." }
      ]
   }
]
