[
   {
      "facts":[
         { "day":"2", "month":"8", "year":"216 BC", "text":  "Hannibal Barca wins his greatest victory over the Romans at Cannae. After avidly studying the tactics of Hannibal, Scipio Africanus eventually bested his Carthaginian adversary." },
         { "day":"2", "month":"8", "year":"47 BC", "text":  "Caesar defeats Pharnaces at Zela in Syria and declares, \"veni, vidi, vici,\" (I came, I saw, I conquered)." },
         { "day":"2", "month":"8", "year":"1552", "text":  "The treaty of Passau gives religious freedom to Protestants living in Germany." },
         { "day":"2", "month":"8", "year":"1553", "text":  "An invading French army is destroyed at the Battle of Marciano in Italy by an imperial army." },
         { "day":"2", "month":"8", "year":"1589", "text":  "During France’s religious war, a fanatical monk stabs King Henry II to death." },
         { "day":"2", "month":"8", "year":"1776", "text":  "The Continental Congress, having decided unanimously to make the Declaration of Independence, affixes the signatures of the other delegates to the document." },
         { "day":"2", "month":"8", "year":"1790", "text":  "The first US census begins enumerating the population." },
         { "day":"2", "month":"8", "year":"1802", "text":  "Napoleon Bonaparte is proclaimed \"Consul for Life\" by the French Senate after a plebiscite from the French people." },
         { "day":"2", "month":"8", "year":"1819", "text":  "The first parachute jump from a balloon is made by Charles Guille in New York City." },
         { "day":"2", "month":"8", "year":"1832", "text":  "Troops under General Henry Atkinson massacre Sauk Indian men, women and children who are followers of Black Hawk at the Bad Axe River in Wisconsin. Black Hawk himself finally surrenders three weeks later, bringing the Black Hawk War to an end." },
         { "day":"2", "month":"8", "year":"1847", "text":  "William A. Leidesdorff launches the first steam boat in San Francisco Bay." },
         { "day":"2", "month":"8", "year":"1862", "text":  "Union General John Pope captures Orange Court House, Virginia." },
         { "day":"2", "month":"8", "year":"1862", "text":  "The Army Ambulance Corps is established by Maj. Gen. George McClellan." },
         { "day":"2", "month":"8", "year":"1876", "text":  "Wild Bill Hickok is shot while playing poker." },
         { "day":"2", "month":"8", "year":"1914", "text":  "Germany invades Luxembourg." },
         { "day":"2", "month":"8", "year":"1918", "text":  "A British force lands in Archangel, Russia, to support White Russian opposition to the Bolsheviks." },
         { "day":"2", "month":"8", "year":"1923", "text":  "Vice President Calvin Coolidge becomes president upon the death of Warren G. Harding." },
         { "day":"2", "month":"8", "year":"1934", "text":  "German President Paul von Hindenburg dies and Adolf Hitler becomes chancellor." },
         { "day":"2", "month":"8", "year":"1943", "text":  "Lt. John F. Kennedy, towing an injured sailor, swims to a small island in the Solomon Islands. The night before, his boat, PT-109, had been split in half by the Japanese destroyer Amagiri." },
         { "day":"2", "month":"8", "year":"1950", "text":  "The U.S. First Provisional Marine Brigade arrives in Korea from the United States." },
         { "day":"2", "month":"8", "year":"1964", "text":  "U.S. destroyer Maddoxis reportedly attacked by North Vietnamese patrol boats." },
         { "day":"2", "month":"8", "year":"1965", "text":  "Newsman Morley Safer films the destruction of a Vietnamese village by U.S. Marines." },
         { "day":"2", "month":"8", "year":"1990", "text":  "Iraqi forces invade neighboring Kuwait." },
         { "day":"2", "month":"8", "year":"1997", "text":  "Author William S. Burroughs (Naked Lunch), considered the godfather of the \"Beat Generation\" in American literature, dies at age 83." }
      ]
   }
]
