[
   {
      "facts":[
         { "day":"20", "month":"8", "year":"917", "text": "A Byzantine counter-offensive is routed by Syeon at Anchialus, Bulgaria." },
         { "day":"20", "month":"8", "year":"1619", "text": "The first group of twenty Africans is brought to Jamestown, Virginia." },
         { "day":"20", "month":"8", "year":"1667", "text": "John Milton publishes Paradise Lost, an epic poem about the fall of Adam and Eve." },
         { "day":"20", "month":"8", "year":"1741", "text": "Danish navigator Vitus Jonas Bering, commisioned by Peter the Great of Russia to find land connecting Asia and North America, discovers America." },
         { "day":"20", "month":"8", "year":"1794", "text": "American General \"Mad Anthony\" Wayne defeats the Ohio Indians at the Battle of Fallen Timbers in the Northwest territory, ending Indian resistance in the area." },
         { "day":"20", "month":"8", "year":"1847", "text": "General Winfield Scott wins the battle of Churubusco on his drive to Mexico City." },
         { "day":"20", "month":"8", "year":"1904", "text": "Dublin’s Abbey Theatre is founded, an outgrowth of the Irish Literary Theatre founded in 1899 by William Butler Yeats and Lady Gregory." },
         { "day":"20", "month":"8", "year":"1908", "text": "The American Great White Fleet arrives in Sydney, Australia, to a warm welcome." },
         { "day":"20", "month":"8", "year":"1913", "text": "700 feet above Buc, France, parachutist Adolphe Pegond becomes the first person to jump from an airplane and land safely." },
         { "day":"20", "month":"8", "year":"1914", "text": "Russia wins an early victory over Germany at Gumbinnen." },
         { "day":"20", "month":"8", "year":"1940", "text": "After a previous machine gun attack failed, exiled Russian Leon Trotsky is assassinated in Mexico City, with an alpine ax to the back of the head." },
         { "day":"20", "month":"8", "year":"1940", "text": "Radar is used for the first time, by the British during the Battle of Britain. Also on this day, in a radio broadcast, Winston Churchill makes his famous homage to the Royal Air Force: \"Never in the field of human conflict was so much owed by so many to so few.\"" },
         { "day":"20", "month":"8", "year":"1941", "text": "Adolf Hitler authorizes the development of the V-2 missile." },
         { "day":"20", "month":"8", "year":"1944", "text": "United States and British forces close the pincers on German units in the Falaise-Argentan pocket in France." },
         { "day":"20", "month":"8", "year":"1953", "text": "USSR publicly acknowledges it tested a hydrogen bomb eight days earlier." },
         { "day":"20", "month":"8", "year":"1955", "text": "Hundreds killed in anti-French rioting in Morocco and Algeria." },
         { "day":"20", "month":"8", "year":"1960", "text": "USSR recovers 2 dogs, Belka and Strelka, the first animals to be launched into orbit and returned alive (Sputnik 5)." },
         { "day":"20", "month":"8", "year":"1961", "text": "East Germany begins erecting a wall along western border to replace barbed wire put up Aug 13; US 1st Battle Group, 18th Infantry Division arrives in West Berlin." },
         { "day":"20", "month":"8", "year":"1964", "text": "US President Lyndon Baines Johnson signs the Economic Opportunity Act, an anti-poverty measure totaling nearly $1 billion, as part of his War on Poverty." },
         { "day":"20", "month":"8", "year":"1968", "text": "Some 650,000 Warsaw Pact troops invade Czechoslovakia to quell reformers there." },
         { "day":"20", "month":"8", "year":"1971", "text": "The Cambodian military launches a series of operations against the Khmer Rouge." },
         { "day":"20", "month":"8", "year":"1974", "text": "US Vice President Gerald Ford, who had replaced Spiro Agnew, assumes the Office of the President after Richard Nixon resigns; Ford names Nelson Rockefeller as VP." },
         { "day":"20", "month":"8", "year":"1978", "text": "NASA launches Viking 1; with Viking 2, launched a few days later, provided high-resolution mapping of Mars, revolutionizing existing views of the planets." },
         { "day":"20", "month":"8", "year":"1979", "text": "The Penmanshiel Diversion on the  the East Coast Main Line rail route between England and Scotland opens, replacing the 134-year-old Penmanshiel Tunnel that had collapsed in March." },
         { "day":"20", "month":"8", "year":"1980", "text": "UN Security Council condemns Israel’s declaration that all of Jersualem is its capital; vote is 14-0, with US abstaining." },
         { "day":"20", "month":"8", "year":"1982", "text": "A multinational force including 800 US Marines lands in Beirut, Lebanon, to oversee Palestinan withdrawal during the Lebanese Civil War." },
         { "day":"20", "month":"8", "year":"1986", "text": "Part-time mail carrier Patrick Sherrill shoots 20 fellow workers killing 14 at Edmond Okla., the first mass shooting by an individual in an office environment in the US. His actions give rise to the phrase \"going postal,\" for sudden violent outbursts." },
         { "day":"20", "month":"8", "year":"1990", "text": "Iraq moves Western hostages to military installations to use them as human shields against air attacks by a US-led multinational coalition." },
         { "day":"20", "month":"8", "year":"1991", "text": "After an attempted coup in the Soviet Union, Estonia declares independence from the USSR." },
         { "day":"20", "month":"8", "year":"1993", "text": "Secret negotiations in Norway lead to agreement on the Oslo Peace Accords, an attempt to resolve the ongoing Israeli-Palestinian conflict." },
         { "day":"20", "month":"8", "year":"1994", "text": "Miracle, the Sacred White Buffalo, born on Heider Farm near Janesville, Wisc. The first white (not albino) buffalo born since 1933, she was a important religious symbol for many US and Canadian Indian tribes." },
         { "day":"20", "month":"8", "year":"1998", "text": "The Supreme Court of Canada rules Quebec cannot legally secede from Canada without the federal government’s approval." },
         { "day":"20", "month":"8", "year":"1998", "text": "US launches cruise missile attacks against alleged al-Qaida camps in Afghanistan and a suspected chemical plant in Sudan in retaliation for the Aug. 7 bombings of American embassies in Kenya and Tanzania." },
         { "day":"20", "month":"8", "year":"2002", "text": "A group of Iraqis opposed to the regime of Saddam Hussein seize the Iraqi Embassy in Berlin; after five hours they release their hostages and surrender." }
      ]
   }
]
