[
   {
      "facts":[
         { "day":"25", "month":"8", "year":"357", "text": "Julian Caesar defeats the Alamanni at Strousbourg in Gaul." },
         { "day":"25", "month":"8", "year":"1346", "text": "Edward III of England defeats Philip VI’s army at the Battle of Crecy in France." },
         { "day":"25", "month":"8", "year":"1758", "text": "The Prussian army defeats the invading Russians at the Battle of Zorndorf." },
         { "day":"25", "month":"8", "year":"1765", "text": "In protest over the stamp tax, American colonists sack and burn the home of Massachusetts governor Thomas Hutchinson." },
         { "day":"25", "month":"8", "year":"1830", "text": "The \"Tom Thumb\" steam locomotive runs its famous race with a horse-drawn car. The horse wins because the engine, which had been ahead, breaks down." },
         { "day":"25", "month":"8", "year":"1862", "text": "Union and Confederate troops skirmish at Waterloo Bridge, Virginia, during the Second Bull Run Campaign." },
         { "day":"25", "month":"8", "year":"1864", "text": "Confederate General A.P. Hill pushes back Union General Winfield Scott Hancock from Reams Station where his army has spent several days destroying railroad tracks." },
         { "day":"25", "month":"8", "year":"1875", "text": "\"Captain\" Matthew Webb becomes the first man to swim across the English Channel." },
         { "day":"25", "month":"8", "year":"1916", "text": "The National Park Service is established as part of the Department of the Interior." },
         { "day":"25", "month":"8", "year":"1921", "text": "The United States, which never ratified the Versailles Treaty ending World War I, finally signs a peace treaty with Germany." },
         { "day":"25", "month":"8", "year":"1925", "text": "A. Phillip Randolph organizes the Sleeping Car Porters’ Union." },
         { "day":"25", "month":"8", "year":"1940", "text": "The first parachute wedding ceremony is performed by Rev. Homer Tomlinson at the New York City World’s Fair for Arno Rudolphi and Ann Hayward. The minister, bride and groom, best man, maid of honor and four musicians were all suspended from parachutes." },
         { "day":"25", "month":"8", "year":"1941", "text": "British and Soviet forces enter Iran, opening up a route to supply the Soviet Union." },
         { "day":"25", "month":"8", "year":"1943", "text": "The Allies complete the occupation of New Georgia." },
         { "day":"25", "month":"8", "year":"1944", "text": "Paris is liberated from German occupation by Free French Forces under General Jacques LeClerc." },
         { "day":"25", "month":"8", "year":"1948", "text": "The House Un-American Activities Committee holds first-ever televised congressional hearing." },
         { "day":"25", "month":"8", "year":"1950", "text": "President Harry Truman orders the U.S. Army to seize control of the nation’s railroads to avert a strike." },
         { "day":"25", "month":"8", "year":"1980", "text": "Zimbabwe joins the United Nations." },
         { "day":"25", "month":"8", "year":"1981", "text": "Voyager 2 spacecraft makes its closest approach to Saturn." },
         { "day":"25", "month":"8", "year":"1989", "text": "NASA scientists receive stuning photographs of Neptune and its moons from Voyager 2." },
         { "day":"25", "month":"8", "year":"1989", "text": "Mayumi Moiyama, formerly head of Japan’s Environmental Agency, becomes Japan’s first female cabinet secretary" },
         { "day":"25", "month":"8", "year":"1991", "text": "The Airbus A340 makes its first flight." },
         { "day":"25", "month":"8", "year":"1991", "text": "Belarus gains independence from the USSR." },
         { "day":"25", "month":"8", "year":"1991", "text": "Croatian War of Independence: Battle of Vukovar begins, an 87-day siege of a Croatian city by the Yugoslav People’s Army (JNA), supported by various Serbian paramilitary forces." },
         { "day":"25", "month":"8", "year":"2012", "text": "Severe flooding in Myanmar." }
      ]
   }
]
