[
   {
      "facts":[
         { "day":"27", "month":"8", "year":"1626", "text": "The Danes are crushed by the Catholic League in Germany, marking the end of Danish intervention in European wars." },
         { "day":"27", "month":"8", "year":"1776", "text": "The Americans are defeated by the British at the Battle of Long Island, New York." },
         { "day":"27", "month":"8", "year":"1793", "text": "Maximilien Robespierre is elected to the Committee of Public Safety in Paris, France." },
         { "day":"27", "month":"8", "year":"1813", "text": "The Allies defeat Napoleon at the Battle of Dresden." },
         { "day":"27", "month":"8", "year":"1861", "text": "Union troops make an amphibious landing at Cape Hatteras, North Carolina." },
         { "day":"27", "month":"8", "year":"1862", "text": "As the Second Battle of Bull Run rages, Confederate soldiers attack Loudoun County, Virginia." },
         { "day":"27", "month":"8", "year":"1881", "text": "New York state’s Pure Food Law goes into effect to prevent \"the adulteration of food or drugs.\"" },
         { "day":"27", "month":"8", "year":"1894", "text": "The United States congress passes an income tax law as part of a general tariff act, but it is found unconstitutional." },
         { "day":"27", "month":"8", "year":"1910", "text": "Thomas Edison demonstrates the first \"talking\" pictures–using a phonograph–in his New Jersey laboratory." },
         { "day":"27", "month":"8", "year":"1912", "text": "Edgar Rice Burrough’s Tarzan of the Apes first appears in a magazine." },
         { "day":"27", "month":"8", "year":"1916", "text": "Italy declares war on Germany." },
         { "day":"27", "month":"8", "year":"1928", "text": "Fifteen nations sign the Kellogg-Briand Peace Pact, outlawing war and calling for the settlement of disputes through arbitration. Forty-seven other countries eventually sign the pact." },
         { "day":"27", "month":"8", "year":"1941", "text": "The Prime Minister of Japan, Fumimaro Konoye, issues an invitation for a meeting with President Roosevelt." },
         { "day":"27", "month":"8", "year":"1945", "text": "B-29 Superfortress bombers begin to drop supplies into Allied prisoner of war camps in China." },
         { "day":"27", "month":"8", "year":"1963", "text": "Cambodia severs ties with South Vietnam." },
         { "day":"27", "month":"8", "year":"1975", "text": "Veronica & Colin Scargill of England complete tandem bicycle ride around the world, a record 18,020 miles (29,000.4 km)." },
         { "day":"27", "month":"8", "year":"1979", "text": "Lord Mountbatten is killed by an Irish terrorist bomb in his sail boat in Sligo, Ireland." },
         { "day":"27", "month":"8", "year":"1984", "text": "President Ronald Reagan announces NASA Teacher in Space project, intended to inspire students and honor teachers and spur interest in the fields of science, mathematics and space exploration." },
         { "day":"27", "month":"8", "year":"1989", "text": "Chuck Berry performs his tune Johnny B. Goode for NASA staff in celebration of Voyager II‘s encounter with the planet Neptune." },
         { "day":"27", "month":"8", "year":"1991", "text": "Moldavia declares independence from USSR." },
         { "day":"27", "month":"8", "year":"1993", "text": "The Rainbow Bridge, a 1,870-foot suspension bridge over Tokyo Bay, completed." },
         { "day":"27", "month":"8", "year":"2003", "text": "Mars makes its closest approach to Earth in nearly 60,000 years, passing within 34,646,418 miles (55,758,005 km)." },
         { "day":"27", "month":"8", "year":"2008", "text": "Democrats nominate Barack Obama for president, first African American nominated by a major political party for the office of President of the United States." },
         { "day":"27", "month":"8", "year":"2012", "text": "First interplanetary human voice recording is broadcast from the Mars Rover Curiosity." }
      ]
   }
]
