[
   {
      "facts":[
         { "day":"28", "month":"8", "year":"1676", "text": "Indian chief King Philip, also known as Metacom, is killed by English soldiers, ending the war between Indians and colonists." },
         { "day":"28", "month":"8", "year":"1862", "text": "Mistakenly believing the Confederate Army to be in retreat, Union General John Pope attacks, beginning the Battle of Groveten. Both sides sustain heavy casualties." },
         { "day":"28", "month":"8", "year":"1914", "text": "Three German cruisers are sunk by ships of the Royal Navy in the Battle of Heligoland Bight, the first major naval battle of World War I." },
         { "day":"28", "month":"8", "year":"1938", "text": "The first degree given to a ventriloquist’s dummy is awarded to Charlie McCarthy–Edgar Bergen’s wooden partner. The honorary degree, \"Master of Innuendo and Snappy Comeback,\" is presented on radio by Ralph Dennis, the dean of the School of Speech at Northwestern University." },
         { "day":"28", "month":"8", "year":"1941", "text": "The German U-boat U-570 is captured by the British and renamed Graph" },
         { "day":"28", "month":"8", "year":"1944", "text": "German forces in Toulon and Marseilles, France, surrender to the Allies." },
         { "day":"28", "month":"8", "year":"1945", "text": "Chinese communist leader Mao Tse-Tung arrives in Chunking to confer with Nationalist leader Chiang Kai-Shek in a futile effort to avert civil war." },
         { "day":"28", "month":"8", "year":"1963", "text": "One of the largest demonstrations in the history of the United States, the March on Washington for Jobs and Freedom, takes place and reaches its climax at the base of the Lincoln Memorial when Dr. Martin Luther King delivers his \"I have a dream\" speech." },
         { "day":"28", "month":"8", "year":"1965", "text": "The Viet Cong are routed in the Mekong Delta by U.S. forces, with more than 50 killed." },
         { "day":"28", "month":"8", "year":"1968", "text": "Clash between police and anti-war demonstrators during Democratic Party’s National Convention in Chicago." },
         { "day":"28", "month":"8", "year":"1979", "text": "Irish Republican Army (IRA) bomb explodes under bandstand in Brussels’ Great Market as British Army musicians prepare for a performance; four British soldiers wounded." },
         { "day":"28", "month":"8", "year":"1981", "text": "John Hinckley Jr. pleads innocent to attempting to assassinate Pres. Ronald Reagan." },
         { "day":"28", "month":"8", "year":"1982", "text": "First Gay Games held, in San Francisco." },
         { "day":"28", "month":"8", "year":"1983", "text": "Israeli’s prime minister Menachem Begin announces his resignation." },
         { "day":"28", "month":"8", "year":"1986", "text": "Bolivian president Victor Paz Estenssoro declares a state of siege and uses troops and tanks to halt a march by 10,000 striking tin miners." },
         { "day":"28", "month":"8", "year":"1986", "text": "US Navy officer Jerry A. Whitworth given 365-year prison term for spying for USSR." },
         { "day":"28", "month":"8", "year":"1993", "text": "Two hundred twenty-three die when a dam breaks at Qinghai (Kokonor), in northwest China." },
         { "day":"28", "month":"8", "year":"2003", "text": "Power blackout affects half-million people in southeast England and halts 60% of London’s underground trains." },
         { "day":"28", "month":"8", "year":"2005", "text": "Hurricane Katrina reaches Category 5 strength; Louisiana Superdome opened as a \"refuge of last resort\" in New Orleans." },
         { "day":"28", "month":"8", "year":"2012", "text": "US Republican convention nominates Mitt Romney as the party’s presidential candidate." }
      ]
   }
]
