[
   {
      "facts":[
         { "day":"29", "month":"8", "year":"70", "text": "The Temple of Jerusalem burns after a nine-month Roman siege." },
         { "day":"29", "month":"8", "year":"1526", "text": "Ottoman Suleiman the Magnificent crushes a Hungarian army under Lewis II at the Battle of Mohacs." },
         { "day":"29", "month":"8", "year":"1533", "text": "In Peru, the Inca chief Atahualpa is executed by orders of Francisco Pizarro, although the chief had already paid his ransom." },
         { "day":"29", "month":"8", "year":"1776", "text": "General George Washington retreats during the night from Long Island to New York City." },
         { "day":"29", "month":"8", "year":"1793", "text": "Slavery is abolished in Santo Domingo." },
         { "day":"29", "month":"8", "year":"1862", "text": "Union General John Pope’s army is defeated by a smaller Confederate force at the Second Battle of Bull Run." },
         { "day":"29", "month":"8", "year":"1882", "text": "Australia defeats England in cricket for the first time. The following day a obituary appears in the Sporting Times addressed to the British team." },
         { "day":"29", "month":"8", "year":"1942", "text": "The American Red Cross announces that Japan has refused to allow safe conduct for the passage of ships with supplies for American prisoners of war." },
         { "day":"29", "month":"8", "year":"1945", "text": "U.S. airborne troops are landed in transport planes at Atsugi airfield, southwest of Tokyo, beginning the occupation of Japan." },
         { "day":"29", "month":"8", "year":"1949", "text": "USSR explodes its first atomic bomb, \"First Lightning.\"" },
         { "day":"29", "month":"8", "year":"1950", "text": "International Olympic Committee votes to allow West Germany and Japan to compete in 1952 games." },
         { "day":"29", "month":"8", "year":"1952", "text": "In the largest bombing raid of the Korean War, 1,403 planes of the Far East Air Force bomb Pyongyang, North Korea." },
         { "day":"29", "month":"8", "year":"1957", "text": "US Congress passes Civil Rights Act of 1957 after Strom Thurmond (Sen-D-SC) ends 24-hour filibuster, the longest in Senate history, against the bill." },
         { "day":"29", "month":"8", "year":"1960", "text": "US U-2 spy plane spots SAM (surface-to-air) missile launch pads in Cuba." },
         { "day":"29", "month":"8", "year":"1964", "text": "Mickey Mantle ties Babe Ruth’s career strikeout record (1,330)." },
         { "day":"29", "month":"8", "year":"1965", "text": "Astronauts L. Gordon Cooper Jr. and Charles \"Pete\" Conrad Jr complete 120 Earth orbits in Gemini 5, marking the first time the US set an international duration record for a manned space mission." },
         { "day":"29", "month":"8", "year":"1966", "text": "The Beatles give their last public concert (Candlestick Park, San Francisco)." },
         { "day":"29", "month":"8", "year":"1968", "text": "Democrats nominate Hubert H Humphrey for president at their Chicago convention." },
         { "day":"29", "month":"8", "year":"1977", "text": "Lou Brock (St Louis Cardinals) breaks Ty Cobb’s 49-year-old career stolen bases record at 893." },
         { "day":"29", "month":"8", "year":"1986", "text": "Morocco’s King Hassan II signs unity treaty with Libya’s Muammar Gadhafi, strengthening political and economic ties and creating a mutual defense pact." },
         { "day":"29", "month":"8", "year":"1991", "text": "USSR’s parliament suspends Communist Party activities in the wake of a failed coup." },
         { "day":"29", "month":"8", "year":"1992", "text": "Thousands of Germans demonstrate against a wave of racist attacks aimed at immigrants." },
         { "day":"29", "month":"8", "year":"1995", "text": "NATO launches Operation Deliberate Force against Bosnian Serb forces." },
         { "day":"29", "month":"8", "year":"2003", "text": "A terrorist bomb kills Ayatollah Sayed Mohammed Baqir al-Hakim, the Shia Muslim leader in Iraq, and nearly 100 worshippers as they leave a mosque in Najaf where the ayatollah had called for Iraqi unity." },
         { "day":"29", "month":"8", "year":"2005", "text": "Rains from Hurricane Katrina cause a levee breech at the Industrial Canal in New Orleans, causing severe flooding." },
         { "day":"29", "month":"8", "year":"2012", "text": "The Egyptian Army’s Operation Eagle results in the deaths of 11 suspected terrorists and the arrest of another 23." }
      ]
   }
]
