[
   {
      "facts":[
         { "day":"3", "month":"8", "year":"1347", "text": "Six burghers of the surrounded French city of Calais surrender to Edward III of England in hopes of relieving the siege." },
         { "day":"3", "month":"8", "year":"1492", "text": "Christopher Columbus leaves Spain on his voyage to the new world." },
         { "day":"3", "month":"8", "year":"1546", "text": "French printer Etienne Dolet, accused of heresy, blasphemy and sedition, is hanged and burned at the stake for printing reformist literature." },
         { "day":"3", "month":"8", "year":"1553", "text": "Mary Tudor, the new Queen of England, enters London." },
         { "day":"3", "month":"8", "year":"1610", "text": "Henry Hudson of England discovers a great bay on the east coast of Canada and names it for himself." },
         { "day":"3", "month":"8", "year":"1692", "text": "French forces under Marshal Luxembourg defeat the English at the Battle of Steenkerke in the Netherlands." },
         { "day":"3", "month":"8", "year":"1805", "text": "Mohammed Ali becomes the new ruler of Egypt." },
         { "day":"3", "month":"8", "year":"1807", "text": "The trial of Aaron Burr begins. He is accused of plotting the secession of New England." },
         { "day":"3", "month":"8", "year":"1864", "text": "Federal gunboats attack but do not capture Fort Gains, at the mouth of Mobile Bay, Alabama." },
         { "day":"3", "month":"8", "year":"1882", "text": "Congress passes the Immigration Act, banning Chinese immigration for ten years." },
         { "day":"3", "month":"8", "year":"1908", "text": "Allan Allensworth files the site plan for the first African-American town, Allensworth, California." },
         { "day":"3", "month":"8", "year":"1911", "text": "Airplanes are used for the first time in a military capacity when Italian planes reconnoiter Turkish lines near Tripoli." },
         { "day":"3", "month":"8", "year":"1914", "text": "Germany declares war on France." },
         { "day":"3", "month":"8", "year":"1916", "text": "Sir Roger Casement is hanged for treason in England." },
         { "day":"3", "month":"8", "year":"1945", "text": "Chinese troops under American General Joseph Stilwell take the town of Myitkyina from the Japanese." },
         { "day":"3", "month":"8", "year":"1958", "text": "The first nuclear submarine USS Nautilus passes under the North Pole." },
         { "day":"3", "month":"8", "year":"1967", "text": "President Lyndon B. Johnson announces plans to send 45,000 more troops to Vietnam." },
         { "day":"3", "month":"8", "year":"1972", "text": "Former Beatle Paul McCartney announces formation of his new group, Wings." },
         { "day":"3", "month":"8", "year":"1975", "text": "Louisiana Superdome dedicated." },
         { "day":"3", "month":"8", "year":"1977", "text": "Radio Shack unveils TRS-80 personal computer, which with Apple and Commodore would form the \"1977 Trinity.\" Its price and Radio Shack’s established retail outlets made it a bestseller for several years." },
         { "day":"3", "month":"8", "year":"1990", "text": "US commits naval forces to Persian Gulf region in wake of Iraq’s invasion of Kuwait." },
         { "day":"3", "month":"8", "year":"2004", "text": "Statue of Liberty’s pedestal reopens to visitors after being closed following the 9/11 terrorist attacks." }
      ]
   }
]
