[
   {
      "facts":[
         { "day":"5", "month":"8", "year":"1391", "text": "Castilian sailors in Barcelona, Spain set fire to a Jewish ghetto, killing 100 people and setting off four days of violence against Jews." },
         { "day":"5", "month":"8", "year":"1763", "text": "Colonel Henry Bouquet decisively defeats the Indians at the Battle of Bushy Run in Pennsylvania during Pontiac’s rebellion." },
         { "day":"5", "month":"8", "year":"1762", "text": "Russia, Prussia and Austria sign a treaty agreeing on the partition of Poland." },
         { "day":"5", "month":"8", "year":"1815", "text": "A peace treaty with Tripoli–which follows treaties with Algeria and Tunis–brings an end to the Barbary Wars." },
         { "day":"5", "month":"8", "year":"1858", "text": "The first transatlantic cable is completed." },
         { "day":"5", "month":"8", "year":"1861", "text": "Congress adopts the nation’s first income tax to finance the Civil War." },
         { "day":"5", "month":"8", "year":"1864", "text": "The Union Navy captures Mobile Bay in Alabama." },
         { "day":"5", "month":"8", "year":"1892", "text": "Harriet Tubman receives a pension from Congress for her work as a nurse, spy and scout during the Civil War." },
         { "day":"5", "month":"8", "year":"1914", "text": "The British Expeditionary Force mobilizes for World War I." },
         { "day":"5", "month":"8", "year":"1914", "text": "The first electric traffic signal lights are installed in Cleveland, Ohio." },
         { "day":"5", "month":"8", "year":"1915", "text": "The Austro-German Army takes Warsaw, in present-day Poland, on the Eastern Front." },
         { "day":"5", "month":"8", "year":"1916", "text": "The British navy defeats the Ottomans at the naval battle off Port Said, Egypt." },
         { "day":"5", "month":"8", "year":"1921", "text": "Mustapha Kemal is appointed virtual ruler of the Ottoman Empire." },
         { "day":"5", "month":"8", "year":"1941", "text": "The German army completes taking 410,000 Russian prisoners in Uman and Smolensk pockets in the Soviet Union." },
         { "day":"5", "month":"8", "year":"1951", "text": "The United Nations Command suspends armistice talks with the North Koreans when armed troops are spotted in neutral areas." },
         { "day":"5", "month":"8", "year":"1962", "text": "Actress Marilyn Monroe dies under mysterious circumstances." },
         { "day":"5", "month":"8", "year":"1964", "text": "President Lyndon Johnson begins bombing North Vietnam in retaliation for Gulf of Tonkin incident and asks Congress to go to war against North Vietnam." },
         { "day":"5", "month":"8", "year":"1974", "text": "President Richard Nixon admits he ordered a cover-up for political as well as national security reasons." },
         { "day":"5", "month":"8", "year":"1981", "text": "President Ronald Reagan fires 11,500 striking air traffic controllers." },
         { "day":"5", "month":"8", "year":"1992", "text": "Four police officers indicted on civil rights charges in the beating of Rodney King." },
         { "day":"5", "month":"8", "year":"1995", "text": "Croatian forces capture the city of Knin, a Serb stronghold, during Operation Storm." },
         { "day":"5", "month":"8", "year":"1997", "text": "Mastermind of the 1993 World Trade Center bombing, Ramzi Yousef, goes on trial." },
         { "day":"5", "month":"8", "year":"2012", "text": "A gunman in Oak Creek, Wisconsin, opens fire in a Sikh temple, killing six before committing suicide." }
      ]
   }
]
