[
   {
      "facts":[
         { "day":"7", "month":"8", "year":"1782", "text": "General George Washington authorizes the award of the Purple Heart for soldiers wounded in combat." },
         { "day":"7", "month":"8", "year":"1864", "text": "Union troops capture part of Confederate General Jubal Early’s army at Moorefield, West Virginia." },
         { "day":"7", "month":"8", "year":"1888", "text": "Theophilus Van Kannel of Philadelphia receives a patent for the revolving door." },
         { "day":"7", "month":"8", "year":"1906", "text": "In North Carolina, a mob defies a court order and lynches three African Americans which becomes known as \"The Lyerly Murders.\"" },
         { "day":"7", "month":"8", "year":"1916", "text": "Persia forms an alliance with Britain and Russia." },
         { "day":"7", "month":"8", "year":"1922", "text": "The Irish Republican Army cuts the cable link between the United States and Europe at Waterville landing station." },
         { "day":"7", "month":"8", "year":"1934", "text": "In Washington, the U.S. Court of Appeals rules that the govenment can neither confiscate nor ban James Joyce’s novel Ulysses." },
         { "day":"7", "month":"8", "year":"1936", "text": "The United States declares non-intervention in the Spanish Civil War." },
         { "day":"7", "month":"8", "year":"1942", "text": "The U.S. 1st Marine Division under General A. A. Vandegrift lands on the islands of Guadalcanal and Tulagi in the Solomon islands. This is the first American amphibious landing of the war." },
         { "day":"7", "month":"8", "year":"1944", "text": "German forces launch a major counter attack against U.S. forces near Mortain, France." },
         { "day":"7", "month":"8", "year":"1964", "text": "Congress overwhelmingly passes the Gulf of Tonkin Resolution, allowing the president to use unlimited military force to prevent attacks on U.S. forces." },
         { "day":"7", "month":"8", "year":"1966", "text": "The United States loses seven planes over North Vietnam, the most in the war up to this point." },
         { "day":"7", "month":"8", "year":"1971", "text": "Apollo 15 returns to Earth. The mission to the moon had marked the first use of the Lunar Roving Vehicle." },
         { "day":"7", "month":"8", "year":"1973", "text": "A U.S. plane accidentally bombs a Cambodian village, killing 400 civilians." },
         { "day":"7", "month":"8", "year":"1976", "text": "US Viking 2 spacecraft goes into orbit around Mars." },
         { "day":"7", "month":"8", "year":"1981", "text": "The Washington (D.C.) Star ceases publication after 128 years." },
         { "day":"7", "month":"8", "year":"1984", "text": "Japan defeats the United States to win the Olympic Gold in baseball." },
         { "day":"7", "month":"8", "year":"1987", "text": "Presidents of five Central American nations sign a peace accord in Guatemala." },
         { "day":"7", "month":"8", "year":"1990", "text": "Operation Desert Shield begins as US troops deploy to Saudi Arabia to discourage Iraq’s Saddam Hussein from invading that country as he had Kuwait." },
         { "day":"7", "month":"8", "year":"2007", "text": "Barry Bonds of the San Francisco Giants breaks Hank Aaron’s record with his 756th home run. Bonds’ accomplishments were clouded by allegations of illegal steroid use and lying to a grand jury." }
      ]
   }
]
