[
   {
      "facts":[
         { "day":"8", "month":"8", "year":"1306", "text": "King Wenceslas of Poland is murdered." },
         { "day":"8", "month":"8", "year":"1570", "text": "Charles IX of France signs the Treaty of St. Germain, ending the third war of religion and giving religious freedom to the Huguenots." },
         { "day":"8", "month":"8", "year":"1636", "text": "The invading armies of Spain, Austria and Bavaria are stopped at the village of St.-Jean-de-Losne, only 50 miles from France." },
         { "day":"8", "month":"8", "year":"1648", "text": "Ibrahim, the sultan of Istanbul, is thrown into prison, then assassinated." },
         { "day":"8", "month":"8", "year":"1786", "text": "Jacques Balmat and Dr. Michael-Gabriel Baccard become the first men to climb Mont Blanc in France." },
         { "day":"8", "month":"8", "year":"1844", "text": "Brigham Young is chosen to head the Mormon Church, succeeding Joseph Smith." },
         { "day":"8", "month":"8", "year":"1863", "text": "Confederate President Jefferson Davis refuses General Robert E. Lee’s resignation." },
         { "day":"8", "month":"8", "year":"1876", "text": "Thomas Edison patents the mimeograph." },
         { "day":"8", "month":"8", "year":"1899", "text": "The first household refrigerating machine is patented." },
         { "day":"8", "month":"8", "year":"1925", "text": "The first national congress of the Ku Klux Klan opens." },
         { "day":"8", "month":"8", "year":"1937", "text": "The Japanese Army occupies Beijing." },
         { "day":"8", "month":"8", "year":"1940", "text": "The German Luftwaffe attacks Great Britain for the first time, begining the Battle of Britain." },
         { "day":"8", "month":"8", "year":"1942", "text": "U.S. Marines capture the Japanese airstrip on Guadalcanal." },
         { "day":"8", "month":"8", "year":"1944", "text": "U.S. forces complete the capture of the Marianas Islands." },
         { "day":"8", "month":"8", "year":"1945", "text": "The Soviet Union declares war on Japan." },
         { "day":"8", "month":"8", "year":"1950", "text": "U.S. troops repel the first North Korean attempt to overrun them at the battle of Naktong Bulge, which continued for 10 days." },
         { "day":"8", "month":"8", "year":"1963", "text": "England’s \"Great Train Robbery;\" 2.6 million pounds ($7.3 million) is stolen" },
         { "day":"8", "month":"8", "year":"1974", "text": "President Richard Nixon resigns from the presidency as a result of the Watergate scandal." },
         { "day":"8", "month":"8", "year":"1978", "text": "Pioneer-Venus 2 launched to probe the atmosphere of Venus." },
         { "day":"8", "month":"8", "year":"1979", "text": "Iraq’s president Saddam Hussein executes 22 political opponents." },
         { "day":"8", "month":"8", "year":"1983", "text": "Brigadier General Efrain Rios Montt is deposed as president of Guatemala in the country’s second military coup in 17 months." },
         { "day":"8", "month":"8", "year":"1988", "text": "Angola, Cuba and South Africa sign cease-fire treaty in the border war that began in 1966." },
         { "day":"8", "month":"8", "year":"1989", "text": "NASA Space Shuttle Columbia begins its eighth flight, NASA’s 30th shuttle mission." },
         { "day":"8", "month":"8", "year":"1990", "text": "Iraq annexes the state of Kuwait as its 19th province, six days after Iraqi troops invaded Kuwait." },
         { "day":"8", "month":"8", "year":"2000", "text": "Confederate submarine H.L. Hunley raised to surface, 136 years after it sank following its successful attack on USS Housatonic in the outer harbor of Charleston, South Carolina." },
         { "day":"8", "month":"8", "year":"2007", "text": "An EF2 tornado hits Brooklyn, New York, the first in that borough since 1889." },
         { "day":"8", "month":"8", "year":"2008", "text": "Georgia invades South Ossetia, touching off a five-day war between Georgia and Russia." }
      ]
   }
]
