[
   {
      "facts":[
         { "day":"9", "month":"8", "year":"480 BC", "text": "The Persian army defeats Leonidas and his Spartan army at the battle Thermopylae, Persia." },
         { "day":"9", "month":"8", "year":"48 BC", "text": "Julius Caesar defeats Gnaius Pompey at Pharsalus." },
         { "day":"9", "month":"8", "year":"1483", "text": "Pope Sixtus IV celebrates the first mass in the Sistine Chapel, which is named in his honor." },
         { "day":"9", "month":"8", "year":"1549", "text": "England declares war on France." },
         { "day":"9", "month":"8", "year":"1645", "text": "Settlers in New Amsterdam gain peace with the Indians after conducting talks with the Mohawks." },
         { "day":"9", "month":"8", "year":"1805", "text": "Austria joins Britain, Russia, Sweden and the Kingdom of Piedmont-Sardinia in the third coalition against France." },
         { "day":"9", "month":"8", "year":"1814", "text": "Andrew Jackson and the Creek Indians sign the Treaty of Fort Jackson, giving the whites 23 million acres of Creek territory." },
         { "day":"9", "month":"8", "year":"1842", "text": "The Webster-Ashburn treaty fixes the border between Maine and Canada’s New Brunswick." },
         { "day":"9", "month":"8", "year":"1859", "text": "The escalator is patented. However, the first working escalator appeared in 1900. Manufactured by the Otis Elevator Company for the Paris Exposition, it was installed in a Philadelphia office building the following year." },
         { "day":"9", "month":"8", "year":"1862", "text": "At Cedar Mountain, Virginia, Confederate General \"Stonewall\" Jackson repels an attack by Union forces." },
         { "day":"9", "month":"8", "year":"1910", "text": "The first complete, self-contained electric washing machine is patented." },
         { "day":"9", "month":"8", "year":"1930", "text": "First appearance of the animated character Betty Boop (\"Dizzy Dishes\")." },
         { "day":"9", "month":"8", "year":"1936", "text": "Jesse Owens wins four gold medals in track and field events at the Berlin Olympics." },
         { "day":"9", "month":"8", "year":"1941", "text": "President Franklin Roosevelt and Prime Minister Winston Churchill meet at Placentia Bay, Newfoundland. The meeting produces the Atlantic Charter, an agreement between the two countries on war aims, even though the United States is still a neutral country." },
         { "day":"9", "month":"8", "year":"1944", "text": "Fictional character Smokey Bear (\"Only you can prevent forest fires\") created by US Forest Service and the Ad Council." },
         { "day":"9", "month":"8", "year":"1945", "text": "The B-29 bomber Bock’s Car drops a second atomic bomb on Nagasaki, Japan." },
         { "day":"9", "month":"8", "year":"1965", "text": "Singapore expelled from Malaysia following economic disagreements and racial tensions; becomes independent republic." },
         { "day":"9", "month":"8", "year":"1969", "text": "Charles Manson’s followers kill actress Sharon Tate and her three guests in her Beverly Hills home." },
         { "day":"9", "month":"8", "year":"1971", "text": "Le Roy (Satchel) Paige inducted into Baseball Hall of Fame." },
         { "day":"9", "month":"8", "year":"1974", "text": "Gerald Ford is sworn in as president of the United States after the resignation of President Richard Nixon." },
         { "day":"9", "month":"8", "year":"1975", "text": "First NFL game in Louisiana Superdome; Houston Oilers defeat New Orleans Saints 13-7." },
         { "day":"9", "month":"8", "year":"1979", "text": "England’s first major nude beach established, at the seaside resort of Brighton." },
         { "day":"9", "month":"8", "year":"1992", "text": "Twenty-fifth Olympic Summer Games closes in Barcelona, Spain." },
         { "day":"9", "month":"8", "year":"1999", "text": "Russian president Boris Yeltsin fires his prime minister and, for the fourth time, fires the entire cabinet." },
         { "day":"9", "month":"8", "year":"1999", "text": "The Diet of Japan establishes the country’s official national flag, the Hinomaru, and national anthem, \"Kimi Ga Yo.\"." }
      ]
   }
]
