[
   {
      "facts":[
         { "day":"13", "month":"9", "year":"1515", "text": "King Francis of France defeats the Swiss army under Cardinal Matthias Schiner at Marignano, northern Italy." },
         { "day":"13", "month":"9", "year":"1549", "text": "Pope Paul III closes the first session of the Council of Bologna." },
         { "day":"13", "month":"9", "year":"1564", "text": "On the verge of attacking Pedro Menendez’s Spanish settlement at San Agostin, Florida, Jean Ribault’s French fleet is scattered by a devastating storm." },
         { "day":"13", "month":"9", "year":"1759", "text": "British troops defeat the French on the plains of Abraham, in Quebec." },
         { "day":"13", "month":"9", "year":"1774", "text": "Tugot, the new controller of finances, urges the king of France to restore the free circulation of grain in the kingdom." },
         { "day":"13", "month":"9", "year":"1782", "text": "The British fortress at Gibraltar comes under attack by French and Spanish forces." },
         { "day":"13", "month":"9", "year":"1788", "text": "The Constitutional Convention authorizes the first federal election resolving that electors in all the states will be appointed on January 7, 1789." },
         { "day":"13", "month":"9", "year":"1789", "text": "Guardsmen in Orleans, France, open fire on rioters trying to loot bakeries, killing 90." },
         { "day":"13", "month":"9", "year":"1846", "text": "General Winfield Scott takes Chapultepec, removing the last obstacle to U.S. troops moving on Mexico City." },
         { "day":"13", "month":"9", "year":"1862", "text": "Union troops in Frederick, Maryland, discover General Robert E. Lee’s attack plans for the invasion of Maryland wrapped around a pack of cigars. They give the plans to General George B. McClellan who sends the Army of the Potomac to confront Lee but only after a delay of more than half a day." },
         { "day":"13", "month":"9", "year":"1863", "text": "The Loudoun County Rangers route a company of Confederate cavalry at Catoctin Mountain in Virginia." },
         { "day":"13", "month":"9", "year":"1905", "text": "U.S. warships head to Nicaragua on behalf of American William Albers, who was accused of evading tobacco taxes." },
         { "day":"13", "month":"9", "year":"1918", "text": "U.S. and French forces take St. Mihiel, France in America’s first action as a standing army." },
         { "day":"13", "month":"9", "year":"1945", "text": "Iran demands the withdrawal of Allied forces." },
         { "day":"13", "month":"9", "year":"1951", "text": "In Korea, U.S. Army troops begin their assault in Heartbreak Ridge. The month-long struggle will cost 3,700 casualties." },
         { "day":"13", "month":"9", "year":"1961", "text": "An unmanned Mercury capsule is orbited and recovered by NASA in a test." },
         { "day":"13", "month":"9", "year":"1976", "text": "The United States announces it will veto Vietnam’s UN bid." },
         { "day":"13", "month":"9", "year":"1988", "text": "Hurricane Gilbert becomes the strongest hurricane ever recorded in the Western Hemisphere, based on barometric pressure. Hurricane Wilma will break that record in 2005." },
         { "day":"13", "month":"9", "year":"1993", "text": "The Oslo Accords, granting limited Palestinian autonomy, are signed by Israeli Prime Minister Yitzhak Rabin and PLO chairman Yasser Arafat at the White House." },
         { "day":"13", "month":"9", "year":"2007", "text": "UN adopts non-binding Declaration on the Rights of Indigenous Peoples." },
         { "day":"13", "month":"9", "year":"2008", "text": "Five synchronized bomb blasts occur in crowded locations of Delhi, India, killing at least 30 people and injuring more than 100; four other bombs are defused." },
         { "day":"13", "month":"9", "year":"2008", "text": "Hurricane Ike makes landfall in Texas; it had already been the most costly storm in Cuba’s history and becomes the third costliest in the US." }
      ]
   }
]
