[
   {
      "facts":[
         { "day":"14", "month":"9", "year":"1146", "text": "Zangi of the Near East is murdered. The Sultan Nur ad-Din, his son, pursues the conquest of Edessa." },
         { "day":"14", "month":"9", "year":"1321", "text": "Dante Alighieri dies of malaria just hours after finishing writing Paradiso." },
         { "day":"14", "month":"9", "year":"1544", "text": "Henry VIII’s forces take Boulogne, France." },
         { "day":"14", "month":"9", "year":"1773", "text": "Russian forces under Aleksandr Suvorov successfully storm a Turkish fort at Hirsov, Turkey." },
         { "day":"14", "month":"9", "year":"1791", "text": "Louis XVI swears his allegiance to the French constitution." },
         { "day":"14", "month":"9", "year":"1812", "text": "Napoleon Bonaparte’s invasion of Russia reaches its climax as his Grande Armee enters Moscow–only to find the enemy capital deserted and burning, set afire by the few Russians who remained." },
         { "day":"14", "month":"9", "year":"1814", "text": "Francis Scott Key writes the words to the \"Star Spangled Banner\" as he waits aboard a British launch in the Chesapeake Bay for the outcome of the British assault on Fort McHenry during the War of 1812." },
         { "day":"14", "month":"9", "year":"1847", "text": "U.S. forces under Gen. Winfield Scott capture Mexico City, virtually bringing the two-year Mexican War to a close." },
         { "day":"14", "month":"9", "year":"1853", "text": "The Allies land at Eupatoria on the west coast of Crimea." },
         { "day":"14", "month":"9", "year":"1862", "text": "At the battles of South Mountain and Crampton’s Gap, Maryland Union troops smash into the Confederates as they close in on what will become the Antietam battleground." },
         { "day":"14", "month":"9", "year":"1901", "text": "Vice President Theodore Roosevelt is sworn in as the 26th President of the United States upon the death of William McKinley, who was shot eight days earlier." },
         { "day":"14", "month":"9", "year":"1911", "text": "Russian Premier Piotr Stolypin is mortally wounded in an assassination attempt at the Kiev opera house." },
         { "day":"14", "month":"9", "year":"1943", "text": "German troops abandon the Salerno front in Italy.." },
         { "day":"14", "month":"9", "year":"1960", "text": "Iraq, Iran, Kuwait and Saudi Arabia form OPEC." },
         { "day":"14", "month":"9", "year":"1966", "text": "Operation Attleboro, designed as a training exercise for American troops, becomes a month-long struggle against the Viet Cong." },
         { "day":"14", "month":"9", "year":"1975", "text": "Mother Elizabeth Ann Seton becomes the first native-born American saint in the Roman Catholic Church." },
         { "day":"14", "month":"9", "year":"1979", "text": "Nur Muhammad Taraki, president and former prime minister of Afghanistan, is assassinated in a coup in which prime minister Hafizullah Amin seizes power." },
         { "day":"14", "month":"9", "year":"1982", "text": "Bachir Gemayel, president-elect of Lebanon, is killed along with 26 others in a bomb blast in Beirut." },
         { "day":"14", "month":"9", "year":"1984", "text": "Joe Kittinger, a former USAF fighter pilot during the Vietnam War, becomes the first person to pilot a gas balloon solo across the Atlantic Ocean." },
         { "day":"14", "month":"9", "year":"1994", "text": "Major League Baseball players strike over a salary cap and other proposed changes, forcing the cancellation of the entire postseason and the World Series." },
         { "day":"14", "month":"9", "year":"2007", "text": "Northern Rock Bank suffers the UK’s first bank run in 150 years." }
      ]
   }
]
