[
   {
      "facts":[
         { "day":"15", "month":"9", "year":"1588", "text": "The Spanish Armada, which attempted to invade England, is destroyed by a British fleet." },
         { "day":"15", "month":"9", "year":"1776", "text": "The British occupy Manhattan." },
         { "day":"15", "month":"9", "year":"1788", "text": "An alliance between Britain, Prussia and the Netherlands is ratified at the Hague." },
         { "day":"15", "month":"9", "year":"1858", "text": "The Butterfield Overland Mail Company begins delivering mail from St. Louis to San Francisco. The company’s motto is: "Remember, boys, nothing on God’s earth must stop the United States mail!"" },
         { "day":"15", "month":"9", "year":"1862", "text": "Confederates capture Harpers Ferry, securing the rear of Robert E. Lee’s forces in Maryland." },
         { "day":"15", "month":"9", "year":"1891", "text": "The Dalton gang holds up a train and takes $2,500 at Wagoner, Oklahoma." },
         { "day":"15", "month":"9", "year":"1914", "text": "President Woodrow Wilson orders the Punitive Expedition out of Mexico. The Expedition, headed by General John Pershing, had been searching for Pancho Villa, a Mexican revolutionary." },
         { "day":"15", "month":"9", "year":"1916", "text": "Armored tanks are introduced by the British during the Battle of the Somme." },
         { "day":"15", "month":"9", "year":"1928", "text": "Scottish bacteriologist Alexander Fleming discovers, by accident, that the mold penicillin has an antibiotic effect." },
         { "day":"15", "month":"9", "year":"1935", "text": "In Berlin, the Reich under Adolf Hitler adopts the swastika as the national flag." },
         { "day":"15", "month":"9", "year":"1937", "text": "Prime Minister of England Neville Chamberlain flies to Germany to discuss the future of Czechoslovakia with Adolf Hitler." },
         { "day":"15", "month":"9", "year":"1939", "text": "The Polish submarine Orzel arrives in Tallinn, Estonia, after escaping the German invasion of Poland." },
         { "day":"15", "month":"9", "year":"1950", "text": "U.N. Forces, lead by the U.S. Marine Corps, invade occupied Korea at the port of Inchon. Considered the greatest amphibious attack in history, it is the zenith of General Douglas MacArthur’s career." },
         { "day":"15", "month":"9", "year":"1959", "text": "Nikita Khrushchev becomes first Soviet leader to visit the US." },
         { "day":"15", "month":"9", "year":"1961", "text": "Hurricane Carla comes ashore in Texas, the second-most powerful ever to make landfall in that state." },
         { "day":"15", "month":"9", "year":"1963", "text": "Four young African-American girls are killed by the bombing of a church in Birmingham, Alabama." },
         { "day":"15", "month":"9", "year":"1966", "text": "US President Lyndon Johnson urges Congress to adopt gun control legislation in the wake of Charles Whitman’s sniper attack from the University of Texas’s Texas Tower; in all, Whitman shot and killed 15 people before being shot dead himself by an Austin police officer." },
         { "day":"15", "month":"9", "year":"1968", "text": "The USSR launches Zond 5, which becomes the first spaceshipt to orbit the moon and reenter Earth’s atmosphere." },
         { "day":"15", "month":"9", "year":"1971", "text": "The environmental group Greenpeace is founded." },
         { "day":"15", "month":"9", "year":"1981", "text": "Sandra Day O’Connor is unanimously approved by the Senate Judiciary Committee to become the first female justice on the US Supreme Court." },
         { "day":"15", "month":"9", "year":"1983", "text": "Menachem Begin resigns as premier of Israel." },
         { "day":"15", "month":"9", "year":"1990", "text": "France announces it will send 4,000 troops to join those of other nations assembling in the Persian Gulf to protect Saudi Arabia and force Iraq’s dictator Saddam Hussein to withdraw troops from occupied Kuwait." },
         { "day":"15", "month":"9", "year":"1998", "text": "MCI WorldCom begins operations after a landmark merger between World Com and MCI Communications." },
         { "day":"15", "month":"9", "year":"2004", "text": "National Hockey League commissioner Gary Bettman announces a lockout of the players union." },
         { "day":"15", "month":"9", "year":"2008", "text": "The largest Chapter 11 bankruptcy in US history is filed by Lehman Brothers financial services firm." }
      ]
   }
]
