[
   {
      "facts":[
         { "day":"16", "month":"9", "year":"1620", "text": "The Pilgrims sail from England on the Mayflower." },
         { "day":"16", "month":"9", "year":"1668", "text": "King John Casimer V of Poland abdicates the throne." },
         { "day":"16", "month":"9", "year":"1747", "text": "The French capture Bergen-op-Zoom, consolidating their occupation of Austrian Flanders in the Netherlands." },
         { "day":"16", "month":"9", "year":"1789", "text": "Jean-Paul Marat sets up a new newspaper in France, L’Ami du Peuple." },
         { "day":"16", "month":"9", "year":"1810", "text": "A revolution for independence breaks out in Mexico." },
         { "day":"16", "month":"9", "year":"1864", "text": "Confederate General Nathan Bedford Forrest leads 4,500 men out of Verona, Miss. to harass Union outposts in northern Alabama and Tennessee." },
         { "day":"16", "month":"9", "year":"1889", "text": "Robert Younger, in Minnesota’s Stillwater Penitentiary for life, dies of tuberculosis. Brothers Cole and Bob remain in the prison." },
         { "day":"16", "month":"9", "year":"1893", "text": "Some 50,000 \"Sooners\" claim land in the Cherokee Strip during the first day of the Oklahoma land rush." },
         { "day":"16", "month":"9", "year":"1908", "text": "General Motors files papers of incorporation." },
         { "day":"16", "month":"9", "year":"1920", "text": "Thirty people are killed in a terrorist bombing in New York’s Wall Street financial district." },
         { "day":"16", "month":"9", "year":"1934", "text": "Anti-Nazi Lutherans stage protest in Munich." },
         { "day":"16", "month":"9", "year":"1940", "text": "Congress passes the Selective Service Act, which calls for the first peacetime draft in U.S. history." },
         { "day":"16", "month":"9", "year":"1942", "text": "The Japanese base at Kiska in the Aleutian Islands is raided by American bombers." },
         { "day":"16", "month":"9", "year":"1945", "text": "Japan surrenders Hong Kong to Britain." },
         { "day":"16", "month":"9", "year":"1950", "text": "The U.S. 8th Army breaks out of the Pusan Perimeter in South Korea and begins heading north to meet MacArthur’s troops heading south from Inchon." },
         { "day":"16", "month":"9", "year":"1972", "text": "South Vietnamese troops recapture Quang Tri province in South Vietnam from the North Vietnamese Army." },
         { "day":"16", "month":"9", "year":"1974", "text": "Limited amnesty is offered to Vietnam-era draft resisters who would now swear allegiance to the United States and perform two years of public service." },
         { "day":"16", "month":"9", "year":"1975", "text": "Administrators for Rhodes Scholarships announce the decision to begin offering fellowships to women." },
         { "day":"16", "month":"9", "year":"1978", "text": "An earthquake estimated to be as strong as 7.9 on the Richter scale kills 25,000 people in Iran." },
         { "day":"16", "month":"9", "year":"1991", "text": "The trial of Manuel Noriega, deposed dictator of Panama, begins in the United States." },
         { "day":"16", "month":"9", "year":"1994", "text": "Britain’s government lifts the 1988 broadcasting ban against member of Ireland’s Sinn Fein and Irish paramilitary groups." },
         { "day":"16", "month":"9", "year":"2007", "text": "Military contractors in the employ of Blackwater Worldwide allegedly kill 17 Iraqis in Baghdad’s Nisour Square, further straining relations between the US and the people of Iraq." }
      ]
   }
]
