[
   {
      "facts":[
         { "day":"2", "month":"9", "year":"1666", "text": "The Great Fire of London, which devastates the city, begins." },
         { "day":"2", "month":"9", "year":"1789", "text": "The Treasury Department, headed by Alexander Hamilton, is created in New York City." },
         { "day":"2", "month":"9", "year":"1792", "text": "Verdun, France, surrenders to the Prussian Army." },
         { "day":"2", "month":"9", "year":"1798", "text": "The Maltese people revolt against the French occupation, forcing the French troops to take refuge in the citadel of Valetta in Malta." },
         { "day":"2", "month":"9", "year":"1870", "text": "Napoleon III capitulates to the Prussians at Sedan, France." },
         { "day":"2", "month":"9", "year":"1885", "text": "In Rock Springs, Wyoming Territory, 28 Chinese laborers are killed and hundreds more chased out of town by striking coal miners." },
         { "day":"2", "month":"9", "year":"1898", "text": "Sir Herbert Kitchner leads the British to victory over the Mahdists at Omdurman and takes Khartoum." },
         { "day":"2", "month":"9", "year":"1910", "text": "Alice Stebbins Wells is admitted to the Los Angeles Police Force as the first woman police officer to receive an appointment based on a civil service exam." },
         { "day":"2", "month":"9", "year":"1915", "text": "Austro-German armies take Grodno, Poland." },
         { "day":"2", "month":"9", "year":"1944", "text": "Troops of the U.S. First Army enter Belgium." },
         { "day":"2", "month":"9", "year":"1945", "text": "Japan signs the document of surrender aboard the USS Missouri, ending World War II" },
         { "day":"2", "month":"9", "year":"1945", "text": "Vietnam declares its independence and Nationalist leader Ho Chi Minh proclaims himself its first president." },
         { "day":"2", "month":"9", "year":"1956", "text": "Tennessee National Guardsmen halt rioters protesting the admission of 12 African-Americans to schools in Clinton." },
         { "day":"2", "month":"9", "year":"1963", "text": "Alabama Governor George Wallace calls state troopers to Tuskegee High School to prevent integration." },
         { "day":"2", "month":"9", "year":"1963", "text": "The US gets its first half-hour TV weeknight national news broadcast when CBS Evening News expands from 15 to 30 minutes." },
         { "day":"2", "month":"9", "year":"1970", "text": "NASA cancels two planned missions to the moon." },
         { "day":"2", "month":"9", "year":"1975", "text": "Joseph W. Hatcher of Tallahassee, Florida, becomes the state’s first African-American supreme court justice since Reconstruction." },
         { "day":"2", "month":"9", "year":"1992", "text": "The US and Russia agree to a joint venture to build a space station." },
         { "day":"2", "month":"9", "year":"1996", "text": "The Philippine government and Muslim rebels sign a pact, formally ending a 26-year long insurgency." },
         { "day":"2", "month":"9", "year":"1998", "text": "Jean Paul Akayesu, former mayor of a small town in Rwanda, found guilty of nine counts of genocide by the UN’s International Criminal Tribunal for Rwanda." }
      ]
   }
]
