[
   {
      "facts":[
         { "day":"20", "month":"9", "year":"480 BC", "text": "Themistocles and his Greek fleet win one of history’s first decisive naval victories over Xerxes’ Persian force off Salamis." },
         { "day":"20", "month":"9", "year":"1378", "text": "The election of Robert of Geneva as anti-pope by discontented cardinals creates a great schism in the Catholic church." },
         { "day":"20", "month":"9", "year":"1519", "text": "Ferdinand Magellan embarks from Spain on a voyage to circumnavigate the world." },
         { "day":"20", "month":"9", "year":"1561", "text": "Queen Elizabeth of England signs a treaty at Hamptan Court with French Huguenot leader Louis de Bourbon, the Prince of Conde. The English will occupy Le Harve in return for aiding Bourbon against the Catholics of France." },
         { "day":"20", "month":"9", "year":"1565", "text": "Pedro Menendez of Spain wipes out the French at Fort Caroline, in Florida." },
         { "day":"20", "month":"9", "year":"1604", "text": "After a two-year siege, the Spanish retake Ostend, the Netherlands, from the Dutch." },
         { "day":"20", "month":"9", "year":"1784", "text": "Packet and Daily, the first daily publication in America, appears on the streets." },
         { "day":"20", "month":"9", "year":"1806", "text": "Explorers Meriwether Lewis and William Clark pass the French village of La Charette, the first white settlement they have seen in more than two years." },
         { "day":"20", "month":"9", "year":"1830", "text": "The National Negro Convention convenes in Philadelphia with the purpose of abolishing slavery." },
         { "day":"20", "month":"9", "year":"1850", "text": "The slave trade is abolished in the District of Columbia." },
         { "day":"20", "month":"9", "year":"1853", "text": "The Allies defeat the Russians at the battle of Alma on the Crimean Peninsula." },
         { "day":"20", "month":"9", "year":"1863", "text": "Union troops under George Thomas prevent the Union defeat at Chickamauga from becoming a rout, earning him the nickname \"the Rock of Chickamauga.\"" },
         { "day":"20", "month":"9", "year":"1934", "text": "Bruno Hauptmann arrested for the kidnapping and murder of the Lindbergh baby." },
         { "day":"20", "month":"9", "year":"1952", "text": "Scientists confirm that DNA holds hereditary data." },
         { "day":"20", "month":"9", "year":"1971", "text": "Hurricane Irene becomes the first hurricane known to cross from the Atlantic to Pacific, where it is renamed Hurricane Olivia." },
         { "day":"20", "month":"9", "year":"1973", "text": "In a pro tennis bout dubbed \"The Battle of the Sexes,\" Billie Jean King beats Bobby Riggs at the Houston Astrodome in Texas." },
         { "day":"20", "month":"9", "year":"1977", "text": "Socialist Republic of Vietnam admitted to the United Nations." },
         { "day":"20", "month":"9", "year":"1984", "text": "Suicide car bomber attacks US embassy in Beirut, Lebanon, killing 22." },
         { "day":"20", "month":"9", "year":"1985", "text": "Australia introduces a capital gains tax." },
         { "day":"20", "month":"9", "year":"1990", "text": "South Ossetia declares its independence from George in the former Soviet Union." },
         { "day":"20", "month":"9", "year":"2000", "text": "British MI6 Secret intelligence Service building in London attacked by unidentified group using RPG-22 anti-tank missile." },
         { "day":"20", "month":"9", "year":"2001", "text": "US Pres. George W. Bush, addressing a joint session of Congress, declares a \"war on terror\"." },
         { "day":"20", "month":"9", "year":"2008", "text": "A truck loaded with explosives detonates by Marriott hotel in Islamabad, Pakistan, killing 45 and injuring 226." },
         { "day":"20", "month":"9", "year":"2011", "text": "US military ends its \"Don’t Ask, Don’t Tell\" policy and allows gay men and women to serve openly." }
      ]
   }
]
