[
   {
      "facts":[
         { "day":"22", "month":"9", "year":"1656", "text": "The General Provincial Court in session at Patuxent, Maryland, impanels the first all-woman jury in the Colonies to hear evidence against Judith Catchpole, who is accused of murdering her child. The jury acquits her after hearing her defense of never having been pregnant." },
         { "day":"22", "month":"9", "year":"1711", "text": "The Tuscarora Indian War begins with a massacre of settlers in North Carolina, following white encroachment that included the enslaving of Indian children." },
         { "day":"22", "month":"9", "year":"1776", "text": "American Captain Nathan Hale is hanged as a spy by the British in New York City; his last words are reputed to have been, \"I only regret that I have but one life to give for my country.\"" },
         { "day":"22", "month":"9", "year":"1789", "text": "Russian forces under Aleksandr Suvorov drive the Turkish army under Yusuf Pasha from the Rymnik River, upsetting the Turkish invasion of Russia." },
         { "day":"22", "month":"9", "year":"1862", "text": "President Lincoln issues a proclamation calling for all slaves within the rebel states to be freed on January 1, a political move that helps keep the British from intervening on the side of the South." },
         { "day":"22", "month":"9", "year":"1864", "text": "Union General Philip Sheridan defeats Confederate General Jubal Early’s troops at the Battle of Fisher’s Hill in Virginia." },
         { "day":"22", "month":"9", "year":"1869", "text": "The Cincinnati Red Stockings, the first professional baseball team, arrive in San Francisco after a rollicking, barnstorming tour of the West." },
         { "day":"22", "month":"9", "year":"1893", "text": "Bicycle makers Charles and Frank Duryea show off the first American automobile produced for sale to the public by taking it on a maiden run through the streets of Springfield, Massachusetts." },
         { "day":"22", "month":"9", "year":"1906", "text": "Race riots in Atlanta, Georgia leave 21 people dead." },
         { "day":"22", "month":"9", "year":"1914", "text": "The German cruiser Emden shells Madras, India, destroying 346,000 gallons of fuel and killing only five civilians." },
         { "day":"22", "month":"9", "year":"1915", "text": "Xavier University, the first African-American Catholic college, opens in New Orleans, Louisiana." },
         { "day":"22", "month":"9", "year":"1918", "text": "General Allenby leads the British army against the Turks, taking Haifa and Nazareth, Palestine." },
         { "day":"22", "month":"9", "year":"1919", "text": "President Woodrow Wilson abandons his national tour to support the League of Nations when he suffers a case of nervous exhaustion." },
         { "day":"22", "month":"9", "year":"1929", "text": "Communist and Nazi factions clash in Berlin." },
         { "day":"22", "month":"9", "year":"1945", "text": "President Truman accepts U.S. Secretary of War Stimson’s recommendation to designate the war World War II." },
         { "day":"22", "month":"9", "year":"1947", "text": "A Douglas C-54 Skymaster makes the first automatic pilot flight over the Atlantic." },
         { "day":"22", "month":"9", "year":"1961", "text": "President John Kennedy signs a congressional act establishing the Peace Corps." },
         { "day":"22", "month":"9", "year":"1969", "text": "Willie Mays of the San Francisco Giants becomes the first baseball player since Babe Ruth to hit 600 home runs." },
         { "day":"22", "month":"9", "year":"1970", "text": "President Richard M. Nixon signs a bill giving the District of Columbia representation in the U.S. Congress." },
         { "day":"22", "month":"9", "year":"1975", "text": "Sara Jane Moore attempts to assassinate US President Gerald Ford, the second attempt on his life in less than three weeks." },
         { "day":"22", "month":"9", "year":"1980", "text": "The Iran-Iraq War begins as Iraq invades Iran; lasting until August 1988, it was the longest conventional war of the 20th century." },
         { "day":"22", "month":"9", "year":"1991", "text": "Huntington Library makes the Dead Sea Scrolls available to the public for the first time." }
      ]
   }
]
