[
   {
      "facts":[
         { "day":"23", "month":"9", "year":"1553", "text": "The Sadians defeat the last of their enemies and establish themselves as rulers of Morocco." },
         { "day":"23", "month":"9", "year":"1561", "text": "Philip II of Spain gives orders to halt colonizing efforts in Florida." },
         { "day":"23", "month":"9", "year":"1577", "text": "William of Orange makes his triumphant entry into Brussels, Belgium." },
         { "day":"23", "month":"9", "year":"1667", "text": "Slaves in Virginia are banned from obtaining their freedom by converting to Christianity." },
         { "day":"23", "month":"9", "year":"1739", "text": "The Austrians sign the Treaty of Belgrade after having lost the city to the Turks." },
         { "day":"23", "month":"9", "year":"1779", "text": "The American navy under John Paul Jones, commanding from Bonhomme Richard, defeats and captures the British man-of-war Serapis." },
         { "day":"23", "month":"9", "year":"1788", "text": "Louis XVI of France declares the Parliament restored." },
         { "day":"23", "month":"9", "year":"1795", "text": "A national plebiscite approves the new French constitution, but so many voters sustain that the results are suspect." },
         { "day":"23", "month":"9", "year":"1803", "text": "British Major General Sir Arthur Wellesley defeats the Marathas at Assaye, India." },
         { "day":"23", "month":"9", "year":"1805", "text": "Lieutenant Zebulon Pike pays $2,000 to buy from the Sioux a 9-square-mile tract at the mouth of the Minnesota River that will be used to establish a military post, Fort Snelling." },
         { "day":"23", "month":"9", "year":"1806", "text": "The Lewis and Clark Expedition arrives back in St. Louis just over three years after its departure." },
         { "day":"23", "month":"9", "year":"1864", "text": "Confederate and Union forces clash at Mount Jackson, Front Royal and Woodstock in Virginia during the Valley campaign." },
         { "day":"23", "month":"9", "year":"1911", "text": "The Second International Aviation Meet opens in New York." },
         { "day":"23", "month":"9", "year":"1912", "text": "Mack Sennet’s first \"Keystone Cop\" film debuts, Cohen Collects a Debt." },
         { "day":"23", "month":"9", "year":"1945", "text": "The first American dies in Vietnam during the fall of Saigon to French forces." },
         { "day":"23", "month":"9", "year":"1952", "text": "Richard Nixon responds to charges of a secret slush fund during his ‘Checkers Speech.’" },
         { "day":"23", "month":"9", "year":"1954", "text": "East German police arrest 400 citizens as U.S. spies." },
         { "day":"23", "month":"9", "year":"1967", "text": "Soviets sign a pact to send more aid to Hanoi." },
         { "day":"23", "month":"9", "year":"1973", "text": "Juan Peron is re-elected president of Argentina after being overthrown in 1955." },
         { "day":"23", "month":"9", "year":"1983", "text": "Gerrie Coetzee (Gerhardus Coetzee), boxer from South Africa; first boxer from the African continent to win a world heavyweight tittle (World Boxing Association)." },
         { "day":"23", "month":"9", "year":"1983", "text": "Gulf Air Flight 771 from Karachi, Pakistan, to Abu Dhabi, UAE, bombed; all 117 aboard die." },
         { "day":"23", "month":"9", "year":"1992", "text": "Provisional Irish Republican Army (IRA) detonates 3,700-lb. bomb in Belfast, completely destroying the Northern Ireland forensic laboratory, injuring 20 people and damaging 700 houses." },
         { "day":"23", "month":"9", "year":"2002", "text": "The first public version of Mozilla Firefox browser released; originally called Phoenix 0.1 its name was changed due to trademark issues with Phoenix Technologies." },
         { "day":"23", "month":"9", "year":"2004", "text": "Hurricane Jeanne causes severe flooding in Haiti; over 1,000 reported dead." }
      ]
   }
]
