[
   {
      "facts":[
         { "day":"25", "month":"9", "year":"1396", "text": "The last great Christian crusade, led jointly by John the Fearless of Nevers and King Sigismund of Hungary, ends in disaster at the hands of Sultan Bajazet I’s Ottoman army at Nicopolis." },
         { "day":"25", "month":"9", "year":"1598", "text": "In Sweden, King Sigismund is defeated at Stangebro by his Uncle Charles." },
         { "day":"25", "month":"9", "year":"1775", "text": "British troops capture Ethan Allen, the hero of Ticonderoga, when he and a handful of Americans try to invade Canada." },
         { "day":"25", "month":"9", "year":"1789", "text": "Congress proposes 12 new amendments to the Constitution." },
         { "day":"25", "month":"9", "year":"1804", "text": "The 12th Amendment is ratified, changing the procedure of choosing the president and vice-president." },
         { "day":"25", "month":"9", "year":"1846", "text": "American General Zachary Taylor’s forces capture Monterey, Mexico." },
         { "day":"25", "month":"9", "year":"1909", "text": "The first National Aeronautic Show opens at Madison Square Garden." },
         { "day":"25", "month":"9", "year":"1915", "text": "An allied offensive is launched in France against the German Army." },
         { "day":"25", "month":"9", "year":"1918", "text": "Brazil declares war on Austria." },
         { "day":"25", "month":"9", "year":"1937", "text": "German Chancellor Adolf Hitler meets with Italian Premier Benito Mussolini in Munich." },
         { "day":"25", "month":"9", "year":"1938", "text": "President Franklin Roosevelt urges negotiations between Hitler and Czech President Benes over the Sudetenland." },
         { "day":"25", "month":"9", "year":"1942", "text": "The War Labor Board orders equal pay for women in the United States." },
         { "day":"25", "month":"9", "year":"1943", "text": "The Red Army retakes Smolensk from the Germans who are retreating to the Dnieper River in the Soviet Union." },
         { "day":"25", "month":"9", "year":"1959", "text": "President Eisenhower and Soviet Premier Khrushchev begin Camp David talks." },
         { "day":"25", "month":"9", "year":"1974", "text": "Scientists warn that continued use of aerosol sprays will cause ozone depletion, which will lead to an increased risk of skin cancer and global weather changes." },
         { "day":"25", "month":"9", "year":"1981", "text": "Sandra Day O’Connor, the first female Supreme Court Justice, is sworn in." },
         { "day":"25", "month":"9", "year":"1983", "text": "Maze Prison escape, County Antrim, Northern Ireland; 38 IRA prisoners escape in the largest prison breakout in British history; known among Irish republicans as the Great Escape." },
         { "day":"25", "month":"9", "year":"1992", "text": "NASA launches Mars Observer probe; it failed 11 months later." },
         { "day":"25", "month":"9", "year":"1996", "text": "Ireland’s last Magdalene laundry closes; begun as asylums to rehabilitate \"fallen women,\" they increasingly took on prison-like qualities." },
         { "day":"25", "month":"9", "year":"2008", "text": "China launches Shenzhou 7 spacecraft; crew performs China’s first extra-vehicular activity (EVA)." },
         { "day":"25", "month":"9", "year":"2009", "text": "US President Barack Obama, British Prime Minister Gordon Brown, and French President Nicolas Sarkozy jointly accuse Iran of building a secrecy nuclear enrichment facility." }
      ]
   }
]
