[
   {
      "facts":[
         { "day":"26", "month":"9", "year":"1580", "text": "Sir Francis Drake returns to Plymouth, England, aboard the Golden Hind, after a 33-month voyage to circumnavigate the globe." },
         { "day":"26", "month":"9", "year":"1777", "text": "The British army launches a major offensive, capturing Philadelphia." },
         { "day":"26", "month":"9", "year":"1786", "text": "France and Britain sign a trade agreement in London." },
         { "day":"26", "month":"9", "year":"1820", "text": "The legendary frontiersman Daniel Boone dies quietly at the Defiance, Mo., home of his son Nathan, at age 85." },
         { "day":"26", "month":"9", "year":"1826", "text": "The Persian cavalry is routed by the Russians at the Battle of Ganja in the Russian Caucasus." },
         { "day":"26", "month":"9", "year":"1829", "text": "Scotland Yard, the official British criminal investigation organization, is formed." },
         { "day":"26", "month":"9", "year":"1864", "text": "General Nathan Bedford Forrest and his men assault a Federal garrison near Pulaski, Tennessee." },
         { "day":"26", "month":"9", "year":"1901", "text": "Leon Czolgosz, who murdered President William McKinley, is sentenced to death.." },
         { "day":"26", "month":"9", "year":"1913", "text": "The first boat is raised in the locks of the Panama Canal." },
         { "day":"26", "month":"9", "year":"1914", "text": "The Federal Trade Commission is established to foster competition by preventing monopolies in business." },
         { "day":"26", "month":"9", "year":"1918", "text": "German Ace Ernst Udet shoots down two Allied planes, bringing his total for the war up to 62." },
         { "day":"26", "month":"9", "year":"1937", "text": "Bessie Smith, known as the ‘Empress of the Blues,’ dies in a car crash in Mississippi." },
         { "day":"26", "month":"9", "year":"1940", "text": "During the London Blitz, the underground Cabinet War Room suffers a hit when a bomb explodes on the Clive Steps." },
         { "day":"26", "month":"9", "year":"1941", "text": "The U.S. Army establishes the Military Police Corps." },
         { "day":"26", "month":"9", "year":"1950", "text": "General Douglas MacArthur’s American X Corps, fresh from the Inchon landing, links up with the U.S. Eighth Army after its breakout from the Pusan Perimeter." },
         { "day":"26", "month":"9", "year":"1955", "text": "The New York Stock Exchange suffers a $44 million loss." },
         { "day":"26", "month":"9", "year":"1960", "text": "Vice President Nixon and Senator John F. Kennedy participate in the first nationally televised debate between presidential candidates." },
         { "day":"26", "month":"9", "year":"1961", "text": "Nineteen-year-old Bob Dylan makes his New York singing debut at Gerde’s Folk City." },
         { "day":"26", "month":"9", "year":"1967", "text": "Hanoi rejects a U.S. peace proposal." },
         { "day":"26", "month":"9", "year":"1969", "text": "The Beatles last album, Abbey Road, is released." },
         { "day":"26", "month":"9", "year":"1972", "text": "Richard M. Nixon meets with Emperor Hirohito in Anchorage, Alaska, the first-ever meeting of a U.S. President and a Japanese Monarch." },
         { "day":"26", "month":"9", "year":"1977", "text": "Israel announces a cease-fire on Lebanese border." },
         { "day":"26", "month":"9", "year":"1983", "text": "In the USSR Stanislav Petrov disobeys procedures and ignores electronic alarms indicating five incoming nuclear missiles, believing the US would launch more than five if it wanted to start a war. His decision prevented a retaliatory attack that would have begun a nuclear war between the superpowers.." },
         { "day":"26", "month":"9", "year":"1984", "text": "The UK agrees to transfer sovereignty of Hong Kong to the People’s Republic of China." },
         { "day":"26", "month":"9", "year":"1997", "text": "Two earthquakes strike Italy, causing part of the Basilica of St. Francis to collapse, killing four people and destroying much of the cycle of frescoes depicting the saint’s life." },
         { "day":"26", "month":"9", "year":"2008", "text": "Yves Rossy, a Swiss pilot and inventor, is the first person to fly a jet-powered wing across the English Channel." }
      ]
   }
]
