[
   {
      "facts":[
         { "day":"28", "month":"9", "year":"48 BC", "text": "On landing in Egypt, Pompey is murdered on the orders of Ptolemy." },
         { "day":"28", "month":"9", "year":"855", "text": "The Emperor Lothar dies in Gaul, and his kingdom is divided between his three sons." },
         { "day":"28", "month":"9", "year":"1066", "text": "William, Duke of Normandy, soon to be known as William the Conqueror invades England." },
         { "day":"28", "month":"9", "year":"1106", "text": "King Henry of England defeats his brother Robert at the Battle of Tinchebrai and reunites England and Normandy." },
         { "day":"28", "month":"9", "year":"1238", "text": "James of Aragon retakes Valencia, Spain, from the Arabs." },
         { "day":"28", "month":"9", "year":"1607", "text": "Samuel de Champlain and his colonists return to France from Port Royal Nova Scotia." },
         { "day":"28", "month":"9", "year":"1794", "text": "The Anglo-Russian-Austrian Alliance of St. Petersburg, which is directed against France, is signed." },
         { "day":"28", "month":"9", "year":"1864", "text": "Union General William Rosecrans blames his defeat at Chickamauga on two of his subordinate generals. They are later exonerated by a court of inquiry." },
         { "day":"28", "month":"9", "year":"1874", "text": "Colonel Ronald Mackenzie raids a war camp of Comanche and Kiowa at the Battle of Palo Duro Canyon, Texas, slaughtering 2,000 of their horses." },
         { "day":"28", "month":"9", "year":"1904", "text": "A woman is placed under arrest for smoking a cigarette on New York’s Fifth Avenue." },
         { "day":"28", "month":"9", "year":"1912", "text": "W.C. Handy’s \"Memphis Blues\" is published." },
         { "day":"28", "month":"9", "year":"1913", "text": "Race riots in Harriston, Mississippi, kill 10 people." },
         { "day":"28", "month":"9", "year":"1924", "text": "Three U.S. Army aircraft arrive in Seattle, Washington after completing a 22-day round-the-world flight." },
         { "day":"28", "month":"9", "year":"1928", "text": "Sir Alexander Fleming discovers penicillin when he notices a bacteria-killing mold growing in his laboratory; it remained for Howard Florey and Ernst Chain to isolate the active ingredient, allowing the \"miracle drug\" to be developed in the 1940s." },
         { "day":"28", "month":"9", "year":"1939", "text": "Nazi Germany and the Soviet Union agree on a division of Poland; Warsaw surrenders to German troops." },
         { "day":"28", "month":"9", "year":"1958", "text": "France ratifies a new constitution." },
         { "day":"28", "month":"9", "year":"1959", "text": "Explorer VI, the U.S. satellite, takes the first video pictures of earth." },
         { "day":"28", "month":"9", "year":"1961", "text": "Military coup in Damacus ends the Egypt-Syria union known as the United Arab Republic that was formed Feb. 1, 1958." },
         { "day":"28", "month":"9", "year":"1963", "text": "Roy Lichtenstein’s pop art work Whaam!, depicting in comic-book style a US jet shooting down an enemy fighter, is exhibited for the first time; it will become one of the best known examples of pop art." },
         { "day":"28", "month":"9", "year":"1995", "text": "Israel’s Prime Minister Yitzhak Rabin and Palestinian Liberation Organization (PLO) leader Yasser Arafat sign an interim agreement concerning settlement on the Gaza Strip." },
         { "day":"28", "month":"9", "year":"1996", "text": "Afghanistan’s former president (1986-92) Mohammad Najibullah tortured and murdered by the Taliban." },
         { "day":"28", "month":"9", "year":"2008", "text": "SpaceX launches the first private spacecraft, Falcon 1." }
      ]
   }
]
