[
   {
      "facts":[
         { "day":"29", "month":"9", "year":"1197", "text": "Emperor Henry VI dies in Messina, Sicily." },
         { "day":"29", "month":"9", "year":"1399", "text": "Richard II of England is deposed. His cousin, Henry of Lancaster, declares himself king under the name Henry IV." },
         { "day":"29", "month":"9", "year":"1493", "text": "Christopher Columbus leaves Cadiz, Spain, on his second voyage to the new world." },
         { "day":"29", "month":"9", "year":"1513", "text": "Spanish explorer Vasco Nunez de Balboa discovers the Pacific Ocean." },
         { "day":"29", "month":"9", "year":"1789", "text": "Congress votes to create a U.S. army." },
         { "day":"29", "month":"9", "year":"1833", "text": "A civil war breaks out in Spain between Carlisists, who believe Don Carlos deserves the throne, and supporters of Queen Isabella." },
         { "day":"29", "month":"9", "year":"1850", "text": "Mormon leader Brigham Young is named the first governor of the Utah Territory." },
         { "day":"29", "month":"9", "year":"1864", "text": "Union troops capture the Confederate Fort Harrison, outside Petersburg, Virginia." },
         { "day":"29", "month":"9", "year":"1879", "text": "Dissatisfied Ute Indians kill Agent Nathan Meeker and nine others in the \"Meeker Massacre.\"" },
         { "day":"29", "month":"9", "year":"1932", "text": "A five-day work week is established for General Motors workers." },
         { "day":"29", "month":"9", "year":"1939", "text": "Germany and the Soviet Union reach an agreement on the division of Poland." },
         { "day":"29", "month":"9", "year":"1941", "text": "30,000 Jews are gunned down in Kiev when Henrich Himmler sends four strike squads to exterminate Soviet Jewish civilians and other \"undesirables.\"" },
         { "day":"29", "month":"9", "year":"1943", "text": "Adolf Hitler’s book Mein Kampf is published in the United States." },
         { "day":"29", "month":"9", "year":"1950", "text": "Soviet Premier Nikita Krushchev repeatedly disrupts a UN General Assembly meeting with his violent outbursts over intervention in the Belgian Congo, US U2 spy planes, and arms control." },
         { "day":"29", "month":"9", "year":"1960", "text": "General Douglas MacArthur officially returns Seoul, South Korea, to President Syngman Rhee." },
         { "day":"29", "month":"9", "year":"1962", "text": "Canada launches its first satellite, Alouette 1." },
         { "day":"29", "month":"9", "year":"1962", "text": "The popular Argentinian comic strip Mafalda beings publication, in the weekly Primera Plana; focusing on a six-year-old girl (Mafalda) and her friends, it has been called the Argentinian Peanuts." },
         { "day":"29", "month":"9", "year":"1966", "text": "Chevrolet introduces the Camaro, which will become an iconic car." },
         { "day":"29", "month":"9", "year":"1971", "text": "Oman joins the Arab League." },
         { "day":"29", "month":"9", "year":"1979", "text": "John Paul II becomes the first pope ever to visit Ireland." },
         { "day":"29", "month":"9", "year":"1990", "text": "The YF-22, later named F-22 Raptor, flies for the first time." },
         { "day":"29", "month":"9", "year":"1992", "text": "Brazilian President Fernando Collor de Mello impeached for corruptions; he was the youngest president in the nation’s history, taking office at age 40 in 1990." },
         { "day":"29", "month":"9", "year":"2008", "text": "Dow Jones Industrial Average plummets 777.68 points in the wake of Lehman Brothers and Washington Mutual bankruptcies, the largest single-day point loss in Wall Street history." },
         { "day":"29", "month":"9", "year":"2009", "text": "An 8.1 earthquake causes a tidal wave that claims 189 lives in Samoa, American Samoa, and Tonga." }
      ]
   }
]
