[
   {
      "facts":[
         { "day":"30", "month":"9", "year":"1399", "text": "Richard II is deposed." },
         { "day":"30", "month":"9", "year":"1568", "text": "Eric XIV, king of Sweden, is deposed after showing signs of madness." },
         { "day":"30", "month":"9", "year":"1630", "text": "John Billington, one of the original pilgrims who sailed to the New World on the Mayflower, becomes the first man executed in the English colonies. He is hanged for having shot another man during a quarrel" },
         { "day":"30", "month":"9", "year":"1703", "text": "The French, at Hochstadt in the War of the Spanish Succession, suffer only 1,000 casualties to the 11,000 of their opponents, the Austrians of Holy Roman Emperor Leopold I." },
         { "day":"30", "month":"9", "year":"1791", "text": "Mozart’s opera The Magic Flute is performed for the first time in Vienna" },
         { "day":"30", "month":"9", "year":"1846", "text": "The first anesthetized tooth extraction is performed by Dr. William Morton in Charleston, Massachusetts." },
         { "day":"30", "month":"9", "year":"1864", "text": "Confederate troops fail to retake Fort Harrison from the Union forces during the siege of Petersburg." },
         { "day":"30", "month":"9", "year":"1911", "text": "Italy declares war on Turkey over control of Tripoli." },
         { "day":"30", "month":"9", "year":"1918", "text": "Bulgaria pulls out of World War I." },
         { "day":"30", "month":"9", "year":"1927", "text": "Babe Ruth hits his 60th homerun of the season off Tom Zachary in Yankee Stadium, New York City." },
         { "day":"30", "month":"9", "year":"1935", "text": "George Gershwin’s opera Porgy and Bess opens at the Colonial Theatre in Boston." },
         { "day":"30", "month":"9", "year":"1938", "text": "Under German threats of war, Britain, France, Germany and Italy sign an accord permitting Germany to take control of Sudetenland–a region of Czechoslovakia inhabited by a German-speaking minority." },
         { "day":"30", "month":"9", "year":"1939", "text": "The French Army is called back into France from its invasion of Germany. The attack, code named Operation Saar, only penetrated five miles." },
         { "day":"30", "month":"9", "year":"1943", "text": "The Women’s Army Auxiliary Corps becomes the Women’s Army Corps, a regular contingent of the U.S. Army with the same status as other army service corps." },
         { "day":"30", "month":"9", "year":"1949", "text": "The Berlin Airlift is officially halted after 277,264 flights." },
         { "day":"30", "month":"9", "year":"1950", "text": "U.N. forces cross the 38th parallel separating North and South Korea as they pursue the retreating North Korean Army." },
         { "day":"30", "month":"9", "year":"1954", "text": "The first atomic-powered submarine, the Nautilus, is commissioned in Groton, Connecticut." },
         { "day":"30", "month":"9", "year":"1954", "text": "NATO nations agree to arm and admit West Germany." },
         { "day":"30", "month":"9", "year":"1955", "text": "Actor and teen idol James Dean is killed in a car crash while driving his Porsche on his way to enter it into a race in Salinas, California." },
         { "day":"30", "month":"9", "year":"1960", "text": "Fifteen African nations are admitted to the United Nations." },
         { "day":"30", "month":"9", "year":"1962", "text": "U.S. Marshals escort James H. Meredith into the University of Mississippi; two die in the mob violence that follows." },
         { "day":"30", "month":"9", "year":"1965", "text": "President Lyndon Johnson signs legislation that establishes the National Foundation for the Arts and the Humanities." },
         { "day":"30", "month":"9", "year":"1965", "text": "The 30 September Movement unsuccessfully attempts coup against Indonesian government; an anti-communist purge in the aftermath results in over 500,000 deaths." },
         { "day":"30", "month":"9", "year":"1966", "text": "Bechuanaland ceases to be a British protectorate and becomes the independent Republic of Botswana." },
         { "day":"30", "month":"9", "year":"1972", "text": "Pro baseball great Roberto Clemente hits his 3,000th—and final—hit of his career." },
         { "day":"30", "month":"9", "year":"1975", "text": "The AH-64 Apache attack helicopter makes its first flight." },
         { "day":"30", "month":"9", "year":"1994", "text": "Aldwych tube station (originally Strand Station) of the London Underground transit system closes after 88 years." },
         { "day":"30", "month":"9", "year":"1999", "text": "Japan’s second-worst nuclear accident occurs at a uranium processing facility in Tokai-mura, killing two technicians." },
         { "day":"30", "month":"9", "year":"2009", "text": "Earthquakes in Sumatra kill more than 1,115 people." }
      ]
   }
]
