[
   {
      "facts":[
         { "day":"4", "month":"9", "year":"1260", "text": "At the Battle of Montaperto in Italy, the Tuscan Ghibellines, who support the emperor, defeat the Florentine Guelfs, who support papal power." },
         { "day":"4", "month":"9", "year":"1479", "text": "After four years of war, Spain agrees to allow a Portuguese monopoly of trade along Africa’s west coast and Portugal acknowledges Spain’s rights in the Canary Islands." },
         { "day":"4", "month":"9", "year":"1781", "text": "Los Angeles, first an Indian village Yangma, is founded by Spanish decree." },
         { "day":"4", "month":"9", "year":"1787", "text": "Louis XVI of France recalls parliament." },
         { "day":"4", "month":"9", "year":"1790", "text": "Jacques Necker is forced to resign as finance minister in France." },
         { "day":"4", "month":"9", "year":"1804", "text": "USS Intrepid explodes while entering Tripoli harbor on a mission to destroy the enemy fleet there during the First Barbary War." },
         { "day":"4", "month":"9", "year":"1820", "text": "Czar Alexander declares that Russian influence in North America extends as far south as Oregon and closes Alaskan waters to foreigners." },
         { "day":"4", "month":"9", "year":"1862", "text": "Robert E. Lee’s Confederate army invades Maryland, starting the Antietam Campaign." },
         { "day":"4", "month":"9", "year":"1870", "text": "A republic is proclaimed in Paris and a government of national defense is formed." },
         { "day":"4", "month":"9", "year":"1881", "text": "The Edison electric lighting system goes into operation as a generator serving 85 paying customers is switched on." },
         { "day":"4", "month":"9", "year":"1886", "text": "Elusive Apache leader Geronimo surrenders to General Nelson A. Miles at Skeleton Canyon, Ariz." },
         { "day":"4", "month":"9", "year":"1893", "text": "Beatrix Potter sends a note to her governess’ son with the first drawing of Peter Rabbit, Cottontail and others. The Tale of Petter Rabbit is published eight years later." },
         { "day":"4", "month":"9", "year":"1915", "text": "The U.S. military places Haiti under martial law to quell a rebellion in its capital Port-au-Prince." },
         { "day":"4", "month":"9", "year":"1941", "text": "German submarine U-652 fires at the U.S. destroyer Greer off Iceland, beginning an undeclared shooting war." },
         { "day":"4", "month":"9", "year":"1942", "text": "Soviet planes bomb Budapest in the war’s first air raid on the Hungarian capital." },
         { "day":"4", "month":"9", "year":"1943", "text": "Allied troops capture Lae-Salamaua, in New Guinea." },
         { "day":"4", "month":"9", "year":"1944", "text": "British troops liberate Antwerp, Belgium." },
         { "day":"4", "month":"9", "year":"1945", "text": "The American flag is raised on Wake Island after surrender ceremonies there." },
         { "day":"4", "month":"9", "year":"1951", "text": "The first transcontinental television broadcast in America is carried by 94 stations." },
         { "day":"4", "month":"9", "year":"1957", "text": "Arkansas governor Orval Faubus calls out the National Guard to bar African-American students from entering a Little Rock high school." },
         { "day":"4", "month":"9", "year":"1967", "text": "Operation Swift begins as US Marines engage North Vietnamese Army troops in Que Son Valley." },
         { "day":"4", "month":"9", "year":"1972", "text": "Mark Spitz becomes first Olympic competitor to win 7 medals during a single Olympics Games." },
         { "day":"4", "month":"9", "year":"1975", "text": "Sinai II Agreement between Egypt and Israel pledges that conflicts between the two countries \"shall not be resolved by military force but by peaceful means.\"" },
         { "day":"4", "month":"9", "year":"1998", "text": "Google founded by Stanford University students Larry Page and Sergey Brin." }
      ]
   }
]
