[
   {
      "facts":[
         { "day":"6", "month":"9", "year":"394", "text": "Theodosius becomes sole ruler of Italy after defeating Eugenius at the Battle of the River Frigidus." },
         { "day":"6", "month":"9", "year":"1422", "text": "Sultan Murat II ends a vain siege of Constantinople." },
         { "day":"6", "month":"9", "year":"1522", "text": "One of the five ships that set out in Ferdinand Magellan’s trip around the world makes it back to Spain. Only 15 of the original 265 men that set out survived. Magellan was killed by natives in the Philippines." },
         { "day":"6", "month":"9", "year":"1688", "text": "Imperial troops defeat the Turks and take Belgrade, Serbia." },
         { "day":"6", "month":"9", "year":"1793", "text": "French General Jean Houchard and his 40,000 men begin a three-day battle against an Anglo-Hanoveraian army at Hondschoote, southwest Belgium, in the wars of the French Revolution." },
         { "day":"6", "month":"9", "year":"1847", "text": "Henry David Thoreau leaves Walden Pond and moves back into town, to Concord, Massachusetts." },
         { "day":"6", "month":"9", "year":"1861", "text": "Union General Ulysses S. Grant’s forces capture Paducah, Kentucky from Confederate forces." },
         { "day":"6", "month":"9", "year":"1870", "text": "The last British troops to serve in Austria are withdrawn." },
         { "day":"6", "month":"9", "year":"1901", "text": "President William McKinley is shot while attending a reception at the Pan-American Exposition in Buffalo, New York, by 28-year-old anarchist Leon Czolgosz. McKinley dies eight days later, the third American president assassinated." },
         { "day":"6", "month":"9", "year":"1907", "text": "The luxury liner Lusitania leaves London for New York on her maiden voyage." },
         { "day":"6", "month":"9", "year":"1918", "text": "The German Army begins a general retreat across the Aisne, with British troops in pursuit." },
         { "day":"6", "month":"9", "year":"1936", "text": "Aviator Beryl Markham flies the first east-to-west solo flight across the Atlantic Ocean." },
         { "day":"6", "month":"9", "year":"1937", "text": "The Soviet Union accuses Italy of torpedoing two Russian ships in the Mediterranean." },
         { "day":"6", "month":"9", "year":"1941", "text": "Germany announces that all Jews living in the country will have to begin wearing a Star of David." },
         { "day":"6", "month":"9", "year":"1943", "text": "The United States asks the Chinese Nationals to join with the Communists to present a common front to the Japanese." },
         { "day":"6", "month":"9", "year":"1953", "text": "The last American and Korean prisoners are exchanged in Operation Big Switch, the last official act of the Korean War." },
         { "day":"6", "month":"9", "year":"1965", "text": "Indian troops invade Lahore; Pakistan paratroopers raid Punjab." },
         { "day":"6", "month":"9", "year":"1972", "text": "The world learns an earlier announcement that all Israeli athletes taken hostage at the Munich Olympics had been rescued was erroneous; all had killed by their captors from the Black September terrorist group; all but 3 terrorists also died in shootout around midnight." },
         { "day":"6", "month":"9", "year":"1976", "text": "A Soviet pilot lands his MIG-25 in Tokyo and asks for political asylum in the United States." },
         { "day":"6", "month":"9", "year":"1976", "text": "Lieutenant Viktor Belenko, a Soviet air force pilot defects, flying a MiG-25 jet fighter to Japan and requesting political asylum in US." },
         { "day":"6", "month":"9", "year":"1988", "text": "Lee Roy Young becomes the first African-American Texas Ranger in the force’s 165-year history." },
         { "day":"6", "month":"9", "year":"1991", "text": "USSR officially recognizes independence for the Baltic States of Estonia, Latvia and Lithuania." },
         { "day":"6", "month":"9", "year":"1991", "text": "Leningrad, second-largest city in the USSR, is changed to Saint Petersburg, which had been the city’s name prior to 1924." },
         { "day":"6", "month":"9", "year":"1995", "text": "Baltimore Orioles’ Cal Ripken Jr. plays in his 2,131st consecutive game, breaking a 56-year MLB record held by Lou Gehrig; in 2007 fans voted this achievement the most memorable moment in MLB history." },
         { "day":"6", "month":"9", "year":"1997", "text": "Funeral of Diana, Princess of Wales: over 1 million people line London’s streets to honor her and 2.5 billion watched the event on TV." }
      ]
   }
]
