[
   {
      "facts":[
         { "day":"9", "month":"9", "year":"337", "text": "Constantine’s three sons, already Caesars, each take the title of Augustus. Constantine II and Constans share the west while Constantius II takes control of the east." },
         { "day":"9", "month":"9", "year":"1087", "text": "William the Conquerer, Duke of Normandy and King of England, dies in Rouen while conducting a war which began when the French king made fun of him for being fat." },
         { "day":"9", "month":"9", "year":"1513", "text": "King James IV of Scotland is defeated and killed by English at Flodden." },
         { "day":"9", "month":"9", "year":"1585", "text": "Pope Sixtus V deprives Henry of Navarre of his rights to the French crown." },
         { "day":"9", "month":"9", "year":"1776", "text": "The term \"United States\" is adopted by the Continental Congress to be used instead of the \"United Colonies.\"" },
         { "day":"9", "month":"9", "year":"1786", "text": "George Washington calls for the abolition of slavery." },
         { "day":"9", "month":"9", "year":"1791", "text": "French Royalists take control of Arles and barricade themselves inside the town." },
         { "day":"9", "month":"9", "year":"1834", "text": "Parliament passes the Municipal Corporations Act, reforming city and town governments in England." },
         { "day":"9", "month":"9", "year":"1850", "text": "California, in the midst of a gold rush, enters the Union as the 31st state." },
         { "day":"9", "month":"9", "year":"1863", "text": "The Union Army of the Cumberland passes through Chattanooga as they chase after the retreating Confederates. The Union troops will soon be repulsed at the Battle of Chickamauga." },
         { "day":"9", "month":"9", "year":"1886", "text": "The Berne International Copyright Convention takes place." },
         { "day":"9", "month":"9", "year":"1911", "text": "An airmail route opens between London and Windsor." },
         { "day":"9", "month":"9", "year":"1915", "text": "A German zeppelin bombs London for the first time, causing little damage." },
         { "day":"9", "month":"9", "year":"1926", "text": "The Radio Corporation of America creates the National Broadcasting Co." },
         { "day":"9", "month":"9", "year":"1942", "text": "A Japanese float plane, launched from a submarine, makes its first bombing run on a U.S. forest near Brookings, Oregon." },
         { "day":"9", "month":"9", "year":"1943", "text": "Allied troops land at Salerno, Italy and encounter strong resistance from German troops." },
         { "day":"9", "month":"9", "year":"1948", "text": "Kim Il-sung declares the establishment of the Democratic People’s Republic of Korea." },
         { "day":"9", "month":"9", "year":"1956", "text": "Elvis Presley makes his first appearance on The Ed Sullivan Show; cameras focus on his upper torso and legs to avoid showing his pelvis gyrations, which many Americans—including Ed Sullivan—thought unfit for a family show." },
         { "day":"9", "month":"9", "year":"1965", "text": "US Department of Housing and Urban Development established." },
         { "day":"9", "month":"9", "year":"1965", "text": "Hurricane Betsy, the first hurricane to exceed $1 billion in damages (unadjusted), makes its second landfall, near New Orleans." },
         { "day":"9", "month":"9", "year":"1969", "text": "Canada’s Official Languages Act takes effect, making French equal to English as a language within the nation’s government." },
         { "day":"9", "month":"9", "year":"1970", "text": "U.S. Marines launch Operation Dubois Square, a 10-day search for North Vietnamese troops near DaNang." },
         { "day":"9", "month":"9", "year":"1971", "text": "Attica Prison Riot; the 4-day riot leaves 39 dead." },
         { "day":"9", "month":"9", "year":"1976", "text": "Communist Chinese leader Mao Tse-tung dies in Beijing at age 82." },
         { "day":"9", "month":"9", "year":"1990", "text": "Sri Lankan Army massacres 184 civilians of the Tamil minority in the Batticaloa District of Sri Lanka." },
         { "day":"9", "month":"9", "year":"1991", "text": "Tajikstan declares independence from USSR." },
         { "day":"9", "month":"9", "year":"1993", "text": "The Palestine Liberation Organization (PLO) officially recognizes Israel as a legitimate state." },
         { "day":"9", "month":"9", "year":"2001", "text": "Two al Qaeda assassins kill Ahmed Shah Massoud, leader of the Northern Alliance in Afghanistan." },
         { "day":"9", "month":"9", "year":"2001", "text": "A car bomb explodes outside the Australian embassy in Jakarta, killing 10 people." }
      ]
   }
]
