[
   {
      "facts":[
         { "day":"1", "month":"10", "year":"331 BC", "text": "Alexander the Great decisively shatters King Darius III’s Persian army at Gaugamela (Arbela), in a tactical masterstroke that leaves him master of the Persian Empire." },
         { "day":"1", "month":"10", "year":"1273", "text": "Rudolf of Hapsburg is elected emperor in Germany." },
         { "day":"1", "month":"10", "year":"1588", "text": "The feeble Sultan Mohammed Shah of Persia, hands over power to his 17-year old son Abbas." },
         { "day":"1", "month":"10", "year":"1791", "text": "In Paris, the National Legislative Assembly holds its first meeting." },
         { "day":"1", "month":"10", "year":"1839", "text": "The British government decides to send a punitive naval expedition to China." },
         { "day":"1", "month":"10", "year":"1847", "text": "Maria Mitchell, American astronomer, discovers a comet and is elected the same day to the American Academy of Arts—the first woman to be so honored. The King of Denmark awarded her a gold medal for her discovery." },
         { "day":"1", "month":"10", "year":"1856", "text": "The first installment of Gustav Flaubert’s novel Madame Bovary appears in the Revue de Paris after the publisher refuses to print a passage in which the character Emma has a tryst in the back seat of a carriage." },
         { "day":"1", "month":"10", "year":"1864", "text": "The Condor, a British blockade-runner, is grounded near Fort Fisher, North Carolina." },
         { "day":"1", "month":"10", "year":"1878", "text": "General Lew Wallace is sworn in as governor of New Mexico Territory. He went on to deal with the Lincoln County War, Billy the Kid and write Ben-Hur. His Civil War heroics earned him the moniker Savior of Cincinnati." },
         { "day":"1", "month":"10", "year":"1890", "text": "Yosemite National Park is dedicated in California." },
         { "day":"1", "month":"10", "year":"1908", "text": "The Ford Model T, the first car for millions of Americans, hits the market. Over 15 million Model Ts are eventually sold, all of them black." },
         { "day":"1", "month":"10", "year":"1942", "text": "The German Army grinds to a complete halt within the city of Stalingrad." },
         { "day":"1", "month":"10", "year":"1943", "text": "British troops in Italy enter Naples and occupy Foggia airfield." },
         { "day":"1", "month":"10", "year":"1944", "text": "The U.S. First Army begins the siege Aachen, Germany." },
         { "day":"1", "month":"10", "year":"1946", "text": "Eleven Nazi war criminals are sentenced to be hanged at Nuremberg trials—Hermann Goring, Alfred Jodl, Hans Frank, Wilhelm Frick, Ernst Kaltenbrunner, Wilhelm Keitel, Joachin von Ribbentrop, Fritz Saukel, Arthur Seyss-Inquart, Julius Streicher, and Alfred Rosenberg." },
         { "day":"1", "month":"10", "year":"1947", "text": "First flight of F-86 Sabre jet fighter, which would win fame in the Korean War." },
         { "day":"1", "month":"10", "year":"1949", "text": "Mao Zedong establishes the People’s Republic of China." },
         { "day":"1", "month":"10", "year":"1957", "text": "\"In God We Trust\" appears on US paper currency as an act to distinguish the US from the officially atheist USSR; the motto had appeared on coins at various times since 1864." },
         { "day":"1", "month":"10", "year":"1958", "text": "The National Aeronautics and Space Administration (NASA) replaces the 43-year-old National Advisory Committee for Aeronautics (NACA) in the US." },
         { "day":"1", "month":"10", "year":"1960", "text": "Nigeria becomes independent from the UK." },
         { "day":"1", "month":"10", "year":"1961", "text": "The Federal Republic of Cameroon is formed by the merger of East and West Cameroon." },
         { "day":"1", "month":"10", "year":"1962", "text": "The Tonight Show Starring Johnny Carson debuts; Carson will remain The Tonight Show host until 1992." },
         { "day":"1", "month":"10", "year":"1964", "text": "The first Free Speech Movement protest erupts spontaneously on the University of California, Berkeley campus; students demanded an end to the ban of on-campus political activities." },
         { "day":"1", "month":"10", "year":"1964", "text": "Japanese \"bullet trains\" (Shinkansen) begin high-speed rail transit between Tokyo and Osaka." },
         { "day":"1", "month":"10", "year":"1971", "text": "Walt Disney World opens near Orlando, Florida, the second of Disney’s \"Magic Kingdoms.\"" },
         { "day":"1", "month":"10", "year":"1971", "text": "First CT or CAT brain scan performed, at Atkinson Morley Hospital in Wimbledon, London." },
         { "day":"1", "month":"10", "year":"1974", "text": "Five Nixon aides–Kenneth Parkinson, Robert Mardian, Nixon’s Chief of Staff H.R. Haldeman, John Ehrlichman, and U.S. Attorney General John Mitchell–go on trial for conspiring to hinder the Watergate investigation." },
         { "day":"1", "month":"10", "year":"1975", "text": "Legendary boxing match: Muhammad Ali defeats Joe Frazier in the \"Thrilla in Manila.\"" },
         { "day":"1", "month":"10", "year":"1979", "text": "US returns sovereignty of the Panama Canal to Panama." },
         { "day":"1", "month":"10", "year":"1982", "text": "First compact disc player, released by Sony." },
         { "day":"1", "month":"10", "year":"1989", "text": "Denmark introduces the world’s first \"civil union\" law granting same-sex couples certain legal rights and responsibilities but stopping short of recognizing same-sex marriages." },
         { "day":"1", "month":"10", "year":"1991", "text": "Siege of Dubrovnik begins in the Croatian War of Independence." },
         { "day":"1", "month":"10", "year":"2009", "text": "The Supreme Court of the United Kingdom takes over judicial functions of the House of Lords." }
      ]
   }
]
