[
   {
      "facts":[
         { "day":"13", "month":"10", "year":"54", "text": "Nero succeeds his great uncle Claudius, who was murdered by his wife, as the new emperor of Rome." },
         { "day":"13", "month":"10", "year":"1307", "text": "Members of the Knights of Templar are arrested throughout France, imprisoned and tortured by the order of King Philip the Fair of France." },
         { "day":"13", "month":"10", "year":"1399", "text": "Henry IV of England is crowned." },
         { "day":"13", "month":"10", "year":"1670", "text": "Virginia passes a law that blacks arriving in the colonies as Christians cannot be used as slaves." },
         { "day":"13", "month":"10", "year":"1775", "text": "The Continental Congress authorizes construction of two warships, thus instituting an American naval force." },
         { "day":"13", "month":"10", "year":"1776", "text": "Benedict Arnold is defeated at Lake Champlain." },
         { "day":"13", "month":"10", "year":"1792", "text": "President George Washington lays the cornerstone for the White House." },
         { "day":"13", "month":"10", "year":"1812", "text": "At the Battle of Queenston Heights, a Canadian and British army defeats the American who have tried to invade Canada." },
         { "day":"13", "month":"10", "year":"1849", "text": "The California state constitution, which prohibits slavery, is signed in Monterey." },
         { "day":"13", "month":"10", "year":"1903", "text": "Boston defeats Pittsburgh in baseball’s first World Series." },
         { "day":"13", "month":"10", "year":"1904", "text": "Sigmund Freud’s The Interpretation of Dreams is published." },
         { "day":"13", "month":"10", "year":"1942", "text": "In the first of four attacks, two Japanese battleships sail down the slot and shell Henderson field on Guadalcanal, in an unsuccessful effort to destroy the American Cactus Air Force." },
         { "day":"13", "month":"10", "year":"1943", "text": "Italy declares war on Germany." },
         { "day":"13", "month":"10", "year":"1944", "text": "Troops of the advancing Soviet Army occupy Riga, capital of Latvia." },
         { "day":"13", "month":"10", "year":"1946", "text": "The Fourth Republic begins in France; will continue to 1958." },
         { "day":"13", "month":"10", "year":"1958", "text": "First appearance of Paddington Bear, now a beloved icon of children’s literature." },
         { "day":"13", "month":"10", "year":"1967", "text": "First game of the fledgling American Basketball Association; Oakland Oaks beat Anaheim Amigos 134-129 in Oakland, Cal." },
         { "day":"13", "month":"10", "year":"1972", "text": "Uruguayan Air Force Flight 571 crashes in the Andes Mountains, near the Argentina-Chile border; only 16 survivors (out of 45 people aboard) are rescued on Dec. 23." },
         { "day":"13", "month":"10", "year":"1976", "text": "Dr. F.A. Murphy at Center for Disease Control obtains the first electron micrograph of an Ebola viral particle." },
         { "day":"13", "month":"10", "year":"1983", "text": "The Space Shuttle Challenger, carrying seven, the largest crew to date, lands safely at Kennedy Space Center in Florida." },
         { "day":"13", "month":"10", "year":"1990", "text": "The Lebanese Civil War ends when a Syrian attack removes Gen. Michel Aoun from power." },
         { "day":"13", "month":"10", "year":"2010", "text": "After being underground for a record 69 days, all 33 miners trapped in a Copiapo, Chile, mine are rescued." }
      ]
   }
]
