[
   {
      "facts":[
         { "day":"14", "month":"10", "year":"1066", "text": "William of Normandy defeats King Harold in the Battle of Hastings." },
         { "day":"14", "month":"10", "year":"1651", "text": "Laws are passed in Massachusetts forbidding the poor to adopt excessive styles of dress." },
         { "day":"14", "month":"10", "year":"1705", "text": "The English Navy captures Barcelona in Spain." },
         { "day":"14", "month":"10", "year":"1773", "text": "Britain’s East India Company tea ships’ cargo is burned at Annapolis, Md." },
         { "day":"14", "month":"10", "year":"1806", "text": "Napoleon Bonaparte crushes the Prussian army at Jena, Germany." },
         { "day":"14", "month":"10", "year":"1832", "text": "Blackfeet Indians attack American Fur Company trappers near Montana’s Jefferson River, killing one." },
         { "day":"14", "month":"10", "year":"1884", "text": "Transparent paper-strip photographic film is patented by George Eastman." },
         { "day":"14", "month":"10", "year":"1912", "text": "Former U.S. President Theodore Roosevelt is shot and wounded in assassination attempt in Milwaukee. He was saved by the papers in his breast pocket and, though wounded, insisted on finishing his speech." },
         { "day":"14", "month":"10", "year":"1930", "text": "Singer Ethel Merman stuns the audience when she holds a high C for sixteen bars while singing \"I Got Rhythm\" during her Broadway debut in Gershwin’s Girl Crazy." },
         { "day":"14", "month":"10", "year":"1933", "text": "The Geneva disarmament conference breaks up as Germany proclaims withdrawal from the disarmament initiative, as well as from the League of Nations, effective October 23. This begins German policy of independent action in foreign affairs." },
         { "day":"14", "month":"10", "year":"1944", "text": "German Field Marshal Rommel, suspected of complicity in the July 20th plot against Hitler, is visited at home by two of Hitler’s staff and given the choice of public trial or suicide by poison. He chooses suicide and it is announced that he died of wounds." },
         { "day":"14", "month":"10", "year":"1947", "text": "Test pilot Chuck Yeager breaks the sound barrier aboard a Bell X-1 rocket plane." },
         { "day":"14", "month":"10", "year":"1950", "text": "Chinese Communist Forces begin to infiltrate the North Korean Army." },
         { "day":"14", "month":"10", "year":"1962", "text": "Cuban Missile Crisis begins; USAF U-2 reconnaissance pilot photographs Cubans installing Soviet-made missiles capable of carrying nuclear warheads." },
         { "day":"14", "month":"10", "year":"1964", "text": "Rev. Martin Luther King is awarded the Nobel Peace Prize for advocating a policy of non-violence." },
         { "day":"14", "month":"10", "year":"1966", "text": "Montreal, Quebec, Canada, opens its underground Montreal Metro rapid-transit system." },
         { "day":"14", "month":"10", "year":"1968", "text": "US Defense Department announces 24,000 soldiers and Marines will be sent back to Vietnam for involuntary second tours of duty." },
         { "day":"14", "month":"10", "year":"1968", "text": "Jim Hines, USA, breaks the \"ten-second barrier\" in the 100-meter sprint at the Olympics in Mexico City; his time was 9.95." },
         { "day":"14", "month":"10", "year":"1969", "text": "The British 50-pence coin enters the UK’s currency, the first step toward covering to a decimal system, which was planned for 1971." },
         { "day":"14", "month":"10", "year":"1983", "text": "Prime Minister of Grenada Maurice Bishop overthrown and later executed by a military coup." },
         { "day":"14", "month":"10", "year":"1994", "text": "Nobel Peace Prize awarded to Palestinian leader Yasser Arafat, Israel’s Prime Minister Yitzhak Rabin and Israeli Foreign Minister Shimon Peres for establishing the Oslo Accords and preparing for Palestinian Self Government." },
         { "day":"14", "month":"10", "year":"1998", "text": "Eric Robert Rudolph charged with the 1996 bombing during the Summer Olympics in Atlanta, Georgia; It was one of several bombing incidents Rudolph carried out to protest legalized abortion in the US." },
         { "day":"14", "month":"10", "year":"2012", "text": "Felix Baumgartner breaks the world record for highest manned balloon flight, highest parachute jump, and greatest free-fall velocity, parachuting from an altitude of approximately 24 miles (39km)." }
      ]
   }
]
