[
   {
      "facts":[
         { "day":"16", "month":"10", "year":"1555", "text": "The Protestant martyrs Bishop Hugh Latimer and Bishop Nicholas Ridley are burned at the stake for heresy in England." },
         { "day":"16", "month":"10", "year":"1701", "text": "Yale University is founded as The Collegiate School of Kilingworth, Connecticut by Congregationalists who consider Harvard too liberal." },
         { "day":"16", "month":"10", "year":"1793", "text": "Queen Marie Antoinette is beheaded by guillotine during the French Revolution." },
         { "day":"16", "month":"10", "year":"1846", "text": "Ether was first administered in public at the Massachusetts General Hospital in Boston by Dr. William Thomas Green Morton during an operation performed by Dr. John Collins Warren." },
         { "day":"16", "month":"10", "year":"1859", "text": "Abolitionist John Brown, with 21 men, seizes the U.S. Armory at Harpers Ferry, Va. U.S. Marines capture the raiders, killing several. John Brown is later hanged in Virginia for treason." },
         { "day":"16", "month":"10", "year":"1901", "text": "President Theodore Roosevelt incites controversy by inviting black leader Booker T. Washington to the White House." },
         { "day":"16", "month":"10", "year":"1908", "text": "The first airplane flight in England is made at Farnsborough, by Samuel Cody, a U.S. citizen." },
         { "day":"16", "month":"10", "year":"1934", "text": "Mao Tse-tung decides to abandon his base in Kiangsi due to attacks from Chiang Kai-shek’s Nationalists. With his pregnant wife and about 30,000 Red Army troops, he sets out on the "Long March."" },
         { "day":"16", "month":"10", "year":"1938", "text": "Billy the Kid, a ballet by Aaron Copland, opens in Chicago." },
         { "day":"16", "month":"10", "year":"1940", "text": "Benjamin O. Davis becomes the U.S. Army’s first African American Brigadier General." },
         { "day":"16", "month":"10", "year":"1946", "text": "Ten Nazi war criminals are hanged in Nuremberg, Germany." },
         { "day":"16", "month":"10", "year":"1969", "text": "The New York Mets win the World Series four games to one over the heavily-favored Baltimore Orioles." },
         { "day":"16", "month":"10", "year":"1973", "text": "Israeli General Ariel Sharon crosses the Suez Canal and begins to encircle two Egyptian armies." },
         { "day":"16", "month":"10", "year":"1978", "text": "The college of cardinals elects 58-year-old Karol Cardinal Wojtyla, a Pole, the first non-Italian Pope since 1523." },
         { "day":"16", "month":"10", "year":"1984", "text": "A baboon heart is transplanted into 15-day-old Baby Fae–the first transplant of the kind–at Loma Linda University Medical Center, California. Baby Fae lives until November 15." },
         { "day":"16", "month":"10", "year":"1995", "text": "The Million Man March for ‘A Day of Atonement’ takes place in Washington, D.C." },
         { "day":"16", "month":"10", "year":"1995", "text": "Skye Bridge opens over Loch Alsh, Scotland" },
         { "day":"16", "month":"10", "year":"1998", "text": "General Augusto Pinochet, former dictator of Chile, arrested in London for extradition on murder charges" },
         { "day":"16", "month":"10", "year":"2002", "text": "Inaugural opening of Bibliotheca Alexandria in Alexandria, Egypt., a modern library and cultural center commemorating the famed Library of Alexandria that was lost in antiquity" }
      ]
   }
]
