[
   {
      "facts":[
         { "day":"17", "month":"10", "year":"1244", "text": "The Sixth Crusade ends when an Egyptian-Khwarismian force almost annihilates the Frankish army at Gaza." },
         { "day":"17", "month":"10", "year":"1529", "text": "Henry VIII of England strips Thomas Wolsey of his office for failing to secure an annulment of his marriage." },
         { "day":"17", "month":"10", "year":"1346", "text": "English forces defeat the Scots under David II during the Battle of Neville’s Cross, Scotland." },
         { "day":"17", "month":"10", "year":"1691", "text": "Maine and Plymouth are incorporated in Massachusetts." },
         { "day":"17", "month":"10", "year":"1777", "text": "British Maj. Gen. John Burgoyne surrenders 5,000 men at Saratoga, N.Y." },
         { "day":"17", "month":"10", "year":"1815", "text": "Napoleon Bonaparte arrives at the island of St. Helena in the South Atlantic, where he has been banished by the Allies." },
         { "day":"17", "month":"10", "year":"1849", "text": "Composer and pianist Frederic Chopin dies in Paris of tuberculosis at the age of 39." },
         { "day":"17", "month":"10", "year":"1863", "text": "General Ulysses S. Grant is named overall Union Commander of the West." },
         { "day":"17", "month":"10", "year":"1877", "text": "Brigadier General Alfred Terry meets with Sitting Bull in Canada to discuss the Indians’ return to the United States." },
         { "day":"17", "month":"10", "year":"1913", "text": "Zeppelin LII explodes over London, killing 28." },
         { "day":"17", "month":"10", "year":"1933", "text": "Due to rising anti-Semitism and anti-intellectualism in Hitler’s Germany, Albert Einstein immigrates to the United States. He makes his new home in Princeton, N.J." },
         { "day":"17", "month":"10", "year":"1941", "text": "The U.S. destroyer Kearney is damaged by a German U-boat torpedo off Iceland; 11 Americans are killed." },
         { "day":"17", "month":"10", "year":"1956", "text": "The nuclear power station Calder Hall is opened in Britain. Calder Hall is the first nuclear station to feed an appreciable amount of power into a civilian network." },
         { "day":"17", "month":"10", "year":"1972", "text": "Peace talks between Pathet Lao and Royal Lao government begin in Vietnam." },
         { "day":"17", "month":"10", "year":"1989", "text": "The worst earthquake in 82 years strikes San Francisco bay area minutes before the start of a World Series game there. The earthquake registers 6.9 on the Richter scale–67 are killed and damage is estimated at $10 billion." },
         { "day":"17", "month":"10", "year":"1994", "text": "Dmitry Kholodov, a Russian journalist, assassinated while investigating corruption in the armed forces; his murkier began a series of killings of journalists in Russia." },
         { "day":"17", "month":"10", "year":"2001", "text": "Rehavam Ze’evi, Israeli tourism minister and founder of the right-wing Moledet party, assassinated by a member of the Popular Front of the Liberation of Palestine (PFLP); he was the first Israeli minister ever assassinated." },
         { "day":"17", "month":"10", "year":"2003", "text": "Taipei 101 is completed in Taipei, becoming the world’s tallest high-rise." }
      ]
   }
]
