[
   {
      "facts":[
         { "day":"18", "month":"10", "year":"1648", "text": "The \"shoemakers of Boston\"–the first labor organization in what would become the United States–was authorized by the Massachusetts Bay Colony." },
         { "day":"18", "month":"10", "year":"1685", "text": "Edict of Nantes lifted by Louis XIV. The edict, signed at Nantes, France, by King Henry IV in 1598, gave the Huguenots religious liberty, civil rights and security. By revoking the Edict of Nantes, Louis XIV abrogated their religious liberties." },
         { "day":"18", "month":"10", "year":"1813", "text": "The Allies defeat Napoleon Bonaparte at Leipzig." },
         { "day":"18", "month":"10", "year":"1867", "text": "The Alaska territory is formally transferred to the U.S. from Russian control." },
         { "day":"18", "month":"10", "year":"1867", "text": "The rules for American football are formulated at meeting in New York among delegates from Columbia, Rutgers, Princeton and Yale universities." },
         { "day":"18", "month":"10", "year":"1883", "text": "The weather station at the top of Ben Nevis, Scotland, the highest mountain in Britain, is declared open. Weather stations were set up on the tops of mountains all over Europe and the Eastern United States in order to gather information for the new weather forecasts." },
         { "day":"18", "month":"10", "year":"1910", "text": "M. Baudry is the first to fly a dirigible across the English Channel–from La Motte-Breil to Wormwood Scrubbs." },
         { "day":"18", "month":"10", "year":"1912", "text": "The First Balkan War breaks out between the members of the Balkan League–Serbia, Bulgaria, Greece and Montenegro–and the Ottoman Empire." },
         { "day":"18", "month":"10", "year":"1918", "text": "Czechs seize Prague and renounce Hapsburg’s rule." },
         { "day":"18", "month":"10", "year":"1919", "text": "Madrid opens a subway system." },
         { "day":"18", "month":"10", "year":"1921", "text": "Russian Soviets grant Crimean independence." },
         { "day":"18", "month":"10", "year":"1939", "text": "President Franklin D. Roosevelt bans war submarines from U.S. ports and waters." },
         { "day":"18", "month":"10", "year":"1944", "text": "Lt. General Joseph Stilwell is recalled from China by president Franklin Roosevelt." },
         { "day":"18", "month":"10", "year":"1950", "text": "The First Turkish Brigade arrives in Korea to assist the U.N. forces fighting there." },
         { "day":"18", "month":"10", "year":"1967", "text": "A Russian unmanned spacecraft makes the first landing on the surface of Venus." },
         { "day":"18", "month":"10", "year":"1968", "text": "US athletes Tommi Smith and John Carlos suspended by US Olympic Committee for giving “black power” salute while receiving their medals at the Olympic Games in Mexico City." },
         { "day":"18", "month":"10", "year":"2003", "text": "Bolivian president Gonzalo Sanchez de Lozada resigns in the wake of protests centered around Bolivia’s natural gas resources." },
         { "day":"18", "month":"10", "year":"2007", "text": "Suicide attack on a motorcade in Karachi, Pakistan, kills at least 139 and wounds 450; the subject of the attack, Pakistan’s former prime minister Benazir Bhutto, is not harmed." }
      ]
   }
]
