[
   {
      "facts":[
         { "day":"20", "month":"10", "year":"480 BC", "text": "Greeks defeat the Persians in a naval battle at Salamis."},
         { "day":"20", "month":"10", "year":"1587", "text": "In France, Huguenot Henri de Navarre routs Duke de Joyeuse’s larger Catholic force at Coutras."},
         { "day":"20", "month":"10", "year":"1709", "text": "Marlborough and Eugene of Savoy take Mons in the Netherlands."},
         { "day":"20", "month":"10", "year":"1714", "text": "George I of England crowned."},
         { "day":"20", "month":"10", "year":"1805", "text": "Austrian general Karl Mac surrenders to Napoleon’s army at the battle of Ulm."},
         { "day":"20", "month":"10", "year":"1818", "text": "The United States and Britain establish the 49th Parallel as the boundary between Canada and the United States."},
         { "day":"20", "month":"10", "year":"1870", "text": "The Summer Palace in Beijing, China, is burnt to the ground by a Franco-British expeditionary force."},
         { "day":"20", "month":"10", "year":"1903", "text": "The Joint Commission, set up on January 24 by Great Britain and the United States to arbitrate the disputed Alaskan boundary, rules in favor of the United States. The deciding vote is Britain’s, which embitters Canada. The United States gains ports on the panhandle coast of Alaska."},
         { "day":"20", "month":"10", "year":"1904", "text": "Bolivia and Chile sign a treaty ending the War of the Pacific. The treaty recognizes Chile’s possession of the coast, but provides for construction of a railway to link La Paz, Bolivia, to Arica, on the coast."},
         { "day":"20", "month":"10", "year":"1924", "text": "Baseball’s first ‘colored World Series’ is held in Kansas City, Mo."},
         { "day":"20", "month":"10", "year":"1938", "text": "Czechoslovakia, complying with Nazi policy, outlaws the Communist Party and begins persecuting Jews."},
         { "day":"20", "month":"10", "year":"1941", "text": "German troops reach the approaches to Moscow."},
         { "day":"20", "month":"10", "year":"1944", "text": "U.S. troops land on Leyte in the Philippines, keeping General MacArthur’s pledge \"I shall return.\""},
         { "day":"20", "month":"10", "year":"1945", "text": "Egypt, Syria, Iraq and Lebanon form the Arab League to present a unified front against the establishment of a Jewish state in Palestine."},
         { "day":"20", "month":"10", "year":"1947", "text": "The House Un-American Activities Committee opens public hearings on alleged communist infiltration in Hollywood. Among those denounced as having un-American tendencies are: Katherine Hepburn, Charles Chaplin and Edward G. Robinson. Among those called to testify is Screen Actors Guild President Ronald Reagan, who denies that leftists ever controlled the Guild and refuses to label anyone a communist."},
         { "day":"20", "month":"10", "year":"1968", "text": "Jacqueline Kennedy marries Aristotle Onassis."},
         { "day":"20", "month":"10", "year":"1973", "text": "Arab oil-producing nations ban oil exports to the United States, following the outbreak of Arab-Israeli war."},
         { "day":"20", "month":"10", "year":"1977", "text": "Charter plane crashes in Mississippi, killing three members of popular Southern rock band Lynyrd Skynyrd, along with their assistant road manager, the pilot and co-pilot."},
         { "day":"20", "month":"10", "year":"1991", "text": "Oakland Hills firestorm destroys nearly 3,500 homes and apartments and kills 25 people."},
         { "day":"20", "month":"10", "year":"2011", "text": "In the Libyan civil war, rebels capture deposed dictator Muammar Gaddafi in his hometown of Sirte, killing him soon afterward."}
      ]
   }
]
