[
   {
      "facts":[
         { "day":"21", "month":"10", "year":"1096", "text": "Seljuk Turks at Chivitot slaughter thousands of German crusaders." },
         { "day":"21", "month":"10", "year":"1529", "text": "The Pope names Henry VIII of England Defender of the Faith after defending the seven sacraments against Luther." },
         { "day":"21", "month":"10", "year":"1600", "text": "Tokugawa Ieyasu defeats his enemies in battle and affirms his position as Japan’s most powerful warlord." },
         { "day":"21", "month":"10", "year":"1790", "text": "The Tricolor is chosen as the official flag of France." },
         { "day":"21", "month":"10", "year":"1805", "text": "Vice Admiral and Viscount Horatio Nelson wins his greatest victory over a Franco-Spanish fleet in the Battle of Trafalgar, fought off Cape Trafalgar, Spain. Nelson is fatally wounded in the battle, but lives long enough to see victory." },
         { "day":"21", "month":"10", "year":"1837", "text": "Under a flag of truce during peace talks, U.S. troops siege the Indian Seminole Chief Osceola in Florida." },
         { "day":"21", "month":"10", "year":"1861", "text": "The Battle of Ball’s Bluff, Va. begins, a disastrous Union defeat which sparks Congressional investigations." },
         { "day":"21", "month":"10", "year":"1867", "text": "Many leaders of the Kiowa, Comanche and Kiowa-Apache sign a peace treaty at Medicine Lodge, Kan. Comanche Chief Quanah Parker refused to accept the treaty terms." },
         { "day":"21", "month":"10", "year":"1872", "text": "The U.S. Naval Academy admits John H. Conyers, the first African American to be accepted." },
         { "day":"21", "month":"10", "year":"1879", "text": "After 14 months of testing, Thomas Edison first demonstrates his electric lamp, hoping to one day compete with gaslight." },
         { "day":"21", "month":"10", "year":"1904", "text": "Panamanians clash with U.S. Marines in Panama in a brief uprising." },
         { "day":"21", "month":"10", "year":"1917", "text": "The first U.S. troops enter the front lines at Sommerviller under French command." },
         { "day":"21", "month":"10", "year":"1939", "text": "As war heats up with Germany, the British war cabinet holds its first meeting in the underground war room in London." },
         { "day":"21", "month":"10", "year":"1940", "text": "Ernest Hemingway’s novel For Whom the Bell Tolls is published." },
         { "day":"21", "month":"10", "year":"1942", "text": "Eight American and British officers land from a submarine on an Algerian beach to take measure of Vichy French to the Operation Torch landings." },
         { "day":"21", "month":"10", "year":"1950", "text": "North Korean Premier Kim Il-Sung establishes a new capital at Sinuiju on the Yalu River opposite the Chinese City of Antung." },
         { "day":"21", "month":"10", "year":"1959", "text": "The Guggenheim Museum, designed by Frank Lloyd Wright, opens in Manhattan." },
         { "day":"21", "month":"10", "year":"1961", "text": "Bob Dylan records his first album in a single day at a cost of $400." },
         { "day":"21", "month":"10", "year":"1967", "text": "The \"March on the Pentagon,\" protesting American involvement in Vietnam , draws 50,000 protesters." },
         { "day":"21", "month":"10", "year":"1969", "text": "Israel’s Foreign Minister Moshe Dayan resigns over disagreements with Prime Minister Menachem Begin over policies related to the Palestinians." },
         { "day":"21", "month":"10", "year":"1983", "text": "The United States sends a ten-ship task force to Grenada." },
         { "day":"21", "month":"10", "year":"1994", "text": "North Korea and the US sign an agreement requiring North Korea to halts its nuclear weapons program and agree to international inspections." }
      ]
   }
]
