[
   {
      "facts":[
         { "day":"22", "month":"10", "year":"741", "text": "Charles Martel of Gaul dies at Quiezy. His mayoral power is divided between his two sons, Pepin III and Carloman." },
         { "day":"22", "month":"10", "year":"1746", "text": "Princeton University, in New Jersey, receives its charter." },
         { "day":"22", "month":"10", "year":"1797", "text": "The first successful parachute descent is made by Andre-Jacqes Garnerin, who jumps from a balloon at some 2,200 feet over Paris." },
         { "day":"22", "month":"10", "year":"1824", "text": "The Tennessee Legislature adjourns ending David \"Davy\" Crockett’s state political career." },
         { "day":"22", "month":"10", "year":"1836", "text": "Sam Houston sworn in as the first president of the Republic of Texas." },
         { "day":"22", "month":"10", "year":"1862", "text": "Union troops push 5,000 confederates out of Maysbille, Ark., at the Second Battle of Pea Ridge." },
         { "day":"22", "month":"10", "year":"1859", "text": "Spain declares war on the Moors in Morocco." },
         { "day":"22", "month":"10", "year":"1907", "text": "Ringling Brothers buys Barnum & Bailey." },
         { "day":"22", "month":"10", "year":"1914", "text": "U.S. places economic support behind Allies." },
         { "day":"22", "month":"10", "year":"1918", "text": "The cities of Baltimore and Washington run out of coffins during the \"Spanish Inflenza\" epidemic." },
         { "day":"22", "month":"10", "year":"1938", "text": "Chester Carlson invents the photocopier. He tries to sell the machine to IBM, RCA, Kodak and others, but they see no use for a gadget that makes nothing but copies." },
         { "day":"22", "month":"10", "year":"1954", "text": "As a result of the Geneva accords granting Communist control over North Vietnam, U.S. President Dwight D. Eisenhower authorizes a crash program to train the South Vietnamese Army." },
         { "day":"22", "month":"10", "year":"1955", "text": "The prototype of the F-105 Thunder Chief makes its maiden flight." },
         { "day":"22", "month":"10", "year":"1962", "text": "U.S. reveals Soviet missile sites in Cuba. President Kennedy orders a naval and air blockade on further shipment of military equipment to Cuba. Following a confrontation that threatens nuclear war, Kennedy and Khrushchev agree on October 28 on a formula to end the crisis. On November 2 Kennedy reports that Soviet missile bases in Cuba are being dismantled." },
         { "day":"22", "month":"10", "year":"1964", "text": "Jean Paul Satre declines the Nobel Prize for Literature." },
         { "day":"22", "month":"10", "year":"1966", "text": "The Soviet Union launches Luna 12 for orbit around the moon" },
         { "day":"22", "month":"10", "year":"1972", "text": "Operation Linebacker I, the bombing of North Vietnam with B-52 bombers, ends." },
         { "day":"22", "month":"10", "year":"1978", "text": "Papal inauguration of Pope John Paul II; born Karol Jozef Wojtyla. The Polish-born Wojtyla was the first non-Italian pope since Pope Adrian VI died in 1523; he would become the second-longest serving pope in the history of the Papacy and exercise considerable influence on events of the later portion of the 20th century." },
         { "day":"22", "month":"10", "year":"1981", "text": "The US Federal Labor Relations authority decertified the Professional Air Traffic Controllers Organization (PATCO) from representing federal air traffic controllers, as a result of a PATCO strike in August that was broken by the Reagan Administration." },
         { "day":"22", "month":"10", "year":"1999", "text": "Maurice Papon, formerly an official in the Vichy France government during World War II, is jailed for crimes against humanity for his role in deporting more than 1,600 Jews to concentration camps." },
         { "day":"22", "month":"10", "year":"2005", "text": "Tropical Storm Alpha forms, making 2005 the most active Atlantic hurricane season on record with 22 named storms." }
      ]
   }
]
