[
   {
      "facts":[
         { "day":"24", "month":"10", "year":"439", "text": "Carthage, the leading Roman city in North Africa, falls to Genseric and the Vandals." },
         { "day":"24", "month":"10", "year":"1531", "text": "Bavaria, despite being a Catholic region, joins the League of Schmalkalden, a Protestant group which opposes Charles V." },
         { "day":"24", "month":"10", "year":"1648", "text": "The signing of the Treaty of Westphalia ends the German Thirty Years’ War." },
         { "day":"24", "month":"10", "year":"1755", "text": "A British expedition against the French held Fort Niagara in Canada ends in failure." },
         { "day":"24", "month":"10", "year":"1836", "text": "The match is patented." },
         { "day":"24", "month":"10", "year":"1861", "text": "Western Union completes the first transcontinental telegraph line, putting the Pony Express out of business." },
         { "day":"24", "month":"10", "year":"1863", "text": "General Ulysses S. Grant arrives in Chattanooga, Tennessee, to find the Union Army there starving." },
         { "day":"24", "month":"10", "year":"1897", "text": "The first comic strip appears in the Sunday color supplement of the New York Journal called the ‘Yellow Kid.’" },
         { "day":"24", "month":"10", "year":"1901", "text": "Anna Edson Taylor, 43, is the first woman to go safely over Niagara Falls in a barrel. She made the attempt for the cash award offered, which she put toward the loan on her Texas ranch." },
         { "day":"24", "month":"10", "year":"1916", "text": "Henry Ford awards equal pay to women." },
         { "day":"24", "month":"10", "year":"1917", "text": "The Austro-German army routs the Italian army at Caporetto, Italy." },
         { "day":"24", "month":"10", "year":"1929", "text": "Black Thursday–the first day of the stock market crash which began the Great Depression." },
         { "day":"24", "month":"10", "year":"1930", "text": "John Wayne debuts in his first starring role in The Big Trail ." },
         { "day":"24", "month":"10", "year":"1931", "text": "Al (Alphonse) Capone, the prohibition-era Chicago gangster, is sent to prison for tax evasion." },
         { "day":"24", "month":"10", "year":"1934", "text": "Mohandas Karamchand Gandhi, called Mahatma or \"Great Soul,\" resigns from Congress in India." },
         { "day":"24", "month":"10", "year":"1938", "text": "The Fair Labor Standards Act becomes law, establishing the 40-hour work week." },
         { "day":"24", "month":"10", "year":"1944", "text": "The aircraft carrier USS Princeton is sunk by a single Japanese plane during the Battle of Leyte Gulf." },
         { "day":"24", "month":"10", "year":"1945", "text": "The United Nations comes into existence with the ratification of its charter by the first 29 nations." },
         { "day":"24", "month":"10", "year":"1945", "text": "Vidkun Quisling, Norway’s wartime minister president, is executed by firing squad for collaboration with the Nazis." },
         { "day":"24", "month":"10", "year":"1952", "text": "Presidential candidate Dwight D. Eisenhower announces that if elected, he will go to Korea." },
         { "day":"24", "month":"10", "year":"1970", "text": "Leftist Salvador Allende elected president of Chile." },
         { "day":"24", "month":"10", "year":"1973", "text": "Yom Kippur War ends." },
         { "day":"24", "month":"10", "year":"1980", "text": "Poland’s government legalizes the Solidarity trade union." },
         { "day":"24", "month":"10", "year":"1992", "text": "Toronto Blue Jays win the World Series, defeating the Atlanta Braves in the 11th inning of the 6th game, to become the first Major League Baseball team from outside the US to win the series." },
         { "day":"24", "month":"10", "year":"2003", "text": "The supersonic Concorde jet made its last commercial passenger flight from New York City’s John F. Kennedy International Airport to London’s Heathrow Airport, traveling at twice the speed of sound." },
         { "day":"24", "month":"10", "year":"2008", "text": "Many stock exchanges worldwide suffer the steepest declines in their histories; the day becomes known as \"Bloody Friday.\"" }      ]
   }
]
