[
   {
      "facts":[
         { "day":"28", "month":"10", "year":"312", "text": "Constantine the Great defeats Marcus Aurelius Valerius Maxentius at the Mulvian Bridge." },
         { "day":"28", "month":"10", "year":"969", "text": "After a prolonged siege, the Byzantines end 300 years of Arab rule in Antioch." },
         { "day":"28", "month":"10", "year":"1216", "text": "Henry III of England is crowned." },
         { "day":"28", "month":"10", "year":"1628", "text": "After a fifteen-month siege, the Huguenot town of La Rochelle surrenders to royal forces." },
         { "day":"28", "month":"10", "year":"1636", "text": "Harvard College, the oldest institution of higher learning in the United States, is founded in Cambridge, Mass." },
         { "day":"28", "month":"10", "year":"1768", "text": "Germans and Acadians join French Creoles in their armed revolt against the Spanish governor of New Orleans." },
         { "day":"28", "month":"10", "year":"1793", "text": "Eli Whitney applies for a patent on the cotton gin, a machine which cleans the tight-clinging seeds from short-staple cotton easily and effectively–a job which was previously done by hand." },
         { "day":"28", "month":"10", "year":"1863", "text": "In a rare night attack, Confederates under Gen. James Longstreet attack a Federal force near Chattanooga, Tennessee, hoping to cut their supply line, the \"cracker line.\" They fail." },
         { "day":"28", "month":"10", "year":"1886", "text": "The Statue of Liberty, originally named Liberty Enlightening the World, is dedicated at Liberty Island, N. Y., formerly Bedloe’s Island, by President Grover Cleveland" },
         { "day":"28", "month":"10", "year":"1901", "text": "Race riots sparked by Booker T. Washington’s visit to the White House kill 34." },
         { "day":"28", "month":"10", "year":"1904", "text": "The St. Louis police try a new investigation method: fingerprints." },
         { "day":"28", "month":"10", "year":"1914", "text": "The German cruiser Emden, disguised as a British ship, steams into Penang Harbor near Malaya and sinks the Russian light cruiser Zhemchug." },
         { "day":"28", "month":"10", "year":"1914", "text": "George Eastman announces the invention of the color photographic process." },
         { "day":"28", "month":"10", "year":"1919", "text": "Over President Wilson’s veto, Congress passes the National Prohibition Act, or Volstead Act, named after its promoter, Congressman Andrew J. Volstead. It provides enforcement guidelines for the Prohibition Amendment." },
         { "day":"28", "month":"10", "year":"1927", "text": "Pan American Airways launches the first scheduled international flight." },
         { "day":"28", "month":"10", "year":"1940", "text": "Italy invades Greece, launching six divisions on four fronts from occupied Albania." },
         { "day":"28", "month":"10", "year":"1944", "text": "The first B-29 Superfortress bomber mission flies from the airfields in the Mariana Islands in a strike against the Japanese base at Truk." },
         { "day":"28", "month":"10", "year":"1960", "text": "In a note to the OAS (Organization of American States), the United States charges that Cuba has been receiving substantial quantities of arms and numbers of military technicians from the Soviet bloc." },
         { "day":"28", "month":"10", "year":"1962", "text": "Soviet Premier Nikita Khrushchev orders Soviet missiles removed from Cuba, ending the Cuban Missile Crisis." },
         { "day":"28", "month":"10", "year":"1965", "text": "Construction completed on St. Louis Arch; at 630 feet (192m), it is the world’s tallest arch." },
         { "day":"28", "month":"10", "year":"1971", "text": "Britain launches the satellite Prospero into orbit, using a Black Arrow carrier rocket; this is the first and so far (2013) only British satellite launched by a British rocket." },
         { "day":"28", "month":"10", "year":"1982", "text": "The Spanish Socialist Workers’ Party wins election, giving Spain its first Socialist government since the death of right-wing President Francisco Franco." },
         { "day":"28", "month":"10", "year":"2005", "text": "Libby \"Scooter\" Lewis, chief of staff to Vice President Dick Cheney, resigns after being indicted for \"outing\" CIA agent Valerie Plame." },
         { "day":"28", "month":"10", "year":"2007", "text": "Argentina elects its first woman president, Cristina Fernandez de Kirchner." }
      ]
   }
]
