[
   {
      "facts":[
         { "day":"29", "month":"10", "year":"1618", "text": "Sir Walter Raleigh is executed. After the death of Queen Elizabeth, Raleigh’s enemies spread rumors that he was opposed the accession of King James." },
         { "day":"29", "month":"10", "year":"1787", "text": "Mozart’s opera Don Giovanni opens in Prague." },
         { "day":"29", "month":"10", "year":"1814", "text": "The Demologos, the first steam-powered warship, launched in New York City." },
         { "day":"29", "month":"10", "year":"1901", "text": "Leon Czolgosz is electrocuted for the assassination of US President William McKinley. Czolgosz, an anarchist, shot McKinley on September 6 during a public reception at the Temple of Music in Buffalo, N.Y. Despite early hopes of recovery, McKinley died September 14, in Buffalo, NY." },
         { "day":"29", "month":"10", "year":"1927", "text": "Russian archaeologist Peter Kozloff apparently uncovers the tomb of Genghis Khan in the Gobi Desert, a claim still in dispute." },
         { "day":"29", "month":"10", "year":"1929", "text": "Black Tuesday–the most catastrophic day in stock market history, the herald of the Great Depression. 16 million shares were sold at declining prices. By mid-November $30 billion of the $80 billion worth of stocks listed in September will have been wiped out." },
         { "day":"29", "month":"10", "year":"1945", "text": "The first ball-point pen goes is sold by Gimbell’s department store in New York for a price of $12." },
         { "day":"29", "month":"10", "year":"1949", "text": "Alonzo G. Moron of the Virgin Islands becomes the first African-American president of Hampton Institute, Hampton, Virginia." },
         { "day":"29", "month":"10", "year":"1952", "text": "French forces launch Operation Lorraine against Viet Minh supply bases in Indochina." },
         { "day":"29", "month":"10", "year":"1964", "text": "Thieves steal a jewel collection–including the world’s largest sapphire, the 565-carat \"Star of India,\" and the 100-carat DeLong ruby–from the Museum of Natural History in New York. The thieves were caught and most of the jewels recovered." },
         { "day":"29", "month":"10", "year":"1969", "text": "The U.S. Supreme Court orders immediate desegregation, superseding the previous \"with all deliberate speed\" ruling." },
         { "day":"29", "month":"10", "year":"1969", "text": "First computer-to-computer link; the link is accomplished through ARPANET, forerunner of the Internet." },
         { "day":"29", "month":"10", "year":"1972", "text": "Palestinian guerrillas kill an airport employee and hijack a plane, carrying 27 passengers, to Cuba. They force West Germany to release 3 terrorists who were involved in the Munich Massacre." },
         { "day":"29", "month":"10", "year":"1983", "text": "More than 500,000 people protest in The Hague, The Netherlands, against cruise missiles." },
         { "day":"29", "month":"10", "year":"1986", "text": "The last stretch of Britain’s M25 motorway opens." },
         { "day":"29", "month":"10", "year":"1998", "text": "South Africa’s Truth and Reconciliation Commission reports condemns both sides on the Apartheid issue for committing atrocities." },
         { "day":"29", "month":"10", "year":"1998", "text": "John Glenn, at age 77, becomes the oldest person to go into outer space. He is part of the crew of Space Shuttle Discovery, STS-95." },
         { "day":"29", "month":"10", "year":"1998", "text": "The deadliest Atlantic hurricane on record up to that time, Hurricane Mitch, makes landfall in Honduras (in 2005 Hurricane Wilma surpassed it); nearly 11,000 people died and approximately the same number were missing." },
         { "day":"29", "month":"10", "year":"2004", "text": "For the first time, Osama bin Laden admits direct responsibility for the Sept. 11, 2001, terrorist attacks in the US; his comments are part of a video broadcast by the Al Jazeera network." },
         { "day":"29", "month":"10", "year":"2008", "text": "Delta and Northwest airlines merge, forming the world’s largest airline." },
         { "day":"29", "month":"10", "year":"2012", "text": "Hurricane Sandy devastates much of the East Coast of the US; nearly 300 die directly or indirectly from the storm." }
      ]
   }
]
