[
   {
      "facts":[
         { "day":"30", "month":"10", "year":"1270", "text": "The Seventh Crusade ends by the Treaty of Barbary." },
         { "day":"30", "month":"10", "year":"1485", "text": "Henry VII of England crowned." },
         { "day":"30", "month":"10", "year":"1697", "text": "The Treaty of Ryswick ends the war between France and the Grand Alliance." },
         { "day":"30", "month":"10", "year":"1838", "text": "Oberlin Collegiate Institute in Lorian County, Ohio becomes the first college in the U.S. to admit female students." },
         { "day":"30", "month":"10", "year":"1899", "text": "Two battalions of British troops are cut off, surrounded and forced to surrender to General Petrus Joubert’s Boers at Nicholson’s Nek." },
         { "day":"30", "month":"10", "year":"1905", "text": "The czar of Russia issues the October Manisfesto, granting civil liberties and elections in an attempt to avert the burgeonng supprot for revolution." },
         { "day":"30", "month":"10", "year":"1918", "text": "The Italians capture Vittorio Veneto and rout the Austro-Hungarian army." },
         { "day":"30", "month":"10", "year":"1918", "text": "Turkey signs an armistice with the Allies, agreeing to end hostilities at noon, October 31." },
         { "day":"30", "month":"10", "year":"1922", "text": "Mussolini sends his black shirts into Rome. The Fascist takeover is almost without bloodshed. The next day, Mussolini is made prime minister. Mussolini centralized all power in himself as leader of the Fascist party and attempted to create an Italian empire, ultimately in alliance with Hitler’s Germany." },
         { "day":"30", "month":"10", "year":"1925", "text": "Scotsman John L. Baird performs first TV broadcast of moving objects." },
         { "day":"30", "month":"10", "year":"1938", "text": "H.G. Wells’ War of the Worlds is broadcast over the radio by Orson Welles’ Mercury Theatre. Many panic believing it is an actual newscast about a Martian invasion." },
         { "day":"30", "month":"10", "year":"1941", "text": "The U.S. destroyer Reuben James, on convoy duty off Iceland, is sunk by a German U-boat with the loss of 96 Americans." },
         { "day":"30", "month":"10", "year":"1950", "text": "The First Marine Division is ordered to replace the entire South Korean I Corps at the Chosin Reservoir area." },
         { "day":"30", "month":"10", "year":"1953", "text": "US Pres. Dwight D. Eisenhower formally approves a top secret document to maintain and expand the country’s nuclear arsenal." },
         { "day":"30", "month":"10", "year":"1961", "text": "The USSR detonates \"Tsar Bomba,\" a 50-megaton hydrogen bomb; it is still (2013) the largest explosive device of any kind over detonated." },
         { "day":"30", "month":"10", "year":"1965", "text": "US Marines repeal multiple-wave attacks by Viet Cong within a few miles of Da Nang where the Marines were based; a sketch of Marine positions was found on the body of a 13-year-old boy who had been selling the Americans drinks the previous day." },
         { "day":"30", "month":"10", "year":"1973", "text": "The Bosphorus Bridge is completed at Istanbul, Turkey, connecting Europe and Asia over the Bosphorus Strait." },
         { "day":"30", "month":"10", "year":"1974", "text": "The \"Rumble in the Jungle,\" a boxing match in Zaire that many regard as the greatest sporting event of the 20th century, saw challenger Muhammad Ali knock out previously undefeated World Heavyweight Champion George Foreman." },
         { "day":"30", "month":"10", "year":"1975", "text": "Prince Juan Carlos becomes acting head of state in Spain, replacing the ailing dictator Gen. Francisco Franco." },
         { "day":"30", "month":"10", "year":"1985", "text": "Space Shuttle Challenger lifts off for its final successful mission." },
         { "day":"30", "month":"10", "year":"1991", "text": "BET Holdings Inc., becomes the first African-American company listed on the New York Stock Exchange." },
         { "day":"30", "month":"10", "year":"2005", "text": "The rebuilt Dresden Frauenkirche (Church of Our Lady) that was destroyed during the firebombing of Dresden in WWII is rededicated." }
      ]
   }
]
