[
   {
      "facts":[
         { "day":"31", "month":"10", "year":"1517", "text": "Martin Luther nails his 95 Theses to the door of the church at Wittenberg in Germany. Luther’s theories and writings inaugurate Protestantism, shattering the external structure of the medieval church and at the same time reviving the religious consciousness of Europe." },
         { "day":"31", "month":"10", "year":"1803", "text": "Congress ratifies the purchase of the entire Louisiana area in North America, adding territory to the U.S. which will eventually become 13 more states." },
         { "day":"31", "month":"10", "year":"1838", "text": "A mob of about 200 attacks a Mormon camp in Missouri, killing 20 men, women and children." },
         { "day":"31", "month":"10", "year":"1864", "text": "Nevada becomes the 36th state." },
         { "day":"31", "month":"10", "year":"1941", "text": "After 14 years of work, the Mount Rushmore National Memorial is completed." },
         { "day":"31", "month":"10", "year":"1952", "text": "The United States explodes the first hydrogen bomb at Eniwetok Atoll in the Pacific." },
         { "day":"31", "month":"10", "year":"1968", "text": "The bombing of North Vietnam is halted by the United States." },
         { "day":"31", "month":"10", "year":"1971", "text": "Saigon begins the release of 1,938 Hanoi POW’s." },
         { "day":"31", "month":"10", "year":"1984", "text": "Indian Prime Minister Indira Gandhi is assassinated in New Delhi by two Sikh members of her bodyguard." },
         { "day":"31", "month":"10", "year":"1998", "text": "Iraq announces it will no longer cooperate with United Nations weapons inspectors." },
         { "day":"31", "month":"10", "year":"1999", "text": "EgyptAir Flight 990 crashes into Atlantic Ocean killing all 217 people on board." },
         { "day":"31", "month":"10", "year":"2000", "text": "Soyuz TM-31 launches, carrying the first resident crew to the International Space Station." },
         { "day":"31", "month":"10", "year":"2002", "text": "Former Enron Corp. CEO Andrew Fastow convicted on 78 counts of conspiracy, money laundering, obstruction of justice and wire fraud; the Enron collapse cost investors millions and led to new oversight legislation." }
      ]
   }
]
