[
   {
      "facts":[
         { "day":"6", "month":"10", "year":"1014", "text": "The Byzantine Emperor Basil earns the title \"Slayer of Bulgers\" after he orders the blinding of 15,000 Bulgerian troops." },
         { "day":"6", "month":"10", "year":"1536", "text": "William Tyndale, the English translator of the New Testament, is strangled and burned at the stake for heresy at Vilvorde, France." },
         { "day":"6", "month":"10", "year":"1696", "text": "Savoy Germany withdraws from the Grand Alliance." },
         { "day":"6", "month":"10", "year":"1788", "text": "The Polish Diet decides to hold a four year session." },
         { "day":"6", "month":"10", "year":"1801", "text": "Napoleon Bonaparte imposes a new constitution on Holland." },
         { "day":"6", "month":"10", "year":"1847", "text": "Charlotte Bronte’s novel Jane Eyre is published in London." },
         { "day":"6", "month":"10", "year":"1866", "text": "The Reno brothers–Frank, John, Simeon and William–commit the country’s first train robbery near Seymore, Indiana netting $10,000." },
         { "day":"6", "month":"10", "year":"1927", "text": "The first \"talkie,\" The Jazz Singer, opens with popular entertainer Al Jolson singing and dancing in black-face. By 1930, silent movies were a thing of the past." },
         { "day":"6", "month":"10", "year":"1941", "text": "German troops renew their offensive against Moscow." },
         { "day":"6", "month":"10", "year":"1965", "text": "Patricia Harris takes post as U.S. Ambassador to Belgium, becoming the first African American U.S. ambassador." },
         { "day":"6", "month":"10", "year":"1966", "text": "Hanoi insists the United States must end its bombings before peace talks can begin." },
         { "day":"6", "month":"10", "year":"1969", "text": "Special Forces Captain John McCarthy is released from Fort Leavenworth Penitentiary, pending consideration of his appeal to murder charges." },
         { "day":"6", "month":"10", "year":"1973", "text": "Israel is taken by surprise when Egypt, Syria, Iraq and Jordan attack on the Jewish holy day of Yom Kippur, beginning the Yom Kippur War." },
         { "day":"6", "month":"10", "year":"1981", "text": "Egyptian president Anwar el-Sadat is assassinated in Cairo by Islamic fundamentalists. He is succeeded by Vice President Hosni Mubarak." },
         { "day":"6", "month":"10", "year":"1987", "text": "Fiji becomes a republic independent of the British Commonwealth." },
         { "day":"6", "month":"10", "year":"1995", "text": "Astronomers discover 51 Pegasi is the second star known to have a planet orbiting it." },
         { "day":"6", "month":"10", "year":"2000", "text": "Yugoslavia’s president Slobodan Milosevic and Argentina’s vice-president Carlos Alvarez both resign from their respective offices." },
         { "day":"6", "month":"10", "year":"2007", "text": "Explorer and author Jason Lewis becomes the first person to complete a human-powered circumnavigation of the globe." }
      ]
   }
]
