[
   {
      "facts":[
         { "day":"9", "month":"10", "year":"28 BC", "text": "The Temple of Apollo is dedicated on the Palatine Hill in Rome." },
         { "day":"9", "month":"10", "year":"1470", "text": "Henry VI of England restored to the throne." },
         { "day":"9", "month":"10", "year":"1760", "text": "Austrian and Russian troops enter Berlin and begin burning structures and looting." },
         { "day":"9", "month":"10", "year":"1779", "text": "The Luddite riots being in Manchester, England in reaction to machinery for spinning cotton." },
         { "day":"9", "month":"10", "year":"1781", "text": "Americans begin shelling the British surrounded at Yorktown." },
         { "day":"9", "month":"10", "year":"1825", "text": "The first Norwegian immigrants to America arrive on the sloop Restaurationen." },
         { "day":"9", "month":"10", "year":"1863", "text": "Confederate cavalry raiders return to Chattanooga after attacking Union General William Rosecrans’ supply and communication lines all around east Tennessee." },
         { "day":"9", "month":"10", "year":"1888", "text": "The Washington Monument, designed by Robert Mills, opens to the public." },
         { "day":"9", "month":"10", "year":"1914", "text": "Germans take Antwerp, Belgium, after 12-day siege." },
         { "day":"9", "month":"10", "year":"1934", "text": "In Marseilles, a Macedonian revolutionary associated with Croat terrorists in Hungary assassinates King Alexander of Yugoslavia and French Foreign Minister Louis Barthou. The two had been on a tour of European capitals in quest of an alliance against Nazi Germany. The assassinations bring the threat of war between Yugoslavia and Hungary, but confrontation is prevented by the League of Nations." },
         { "day":"9", "month":"10", "year":"1941", "text": "President Franklin D. Roosevelt requests congressional approval for arming U.S. merchant ships." },
         { "day":"9", "month":"10", "year":"1946", "text": "Eugene O’Neill’s play The Iceman Cometh opens at the Martin Beck Theatre in New York." },
         { "day":"9", "month":"10", "year":"1949", "text": "Harvard Law School begins admitting women." },
         { "day":"9", "month":"10", "year":"1950", "text": "U.N. forces, led by the First Cavalry Division, cross the 38th parallel in South Korea and begin attacking northward towards the North Korean capital of Pyongyang." },
         { "day":"9", "month":"10", "year":"1983", "text": "The president of South Korea, Doo Hwan Chun, with his cabinet and other top officials are scheduled to lay a wreath on a monument in Rangoon, Burma, when a bomb explodes. Hwan had not yet arrived so escaped injury, but 17 Koreans–including the deputy prime minister and two other cabinet members–and two Burmese are killed. North Korea is blamed." },
         { "day":"9", "month":"10", "year":"1999", "text": "Last flight of the Lockheed SR-71 \"Blackbird\" stealth reconnaissance aircraft." },
         { "day":"9", "month":"10", "year":"2006", "text": "North Korea reportedly tests its first nuclear device." }
      ]
   }
]
