[
   {
      "facts":[
         { "day":"1", "month":"9", "year":"1676", "text": "Nathaniel Bacon leads an uprising against English Governor William Berkeley at Jamestown, Virginia, resulting in the settlement being burned to the ground. Bacon’s Rebellion came in response to the governor’s repeated refusal to defend the colonists against the Indians." },
         { "day":"1", "month":"9", "year":"1773", "text": "Phillis Wheatley, a slave from Boston, publishes a collection of poetry, Poems on Various Subjects, Religious and Moral, in London." },
         { "day":"1", "month":"9", "year":"1807", "text": "Aaron Burr is arrested in Mississippi for complicity in a plot to establish a Southern empire in Louisiana and Mexico." },
         { "day":"1", "month":"9", "year":"1821", "text": "William Becknell leads a group of traders from Independence, Mo., toward Santa Fe on what would become the Santa Fe Trail." },
         { "day":"1", "month":"9", "year":"1836", "text": "Protestant missionary Dr. Marcus Whitman leads a party to Oregon. His wife, Narcissa, is one of the first white women to travel the Oregon Trail. The Oregon Trail emigrants who chose to follow Stephen Meek thought his shortcut would save weeks of hard travel. Instead, it brought them even greater misery." },
         { "day":"1", "month":"9", "year":"1864", "text": "Confederate forces under General John Bell Hood evacuate Atlanta in anticipation of the arrival of Union General William T. Sherman’s troops." },
         { "day":"1", "month":"9", "year":"1870", "text": "The Prussian army crushes the French at Sedan, the last battle of the Franco-Prussian War." },
         { "day":"1", "month":"9", "year":"1876", "text": "The Ottomans inflict a decisive defeat on the Serbs at Aleksinac." },
         { "day":"1", "month":"9", "year":"1882", "text": "The first Labor Day is observed in New York City by the Carpenters and Joiners Union." },
         { "day":"1", "month":"9", "year":"1894", "text": "By an act of Congress, Labor Day is declared a national holiday." },
         { "day":"1", "month":"9", "year":"1902", "text": "The Austro-Hungarian army is called into the city of Agram to restore the peace as Serbs and Croats clash." },
         { "day":"1", "month":"9", "year":"1904", "text": "Helen Keller graduates with honors from Radcliffe College." },
         { "day":"1", "month":"9", "year":"1905", "text": "Alberta and Saskatchewan become Canadian provinces." },
         { "day":"1", "month":"9", "year":"1916", "text": "Bulgaria declares war on Rumania as the First World War expands." },
         { "day":"1", "month":"9", "year":"1923", "text": "An earthquake levels the Japanese cities of Tokyo and Yokohama, killing 300,000." },
         { "day":"1", "month":"9", "year":"1939", "text": "Germany invades Poland, beginning World War II in Europe." },
         { "day":"1", "month":"9", "year":"1942", "text": "A federal judge in Sacramento, Cal., upholds the government’s detention of Japanese-Americans and Japanese nationals as a war measure." },
         { "day":"1", "month":"9", "year":"1951", "text": "Australia, New Zealand and the United States sign the ANZUS Treaty, a mutual defense pact." },
         { "day":"1", "month":"9", "year":"1969", "text": "Colonel Muammar Gadhafi seizes power in Libya following a coup." },
         { "day":"1", "month":"9", "year":"1970", "text": "Dr. Hugh Scott of Washington, D.C. becomes the first African-American superintendent of schools in a major U.S. city." },
         { "day":"1", "month":"9", "year":"1972", "text": "America’s Bobby Fischer beats Russia’s Boris Spassky in Reykjavik, Iceland, to become world chess champion." },
         { "day":"1", "month":"9", "year":"1979", "text": "US spacecraft Pioneer 11 makes the first-ever flyby of Saturn." },
         { "day":"1", "month":"9", "year":"1985", "text": "The wreck of the Titanic found by Dr. Robert Ballard and Jean Louis Michel in a joint U.S. and French expedition." },
         { "day":"1", "month":"9", "year":"1998", "text": "On National Day, Vietnam releases 5,000 prisoners, including political dissidents." },
         { "day":"1", "month":"9", "year":"2004", "text": "Armed terrorists take children and adults hostage in the Besian school hostage crisis in North Ossetia, Russia." }
      ]
   }
]
