[
   {
      "facts":[
         { "day":"10", "month":"9", "year":"1419", "text": "John the Fearless is murdered at Montereau, France, by supporters of the dauphine." },
         { "day":"10", "month":"9", "year":"1547", "text": "The Duke of Somerset leads the English to a resounding victory over the Scots at Pinkie Cleugh." },
         { "day":"10", "month":"9", "year":"1588", "text": "Thomas Cavendish returns to England, becoming the third man to circumnavigate the globe." },
         { "day":"10", "month":"9", "year":"1623", "text": "Lumber and furs are the first cargo to leave New Plymouth in North America for England." },
         { "day":"10", "month":"9", "year":"1813", "text": "The nine-ship American flotilla under Oliver Hazard Perry wrests naval supremacy from the British on Lake Erie by capturing or destroying a force of six English vessels." },
         { "day":"10", "month":"9", "year":"1846", "text": "Elias Howe patents the first practical sewing machine in the United States." },
         { "day":"10", "month":"9", "year":"1855", "text": "Sevastopol, under siege for nearly a year, capitulates to the Allies during the Crimean War." },
         { "day":"10", "month":"9", "year":"1861", "text": "Confederates at Carnifex Ferry, Virginia, fall back after being attacked by Union troops. The action is instrumental in helping preserve western Virginia for the Union." },
         { "day":"10", "month":"9", "year":"1912", "text": "J. Vedrines becomes the first pilot to break the 100 m.p.h. barrier." },
         { "day":"10", "month":"9", "year":"1914", "text": "The six-day Battle of the Marne ends, halting the German advance into France." },
         { "day":"10", "month":"9", "year":"1923", "text": "In response to a dispute with Yugoslavia, Mussolini mobilizes Italian troops on Serb front." },
         { "day":"10", "month":"9", "year":"1961", "text": "Jomo Kenyatta returns to Kenya from exile, during which he had been elected president of the Kenya National African Union." },
         { "day":"10", "month":"9", "year":"1963", "text": "President John F. Kennedy federalizes Alabama’s National Guard to prevent Governor George C. Wallace from using guardsmen to stop public-school desegregation." },
         { "day":"10", "month":"9", "year":"1967", "text": "Gibraltar votes to remain a British dependency instead of becoming part of Spain." },
         { "day":"10", "month":"9", "year":"1974", "text": "Guinea-Bissau (Portuguese Guinea) gains independence from Portugal." },
         { "day":"10", "month":"9", "year":"1981", "text": "Pablo Picasso’s painting Guernica is returned to Spain and installed in Madrid’s Prado Museum. Picasso stated in his will that the painting was not to return to Spain until the Fascists lost power and democracy was restored." },
         { "day":"10", "month":"9", "year":"2001", "text": "Contestant Charles Ingram cheats on the British version of Who Wants to Be a Millionaire, wins 1 million pounds." },
         { "day":"10", "month":"9", "year":"2003", "text": "Sweden’s foreign minister, Anna Lindh, is stabbed while shopping and dies the next day." },
         { "day":"10", "month":"9", "year":"2007", "text": "Nawaz Sharif, former prime minister of Pakistan, returns after 7 years in exile, following a military coup in October 1999." },
         { "day":"10", "month":"9", "year":"2008", "text": "The Large Hadron Collider, the world’s largest and most powerful particle accelerator—described as the biggest scientific experiment in history—is powered up in Geneva, Switzerland." }
      ]
   }
]
