[
   {
      "facts":[
         { "day":"11", "month":"9", "year":"1297", "text": "Scots under William Wallace defeat the English at Stirling Bridge." },
         { "day":"11", "month":"9", "year":"1695", "text": "Imperial troops under Eugene of Savoy defeat the Turks at the Battle of Zenta." },
         { "day":"11", "month":"9", "year":"1709", "text": "John Churchill, Duke of Marlborough, wins the bloodiest battle of the 18th century at great cost, against the French at Malplaquet." },
         { "day":"11", "month":"9", "year":"1740", "text": "The first mention of an African American doctor or dentist in the colonies is made in the Pennsylvania Gazette." },
         { "day":"11", "month":"9", "year":"1777", "text": "General George Washington and his troops are defeated by the British under General Sir William Howe at the Battle of Brandywine in Pennsylvania." },
         { "day":"11", "month":"9", "year":"1786", "text": "The Convention of Annapolis opens with the aim of revising the articles of confederation." },
         { "day":"11", "month":"9", "year":"1802", "text": "Piedmont, Italy, is annexed by France." },
         { "day":"11", "month":"9", "year":"1814", "text": "U.S. forces led by Thomas Macdonough route the British fleet on Lake Champlain." },
         { "day":"11", "month":"9", "year":"1847", "text": "Stephen Foster’s \"Oh! Susanna\" is first performed in a saloon in Pittsburgh." },
         { "day":"11", "month":"9", "year":"1850", "text": "Soprano opera singer Jenny Lind, the \"Swedish Nightingale,\" makes her American debut at New York’s Castle Garden Theater." },
         { "day":"11", "month":"9", "year":"1864", "text": "A 10-day truce is declared between generals Sherman and Hood so civilians may leave Atlanta, Georgia." },
         { "day":"11", "month":"9", "year":"1857", "text": "Indians incited by Mormon John D. Lee kill 120 California-bound settlers in the Mountain Meadows Massacre." },
         { "day":"11", "month":"9", "year":"1904", "text": "The battleship Connecticut, launched in New York, introduces a new era in naval construction." },
         { "day":"11", "month":"9", "year":"1916", "text": "The \"Star Spangled Banner\" is sung at the beginning of a baseball game for the first time in Cooperstown, New York." },
         { "day":"11", "month":"9", "year":"1944", "text": "American troops enter Luxembourg." },
         { "day":"11", "month":"9", "year":"1962", "text": "Thurgood Marshall is appointed a judge of the 2nd Circuit Court of Appeals." },
         { "day":"11", "month":"9", "year":"1965", "text": "The 1st Cavalry Division (Airmobile) arrives in South Vietnam and is stationed at An Khe." },
         { "day":"11", "month":"9", "year":"1974", "text": "Haile Selassie I is deposed from the Ethiopian throne." },
         { "day":"11", "month":"9", "year":"2001", "text": "In an unprecedented, highly coordinated attack, terrorists hijack four U.S. passenger airliners, flying two into the World Trade Center towers in New York and one into the Pentagon, killing thousands. The fourth airliner, headed toward Washington likely to strike the White House or Capitol, is crashed just over 100 miles away in Pennsylvania after passengers storm the cockpit and overtake the hijackers." },
         { "day":"11", "month":"9", "year":"2005", "text": "Israel completes its unilateral disengagement of all Israeli civilians and military from the Gaza Strip." },
         { "day":"11", "month":"9", "year":"2007", "text": "Russia detonates a nano-bomb; dubbed the \"Father of All Bombs,\" it is the largest non-nuclear weapon developed to date." },
         { "day":"11", "month":"9", "year":"2012", "text": "US consulate in Benghazi, Libya, attacked and burned down; 4 Americans were killed including the US ambassador, J. Christopher Stevens." }      ]
   }
]
