[
   {
      "facts":[
         { "day":"12", "month":"9", "year":"490 BC", "text": "Athenian and Plataean Hoplites commanded by General Miltiades drive back a Persian invasion force under General Datis at Marathon." },
         { "day":"12", "month":"9", "year":"1213", "text": "Simon de Montfort defeats Raymond of Toulouse and Peter II of Aragon at Muret, France." },
         { "day":"12", "month":"9", "year":"1609", "text": "Henry Hudson sails into what is now New York Harbor aboard his sloop Half Moon." },
         { "day":"12", "month":"9", "year":"1662", "text": "Governor Berkley of Virginia is denied his attempts to repeal the Navigation Acts." },
         { "day":"12", "month":"9", "year":"1683", "text": "A combined Austrian and Polish army defeats the Turks at Kahlenberg and lifts the siege on Vienna, Austria." },
         { "day":"12", "month":"9", "year":"1722", "text": "The Treaty of St. Petersburg puts an end to the Russo-Persian War." },
         { "day":"12", "month":"9", "year":"1786", "text": "Despite his failed efforts to suppress the American Revolution, Lord Cornwallis is appointed governor general of India." },
         { "day":"12", "month":"9", "year":"1836", "text": "Mexican authorities crush the revolt which broke out on August 25." },
         { "day":"12", "month":"9", "year":"1918", "text": "British troops retake Havincourt, Moeuvres, and Trescault along the Western Front." },
         { "day":"12", "month":"9", "year":"1919", "text": "Adolf Hitler joins German Worker’s Party." },
         { "day":"12", "month":"9", "year":"1939", "text": "In response to the invasion of Poland, the French Army advances into Germany. On this day they reach their furthest penetration-five miles." },
         { "day":"12", "month":"9", "year":"1940", "text": "Italian forces begin an offensive into Egypt from Libya." },
         { "day":"12", "month":"9", "year":"1940", "text": "The Lascaux Caves in France, with their prehistoric wall paintings, are discovered." },
         { "day":"12", "month":"9", "year":"1944", "text": "American troops fight their way into Germany." },
         { "day":"12", "month":"9", "year":"1945", "text": "French troops land in Indochina." },
         { "day":"12", "month":"9", "year":"1969", "text": "President Richard Nixon orders a resumption in bombing North Vietnam." },
         { "day":"12", "month":"9", "year":"1977", "text": "Steve Biko, a South African activist opposing apartheid, dies while in police custody." },
         { "day":"12", "month":"9", "year":"1980", "text": "Military coup in Turkey." },
         { "day":"12", "month":"9", "year":"1990", "text": "East and West Germany, along with the UK, US and USSR—the Allied nations that had occupied post-WWII Germany—sign the final settlement for reunification of Germany." },
         { "day":"12", "month":"9", "year":"1992", "text": "Space Shuttle Endeavor takes off on NASA’s 50th shuttle mission; its crew includes the first African-American woman in space, the first married couple, and the first Japanese citizen to fly in a US spacecraft." },
         { "day":"12", "month":"9", "year":"2003", "text": "UN lifts sanctions against Libya in exchange for that country accepting responsibility for the bombing of Pan Am Flight 103 in 1988 and paying recompense to victims’ families." },
         { "day":"12", "month":"9", "year":"2007", "text": "Joseph Estrada, former president of the Philippines, is convicted of plunder." },
         { "day":"12", "month":"9", "year":"2011", "text": "In New York City, the 9/11 Memorial Museum opens to the public." }
      ]
   }
]
