[
   {
      "facts":[
         { "day":"17", "month":"9", "year":"1787", "text": "The Constitutional Convention in Philadelphia approves the constitution for the United States of America." },
         { "day":"17", "month":"9", "year":"1796", "text": "President George Washington delivers his “Farewell Address” to Congress before concluding his second term in office." },
         { "day":"17", "month":"9", "year":"1862", "text": "The Battle of Antietam in Maryland, the bloodiest day in U.S. history, commences. Fighting in the corn field, Bloody Lane and Burnside’s Bridge rages all day as the Union and Confederate armies suffer a combined 26,293 casualties." },
         { "day":"17", "month":"9", "year":"1868", "text": "The Battle of Beecher’s Island begins, in which Major George “Sandy” Forsyth and 50 volunteers hold off 500 Sioux and Cheyenne in eastern Colorado." },
         { "day":"17", "month":"9", "year":"1902", "text": "U.S. troops are sent to Panama to keep train lines open over the isthmus as Panamanian nationals struggle for independence from Colombia." },
         { "day":"17", "month":"9", "year":"1903", "text": "Turks destroy the town of Kastoria in Bulgaria, killing 10,000 civilians." },
         { "day":"17", "month":"9", "year":"1916", "text": "Germany’s “Red Baron,” Manfred von Richthofen, wins his first aerial combat." },
         { "day":"17", "month":"9", "year":"1917", "text": "The German Army recaptures the Russian Port of Riga from Russian forces." },
         { "day":"17", "month":"9", "year":"1939", "text": "With the German army already attacking western Poland, the Soviet Union launches an invasion of eastern Poland." },
         { "day":"17", "month":"9", "year":"1942", "text": "British Prime Minister Winston Churchill meets with Soviet Premier Josef Stalin in Moscow as the German Army rams into Stalingrad." },
         { "day":"17", "month":"9", "year":"1944", "text": "British airborne troops parachute into Holland to capture the Arnhem bridge as part of Operation Market-Garden. The plan called for the airborne troops to be relieved by British troops, but they were left stranded and eventually surrendered to the Germans." },
         { "day":"17", "month":"9", "year":"1947", "text": "James Forestall is sworn in as first the U.S. Secretary of Defense." },
         { "day":"17", "month":"9", "year":"1957", "text": "The Thai army seizes power in Bangkok." },
         { "day":"17", "month":"9", "year":"1959", "text": "The X-15 rocket plane makes its first flight." },
         { "day":"17", "month":"9", "year":"1962", "text": "The first federal suit to end public school segregation is filed by the U.S. Justice Department." },
         { "day":"17", "month":"9", "year":"1976", "text": "The Space Shuttle is unveiled to the public." },
         { "day":"17", "month":"9", "year":"1978", "text": "Egypt and Israel sign the Camp David Accords." },
         { "day":"17", "month":"9", "year":"1980", "text": "Nationwide independent trade union Solidarity established in Poland." },
         { "day":"17", "month":"9", "year":"1983", "text": "Vanessa Williams becomes the first black Miss America; relinquished crown early after scandal over nude photos." },
         { "day":"17", "month":"9", "year":"2001", "text": "The New York Stock Exchange reopens for the first time since the September 11 terrorist attacks on the Twin Towers; longest period of closure since the Great Depression of the 1930s." },
         { "day":"17", "month":"9", "year":"2006", "text": "Alaska’s Fourpeaked Mountain erupts for the first time in at least 10,000 years." },
         { "day":"17", "month":"9", "year":"2011", "text": "Occupy Wall Street movement calling for greater social and economic equality begins in New York City’s Zuccotti Park, coining the phrase “We are the 99%.”" },
      ]
   }
]
