[
   {
      "facts":[
         { "day":"18", "month":"9", "year":"1758", "text": "James Abercromby is replaced as supreme commander of British forces after his defeat by French commander the Marquis of Montcalm at Fort Ticonderoga during the French and Indian War." },
         { "day":"18", "month":"9", "year":"1759", "text": "Quebec surrenders to the British after a battle which sees the deaths of both James Wolfe and Louis Montcalm, the British and French commanders." },
         { "day":"18", "month":"9", "year":"1793", "text": "George Washington lays the foundation stone for the U.S. Capitol." },
         { "day":"18", "month":"9", "year":"1830", "text": "Tom Thumb, the first locomotive built in the United States, loses a nine-mile race in Maryland to a horse." },
         { "day":"18", "month":"9", "year":"1850", "text": "Congress passes the second Fugitive Slave Bill into law (the first was enacted in 1793), requiring the return of escaped slaves to their owners." },
         { "day":"18", "month":"9", "year":"1862", "text": "After waiting all day for a Union attack which never came at Antietam, Confederate General Robert E. Lee begins a retreat out of Maryland and back to Virginia." },
         { "day":"18", "month":"9", "year":"1863", "text": "Union cavalry troops clash with a group of Confederates at Chickamauga Creek." },
         { "day":"18", "month":"9", "year":"1874", "text": "The Nebraska Relief and Aid Society is formed to help farmers whose crops were destroyed by grasshoppers swarming throughout the American West." },
         { "day":"18", "month":"9", "year":"1911", "text": "Russian Premier Piotr Stolypin dies four days after being shot at the Kiev opera house by socialist lawyer Dimitri Bogroff." },
         { "day":"18", "month":"9", "year":"1914", "text": "The Irish Home Rule Bill becomes law, but is delayed until after World War I." },
         { "day":"18", "month":"9", "year":"1929", "text": "Charles Lindbergh takes off on a 10,000 mile air tour of South America." },
         { "day":"18", "month":"9", "year":"1934", "text": "The League of Nations admits the Soviet Union." },
         { "day":"18", "month":"9", "year":"1939", "text": "A German U-boat sinks the British aircraft carrier Courageous, killing 500 people." },
         { "day":"18", "month":"9", "year":"1948", "text": "Margaret Chase Smith becomes the first woman elected to the Senate without completing another senator’s term when she defeats Democratic opponent Adrian Scolten. Smith is also the only woman to be elected to and serve in both houses of Congress." },
         { "day":"18", "month":"9", "year":"1960", "text": "Two thousand cheer Castro’s arrival in New York for the United Nations session." },
         { "day":"18", "month":"9", "year":"1961", "text": "UN Secretary-General Dag Hammarskjold is killed in a plane crash while attempting to negotiate peace in the Congo." },
         { "day":"18", "month":"9", "year":"1964", "text": "U.S. destroyers fire on hostile targets in Vietnam." },
         { "day":"18", "month":"9", "year":"1973", "text": "East and West Germany and The Bahamas are admitted to United Nations." },
         { "day":"18", "month":"9", "year":"1975", "text": "Patty Hearst, granddaughter of newspaper magnate William Randolph Hearst, is kidnapped by violent radical group SLA (Symbionese Liberation Army); she later took part in some of the group’s militant activities, is captured by FBI agents." },
         { "day":"18", "month":"9", "year":"1977", "text": "Voyager I takes first photo of Earth and the Moon together." },
         { "day":"18", "month":"9", "year":"1980", "text": "Cosmonaut Arnoldo Tamayo, a Cuban, becomes the first black to be sent on a mission in space." },
         { "day":"18", "month":"9", "year":"1998", "text": "ICANN (Internet Corporation for Assigned Names and Numbers) is formed to coordinate unique identifying addresses for Websites worldwide." },
         { "day":"18", "month":"9", "year":"2009", "text": "The US television soap opera The Guiding Light broadcasts its final episode, ending a 72-year run that began on radio." }
      ]
   }
]
