[
   {
      "facts":[
         { "day":"19", "month":"9", "year":"1356", "text": "In a landmark battle of the Hundred Years’ War, English Prince Edward defeats the French at Poitiers." },
         { "day":"19", "month":"9", "year":"1544", "text": "Francis, the king of France, and Charles V of Austria sign a peace treaty in Crespy, France, ending a 20-year war." },
         { "day":"19", "month":"9", "year":"1692", "text": "Giles Corey is pressed to death for standing mute and refusing to answer charges of witchcraft brought against him. He is the only person in America to have suffered this punishment." },
         { "day":"19", "month":"9", "year":"1777", "text": "American forces under Gen. Horatio Gates meet British troops led by Gen. John Burgoyne at Saratoga Springs, NY." },
         { "day":"19", "month":"9", "year":"1783", "text": "The first hot-air balloon is sent aloft in Versailles, France with animal passengers including a sheep, rooster and a duck." },
         { "day":"19", "month":"9", "year":"1788", "text": "Charles de Barentin becomes lord chancellor of France." },
         { "day":"19", "month":"9", "year":"1841", "text": "The first railway to span a frontier is completed between Stousbourg and Basle, in Europe." },
         { "day":"19", "month":"9", "year":"1863", "text": "In Georgia, the two-day Battle of Chickamauga begins as Union troops under George Thomas clash with Confederates under Nathan Bedford Forrest." },
         { "day":"19", "month":"9", "year":"1893", "text": "New Zealand becomes the first nation to grant women the right to vote." },
         { "day":"19", "month":"9", "year":"1900", "text": "President Loubet of France pardons Jewish army captain Alfred Dreyfus, twice court-martialed and wrongly convicted of spying for Germany." },
         { "day":"19", "month":"9", "year":"1918", "text": "American troops of the Allied North Russia Expeditionary Force receive their baptism of fire near the town of Seltso against Soviet forces." },
         { "day":"19", "month":"9", "year":"1948", "text": "Moscow announces it will withdrawal soldiers from Korea by the end of the year." },
         { "day":"19", "month":"9", "year":"1955", "text": "Argentina’s President Juan Peron is overthrown by rebels." },
         { "day":"19", "month":"9", "year":"1957", "text": "First underground nuclear test is takes place in Nevada." },
         { "day":"19", "month":"9", "year":"1970", "text": "First Glastonbury Festival of Contemporary Performing Artis (originally called the Pilton Festival) held near Pliton, Somerset, England." },
         { "day":"19", "month":"9", "year":"1973", "text": "Carl XVI Gustaf invested as King of Sweden, following the death of his grandfather King Gustaf VI Adolf." },
         { "day":"19", "month":"9", "year":"1982", "text": "The first documented emoticons, :-) and :-(, posted on Carnegie Mellon University Bulletin Board System by Scott Fahlman." },
         { "day":"19", "month":"9", "year":"1985", "text": "An earthquake kills thousands in Mexico City." },
         { "day":"19", "month":"9", "year":"1985", "text": "Parents Music Resource Center formed by Tipper Gore (wife of then-Senator Al Gore) and other political wives to lobby for Parental Advisory stickers on music packaging." },
         { "day":"19", "month":"9", "year":"1991", "text": "German hikers near the Austria-Italy border discover the naturally preserved mummy of a man from about 3,300 BC; Europe’s oldest natural human mummy, he is dubbed Otzi the Iceman because his lower half was encased in ice." },
         { "day":"19", "month":"9", "year":"2006", "text": "Military coup in Bangkok,  revokes Thailand’s constitution and establishes martial law." }
      ]
   }
]
