[
   {
      "facts":[
         { "day":"21", "month":"9", "year":"454", "text": "In Italy, Aetius, the supreme army commander, is murdered in Ravenna by Valentinian III, the emperor of the West." },
         { "day":"21", "month":"9", "year":"1327", "text": "Edward II of England is murdered by order of his wife." },
         { "day":"21", "month":"9", "year":"1520", "text": "Suleiman (the Magnificent), son of Selim, becomes Ottoman sultan in Constantinople." },
         { "day":"21", "month":"9", "year":"1589", "text": "The Duke of Mayenne of France is defeated by Henry IV at the Battle of Arques." },
         { "day":"21", "month":"9", "year":"1673", "text": "James Needham returns to Virginia after exploring the land to the west, which would become Tennessee." },
         { "day":"21", "month":"9", "year":"1745", "text": "A Scottish Jacobite army commanded by Lord George Murray routs the Royalist army of General Sir John Cope at Prestonpans." },
         { "day":"21", "month":"9", "year":"1863", "text": "Union troops defeated at Chickamauga seek refuge in Chattanooga, Tennessee, which is then besieged by Confederate troops." },
         { "day":"21", "month":"9", "year":"1904", "text": "Exiled Nez Perce leader Chief Joseph dies of a \"broken heart\"." },
         { "day":"21", "month":"9", "year":"1915", "text": "Stonehenge is sold by auction for 6,600 pounds sterling ($11,500) to a Mr. Chubb, who buys it as a present for his wife. He presents it to the British nation three years later." },
         { "day":"21", "month":"9", "year":"1929", "text": "Fighting between China and the Soviet Union breaks out along the Manchurian border." },
         { "day":"21", "month":"9", "year":"1936", "text": "The German army holds its largest maneuvers since 1914." },
         { "day":"21", "month":"9", "year":"1937", "text": "The women’s airspeed record is set at 292 mph by American pilot Jacqueline Cochran." },
         { "day":"21", "month":"9", "year":"1937", "text": "J.R.R. Tolkien’s fantasy novel The Hobbit is published." },
         { "day":"21", "month":"9", "year":"1941", "text": "The German Army cuts off the Crimean Peninsula from the rest of the Soviet Union." },
         { "day":"21", "month":"9", "year":"1942", "text": "British forces attack the Japanese in Burma." },
         { "day":"21", "month":"9", "year":"1944", "text": "U.S. troops of the 7th Army, invading Southern France, cross the Meuse River." },
         { "day":"21", "month":"9", "year":"1978", "text": "Two Soviet cosmonauts set a space endurance record after 96 days in space." },
         { "day":"21", "month":"9", "year":"1981", "text": "Belize granted full independence from the United Kingdom." },
         { "day":"21", "month":"9", "year":"1989", "text": "General Colin Powell is confirmed by the U.S. Senate as Chairman of the Joint Chiefs of Staff." },
         { "day":"21", "month":"9", "year":"1991", "text": "Armenia granted independence from USSR." },
         { "day":"21", "month":"9", "year":"1993", "text": "The Russian constitutional crisis of 1993 begins when Russian President Boris Yeltsin suspends parliament and invalidates the existing constitution." },
         { "day":"21", "month":"9", "year":"1999", "text": "Earthquake in Taiwan kills more than 2,400, injures over 11,305, and causes $300 billion New Taiwan dollars ($10 billion in US dollars)." },
         { "day":"21", "month":"9", "year":"2003", "text": "Galileo space mission ends as the probe is sent into Jupiter’s atmosphere where it is crushed." }
      ]
   }
]
