[
   {
      "facts":[
         { "day":"24", "month":"9", "year":"1788", "text": "After having been dissolved, the French Parliament of Paris reassembles in triumph." },
         { "day":"24", "month":"9", "year":"1789", "text": "Congress passes the Judiciary Act of 1789, establishing a strong federal court system with the powers it needs to ensure the supremacy of the Constitution and federal law. The new Supreme Court will have a chief justice and five associate justices." },
         { "day":"24", "month":"9", "year":"1842", "text": "Branwell Bronte, the brother of the Bronte sisters and the model for Hindley Earnshaw in Emily’s novel Wuthering Heights, dies of tuberculosis. Emily and Anne die the same year." },
         { "day":"24", "month":"9", "year":"1862", "text": "President Abraham Lincoln suspends the writ of habeas corpus against anyone suspected of being a Southern sympathizer." },
         { "day":"24", "month":"9", "year":"1904", "text": "Sixty-two die and 120 are injured in head-on train collision in Tennessee." },
         { "day":"24", "month":"9", "year":"1914", "text": "In the Alsace-Lorraine area between France and Germany, the German Army captures St. Mihiel." },
         { "day":"24", "month":"9", "year":"1915", "text": "Bulgaria mobilizes troops on the Serbian border." },
         { "day":"24", "month":"9", "year":"1929", "text": "The first flight using only instruments is completed by U.S. Army pilot James Doolittle." },
         { "day":"24", "month":"9", "year":"1930", "text": "Noel Coward’s comedy Private Lives opens in London starring Gertrude Lawrence and Coward himself." },
         { "day":"24", "month":"9", "year":"1947", "text": "The World Women’s Party meets for the first time since World War II." },
         { "day":"24", "month":"9", "year":"1956", "text": "The first transatlantic telephone cable system begins operation." },
         { "day":"24", "month":"9", "year":"1957", "text": "President Dwight D. Eisenhower sends federal troops into Little Rock, Arkansas, to protect nine black students entering its newly integrated high school." },
         { "day":"24", "month":"9", "year":"1960", "text": "The Enterprise, the first nuclear powered aircraft carrier, is launched." },
         { "day":"24", "month":"9", "year":"1962", "text": "The University of Mississippi agrees to admit James Meredith as the first black university student, sparking more rioting." },
         { "day":"24", "month":"9", "year":"1969", "text": "The \"Chicago Eight,\" charged with conspiracy and crossing state lines with the intent to incite a riot, go on trial for their part in the mayhem during the 1968 Democratic Party National Convention in the \"Windy City.\"" },
         { "day":"24", "month":"9", "year":"1970", "text": "The Soviet Luna 16 lands, completing the first unmanned round trip to the moon." },
         { "day":"24", "month":"9", "year":"1979", "text": "CompuServe (CIS) offers one of the first online services to consumers; it will dominate among Internet service providers for consumers through the mid-1990s." },
         { "day":"24", "month":"9", "year":"1993", "text": "Sihanouk is reinstalled as king of Cambodia." },
         { "day":"24", "month":"9", "year":"1996", "text": "Comprehensive Nuclear-Test-Ban Treaty signed by representatives of 71 nations at the UN; at present, five key nations have signed but not ratified it and three others have not signed." },
         { "day":"24", "month":"9", "year":"2005", "text": "Hurricane Rita, the 4th-most intense Atlantic hurricane ever recorded, comes ashore in Texas causing extensive damage there and in Louisiana, which had devastated by Hurricane Katrina less than a month earlier." },
         { "day":"24", "month":"9", "year":"2009", "text": "LRAD (Long Range Acoustic Device) \"sonic cannon,\" a non-lethal device that utilizes intense sound, is used in the United States for the first time, to disperse protestors at the G20 summit in Pittsburgh, Penn." }
      ]
   }
]
