[
   {
      "facts":[
         { "day":"27", "month":"9", "year":"1540", "text": "The Society of Jesus, a religious order under Ignatius Loyola, is approved by the Pope." },
         { "day":"27", "month":"9", "year":"1669", "text": "The island of Crete in the Mediterranean Sea falls to the Ottoman Turks after a 21-year siege." },
         { "day":"27", "month":"9", "year":"1791", "text": "Jews in France are granted French citizenship." },
         { "day":"27", "month":"9", "year":"1864", "text": "Confederate guerrilla Bloody Bill Anderson and his henchmen, including a teenage Jesse James, massacre 20 unarmed Union soldiers at Centralia, Missouri. The event becomes known as the Centralia Massacre." },
         { "day":"27", "month":"9", "year":"1869", "text": "Wild Bill Hickok, sheriff of Hays City, Kan., shoots down Samuel Strawhim, a drunken teamster causing trouble." },
         { "day":"27", "month":"9", "year":"1916", "text": "Constance of Greece declares war on Bulgaria." },
         { "day":"27", "month":"9", "year":"1918", "text": "President Woodrow Wilson opens his fourth Liberty Loan campaign to support men and machines for World War I." },
         { "day":"27", "month":"9", "year":"1920", "text": "Eight Chicago White Sox players are charged with fixing the 1919 World Series." },
         { "day":"27", "month":"9", "year":"1939", "text": "Germany occupies Warsaw as Poland falls to Germany and the Soviet Union." },
         { "day":"27", "month":"9", "year":"1942", "text": "Australian forces defeat the Japanese on New Guinea in the South Pacific." },
         { "day":"27", "month":"9", "year":"1944", "text": "Thousands of British troops are killed as German forces rebuff their massive effort to capture the Arnhem Bridge across the Rhine River in Holland." },
         { "day":"27", "month":"9", "year":"1950", "text": "U.S. Army and Marine troops liberate Seoul, South Korea." },
         { "day":"27", "month":"9", "year":"1956", "text": "The U.S. Air Force Bell X-2, the world’s fastest and highest-flying plane, crashes, killing the test pilot." },
         { "day":"27", "month":"9", "year":"1964", "text": "The Warren Commission, investigating the assassination of President John F. Kennedy, issues its report, stating its conclusion that Lee Harvey Oswald was the sole gunman." },
         { "day":"27", "month":"9", "year":"1979", "text": "US Congress approves Department of Education as the 13th agency in the US Cabinet." },
         { "day":"27", "month":"9", "year":"1983", "text": "Sukhumi massacre: Abkhaz separatist forces and their allies commit widespread atrocities against the civilian population in the USSR state of Georgia." },
         { "day":"27", "month":"9", "year":"1996", "text": "The Taliban capture Afghanistan’s capital city, Kabul." },
         { "day":"27", "month":"9", "year":"2003", "text": "European Space Agency launches SMART-1 satellite to orbit the moon." },
         { "day":"27", "month":"9", "year":"2007", "text": "NASA launches Dawn probe to explore and study the two larges objects of the asteroid belt, Vesta and Ceres." },
         { "day":"27", "month":"9", "year":"2008", "text": "Shai Shigang becomes the first Chinese to walk in space; he was part of the Shenzhou 7 crew." }
      ]
   }
]
