[
   {
      "facts":[
         { "day":"3", "month":"9", "year":"1189", "text": "After the death of Henry II, Richard Lionheart is crowned king of England." },
         { "day":"3", "month":"9", "year":"1260", "text": "Mamelukes under Sultan Qutuz defeat Mongols and Crusaders at Ain Jalut." },
         { "day":"3", "month":"9", "year":"1346", "text": "Edward III of England begins the siege of Calais, along the coast of France." },
         { "day":"3", "month":"9", "year":"1650", "text": "The English under Cromwell defeat a superior Scottish army under David Leslie at the Battle of Dunbar." },
         { "day":"3", "month":"9", "year":"1777", "text": "The American flag (stars & stripes), approved by Congress on June 14th, is carried into battle for the first time by a force under General William Maxwell." },
         { "day":"3", "month":"9", "year":"1783", "text": "The Treaty of Paris is signed by Great Britain and the new United States, formally bringing the American Revolution to an end." },
         { "day":"3", "month":"9", "year":"1838", "text": "Frederick Douglass escapes slavery disguised as a sailor. He would later write The Narrative Life of Frederick Douglass, his memoirs about slave life." },
         { "day":"3", "month":"9", "year":"1855", "text": "General William Harney defeats Little Thunder’s Brule Sioux at the Battle of Blue Water in Nebraska." },
         { "day":"3", "month":"9", "year":"1895", "text": "The first professional American football game is played in Latrobe, Pennsylvania between the Latrobe Young Men’s Christian Association and the Jeannette Athletic Club. Latrobe wins 12-0." },
         { "day":"3", "month":"9", "year":"1914", "text": "The French capital is moved from Paris to Bordeaux as the Battle of the Marne begins." },
         { "day":"3", "month":"9", "year":"1916", "text": "The German Somme front is broken by an Allied offensive." },
         { "day":"3", "month":"9", "year":"1918", "text": "The United States recognizes the nation of Czechoslovakia." },
         { "day":"3", "month":"9", "year":"1939", "text": "After Germany ignores Great Britain’s ultimatum to stop the invasion of Poland, Great Britain declares war on Germany, marking the beginning of World War II in Europe." },
         { "day":"3", "month":"9", "year":"1939", "text": "The British passenger ship Athenia is sunk by a German submarine in the Atlantic, with 30 Americans among those killed. American Secretary of State Cordell Hull warns Americans to avoid travel to Europe unless absolutely necessary." },
         { "day":"3", "month":"9", "year":"1943", "text": "British troops invade Italy, landing at Calabria." },
         { "day":"3", "month":"9", "year":"1944", "text": "The U.S. Seventh Army captures Lyons, France." },
         { "day":"3", "month":"9", "year":"1945", "text": "General Tomoyuki Yamashita, the Japanese commander of the Philippines, surrenders to Lieutenant General Jonathan Wainwright at Baguio." },
         { "day":"3", "month":"9", "year":"1967", "text": "Lieutenant General Ngyuen Van Thieu is elected president of South Vietnam." },
         { "day":"3", "month":"9", "year":"1969", "text": "Ho Chi Minh, the leader of North Vietnam, dies." },
         { "day":"3", "month":"9", "year":"1976", "text": "The unmanned US spacecraft Viking 2 lands on Mars, takes first close-up, color photos of the planet’s surface." },
         { "day":"3", "month":"9", "year":"1981", "text": "Egypt arrests some 1,500 opponents of the government." },
         { "day":"3", "month":"9", "year":"1989", "text": "US begins shipping military aircraft and weapons to Columbia for use against that country’s drug lords." },
         { "day":"3", "month":"9", "year":"1994", "text": "Russia and China sign a demarcation agreement to end dispute over a stretch of their border and agree they will no longer target each other with nuclear weapons." },
         { "day":"3", "month":"9", "year":"2001", "text": "Protestant loyalists in Belfast, Ireland, begin an 11-week picket of the Holy Cross Catholic school for girls, sparking rioting." }
      ]
   }
]
