[
   {
      "facts":[
         { "day":"5", "month":"9", "year":"1666", "text": "The Fire of London is extinguished after two days." },
         { "day":"5", "month":"9", "year":"1664", "text": "After days of negotiation, the Dutch settlement of New Amsterdam surrenders to the British, who will rename it New York." },
         { "day":"5", "month":"9", "year":"1792", "text": "Maximilien Robespierre is elected to the National Convention in France." },
         { "day":"5", "month":"9", "year":"1804", "text": "US Navy lieutenant Richard Somers and members of his crew are buried at Tripoli; they died when USS Intrepid exploded while entering Tripoli harbor on a mission to destroy the enemy fleet there during the First Barbary War." },
         { "day":"5", "month":"9", "year":"1816", "text": "Louis XVIII of France dissolves the chamber of deputies, which has been challenging his authority." },
         { "day":"5", "month":"9", "year":"1859", "text": "Harriot E. Wilson’s Our Nig, is published, the first U.S. novel by an African American woman." },
         { "day":"5", "month":"9", "year":"1867", "text": "The first shipment of cattle leaves Abilene, Kansas, on a Union Pacific train headed to Chicago." },
         { "day":"5", "month":"9", "year":"1870", "text": "Author Victor Hugo returns to Paris from the Isle of Guernsey where he had lived in exile for almost 20 years." },
         { "day":"5", "month":"9", "year":"1877", "text": "The great Sioux warrior Crazy Horse is fatally bayoneted at age 36 by a soldier at Fort Robinson, Nebraska." },
         { "day":"5", "month":"9", "year":"1878", "text": "Bat Masterson, Wyatt Earp, Bill Tilghman and Clay Allison, four of the West’s most famous gunmen, meet in Dodge City, Kansas." },
         { "day":"5", "month":"9", "year":"1905", "text": "The Russian-Japanese War ends as representatives of the combating empires, meeting in New Hampshire, sign the Treaty of Portsmouth. Japan achieves virtually all of its original war aims." },
         { "day":"5", "month":"9", "year":"1910", "text": "Marie Curie demonstrates the transformation of radium ore to metal at the Academy of Sciences in France." },
         { "day":"5", "month":"9", "year":"1944", "text": "Germany launches its first V-2 missile at Paris, France." },
         { "day":"5", "month":"9", "year":"1958", "text": "Martin Luther King is arrested in an Alabama protest for loitering and fined $14 for refusing to obey police." },
         { "day":"5", "month":"9", "year":"1960", "text": "Leopold Sedar Sengingor, poet and politician, is elected president of Senegal, Africa." },
         { "day":"5", "month":"9", "year":"1969", "text": "Charges brought against US lieutenant William Calley in the March 1968 My Lai Massacre during Vietnam War." },
         { "day":"5", "month":"9", "year":"1972", "text": "\"Black September,\" a Palestinian terrorist group take 11 Israeli athletes hostage at the Olympic Games in Munich; by midnight all hostages and all but 3 terrorists are dead." },
         { "day":"5", "month":"9", "year":"1975", "text": "President Gerald Ford evades an assassination attempt in Sacramento, California." },
         { "day":"5", "month":"9", "year":"1977", "text": "Hanns-Martin Schleyer, a German business executive who headed to powerful organization and had been an SS officer during WW2, is abducted by the left-wing extremist group Red Army Faction, who execute him on Oct. 18." },
         { "day":"5", "month":"9", "year":"1977", "text": "Voyager 1 space probe launched." },
         { "day":"5", "month":"9", "year":"1978", "text": "Israel’s Menachem Begin and Egypt’s Anwar Sadat begin discussions on a peace process, at Camp David, Md." },
         { "day":"5", "month":"9", "year":"1980", "text": "World’s longest tunnel opens; Switzerland’s St. Gotthard Tunnel stretches 10.14 miles (16.224 km) from Goschenen to Airolo." },
         { "day":"5", "month":"9", "year":"1984", "text": "Space Shuttle Discovery lands afters its maiden voyage." },
         { "day":"5", "month":"9", "year":"1996", "text": "Hurricane Fran comes ashore near Cape Fear, No. Car. It will kill 27 people and cause more than $3 billion in damage." }
      ]
   }
]
