[
   {
      "facts":[
         { "day":"7", "month":"9", "year":"1571", "text": "At the Battle of Lepanto in the Mediterranean Sea, the Christian galley fleet destroys the Turkish galley fleet." },
         { "day":"7", "month":"9", "year":"1630", "text": "The town of Trimountaine in Massachusetts is renamed Boston. It became the state capital." },
         { "day":"7", "month":"9", "year":"1701", "text": "England, Austria, and the Netherlands form an Alliance against France." },
         { "day":"7", "month":"9", "year":"1778", "text": "Shawnee Indians attack and lay siege to Boonesborough, Kentucky." },
         { "day":"7", "month":"9", "year":"1812", "text": "On the road to Moscow, Napoleon wins a costly victory over the Russians at Borodino." },
         { "day":"7", "month":"9", "year":"1813", "text": "The earliest known printed reference to the United States by the nickname “Uncle Sam” occurs in the Troy Post." },
         { "day":"7", "month":"9", "year":"1864", "text": "Union General Phil Sheridan’s troops skirmish with the Confederates under Jubal Early outside Winchester, Virginia." },
         { "day":"7", "month":"9", "year":"1876", "text": "The James-Younger gang botches an attempt to rob the First National Bank of Northfield, Minnesota." },
         { "day":"7", "month":"9", "year":"1888", "text": "An incubator is used for the first time on a premature infant." },
         { "day":"7", "month":"9", "year":"1892", "text": "The first heavyweight-title boxing match fought with gloves under Marquis of Queensbury rules ends when James J. Corbett knocks out John L. Sullivan in the 21st round." },
         { "day":"7", "month":"9", "year":"1912", "text": "French aviator Roland Garros sets an altitude record of 13,200 feet." },
         { "day":"7", "month":"9", "year":"1916", "text": "The U.S. Congress passes the Workman’s Compensation Act." },
         { "day":"7", "month":"9", "year":"1940", "text": "Germany’s blitz against London begins during the Battle of Britain." },
         { "day":"7", "month":"9", "year":"1942", "text": "The Red Army pushes back the German line northwest of Stalingrad." },
         { "day":"7", "month":"9", "year":"1953", "text": "Nikita Krushchev elected first secretary of the Communist Party of the Soviet Union." },
         { "day":"7", "month":"9", "year":"1954", "text": "Integration of public schools begins in Washington D.C. and Maryland." },
         { "day":"7", "month":"9", "year":"1965", "text": "Pro Football Hall of Fame opens in Canton, Ohio." },
         { "day":"7", "month":"9", "year":"1970", "text": "Jockey Blll Shoemaker earns 6,033rd win, breaking Johnny Longden’s record for most lifetime wins; Shoemaker’s record would stand for 29 years." },
         { "day":"7", "month":"9", "year":"1977", "text": "Panama and US sign Torrios-Carter Treaties to transfer control of the Panama Canal from the US to Panama at the end of the 20th century." },
         { "day":"7", "month":"9", "year":"1978", "text": "Secret police agent Francesco Giullino assassinates Bulgarian dissident Georgi Markov in London by firing a ricin pellet from a specially designed umbrella." },
         { "day":"7", "month":"9", "year":"1979", "text": "ESPN, the Entertainment and Sports Programig Network, debuts." },
         { "day":"7", "month":"9", "year":"1986", "text": "Desmond Tutu becomes first black leader of the Church of the Province of Southern Africa (now the Anglican Church of South Africa)." },
         { "day":"7", "month":"9", "year":"1988", "text": "Pilot and cosmonaut Abdul Ahad Mohmand, the first Afghan to travel to outer space, returns to earth after 9 days aboard the Soviet space station Mir." },
         { "day":"7", "month":"9", "year":"2004", "text": "Hurricane Ivan damages 90% of buildings on the island of Grenada; 39 die in the Category 5 storm." },
         { "day":"7", "month":"9", "year":"2008", "text": "US Government assumes conservatorship of Fannie Mae and Freddie Mac, the country’s two largest mortgage financing companies, during the subprime mortgage crisis." },
      ]
   }
]
