[
   {
      "facts":[
         { "day":"8", "month":"9", "year":"1504", "text": "Michelangelo’s 13-foot marble statue of David is unveiled in Florence, Italy." },
         { "day":"8", "month":"9", "year":"1529", "text": "The Ottoman Sultan Suleiman re-enters Buda and establishes John Zapolyai as the puppet king of Hungary." },
         { "day":"8", "month":"9", "year":"1565", "text": "Spanish explorers found St. Augustine, Florida, the first permanent European settlement in what is now the United States." },
         { "day":"8", "month":"9", "year":"1628", "text": "John Endecott arrives with colonists at Salem, Massachusetts, where he will become the governor." },
         { "day":"8", "month":"9", "year":"1644", "text": "The Dutch colony of New Amsterdam surrenders to the British fleet that sails into its harbor. Five years later, the British change the name to New York." },
         { "day":"8", "month":"9", "year":"1755", "text": "British forces under William Johnson defeat the French and the Indians at the Battle of Lake George." },
         { "day":"8", "month":"9", "year":"1760", "text": "The French surrender the city of Montreal to the British." },
         { "day":"8", "month":"9", "year":"1845", "text": "A French column surrenders at Sidi Brahim in the Algerian War." },
         { "day":"8", "month":"9", "year":"1863", "text": "Confederate Lieutenant Dick Dowling thwarts a Union naval landing at Sabine Pass, northeast of Galveston, Texas." },
         { "day":"8", "month":"9", "year":"1903", "text": "Between 30,000 and 50,000 Bulgarian men, women and children are massacred in Monastir by Turkish troops seeking to check a threatened Macedonian uprising." },
         { "day":"8", "month":"9", "year":"1906", "text": "Robert Turner invents the automatic typewriter return carriage." },
         { "day":"8", "month":"9", "year":"1915", "text": "Germany begins a new offensive in Argonne on the Western Front." },
         { "day":"8", "month":"9", "year":"1921", "text": "Margaret Gorman of Washington, D.C., is named the first Miss America." },
         { "day":"8", "month":"9", "year":"1925", "text": "Germany is admitted into the League of Nations." },
         { "day":"8", "month":"9", "year":"1935", "text": "Senator Huey Long of Louisiana is shot to death in the state capitol, allegedly by Dr. Carl Austin Weiss, Jr." },
         { "day":"8", "month":"9", "year":"1944", "text": "Germany’s V-2 offensive against England begins." },
         { "day":"8", "month":"9", "year":"1945", "text": "Korea is partitioned by the Soviet Union and the United States." },
         { "day":"8", "month":"9", "year":"1951", "text": "Japanese representatives sign a peace treaty in San Francisco." },
         { "day":"8", "month":"9", "year":"1955", "text": "The United States, Australia, France, Great Britain, New Zealand, the Philippines, Pakistan, and Thailand sign the mutual defense treaty that established the Southeast Asia Treaty Organization (SEATO)." },
         { "day":"8", "month":"9", "year":"1960", "text": "Penguin Books in Britain is charged with obscenity for trying to publish the D.H. Lawrence novel Lady Chatterly’s Lover." },
         { "day":"8", "month":"9", "year":"1960", "text": "President Eisenhower dedicates NASA’s Marshall Space Flight Center in Huntsville, Alabama." },
         { "day":"8", "month":"9", "year":"1971", "text": "The Kennedy Center opens in Washington, DC with a performance of Leonard Bernstein’s Mass." },
         { "day":"8", "month":"9", "year":"1974", "text": "President Gerald Ford pardons former President Richard M. Nixon for any crimes arising from the Watergate scandal he may have committed while in office." },
         { "day":"8", "month":"9", "year":"1988", "text": "Wildfires in Yellowstone National Park in the US, the world’s first national park, force evacuation of the historic Old Faithful Inn; visitors and employees evacuated but the inn is saved." },
         { "day":"8", "month":"9", "year":"1991", "text": "Macedonian Independence Day; voters overwhelmingly approve referendum to form the Republic of Macedonia, independent of Yugoslavia." },
         { "day":"8", "month":"9", "year":"1994", "text": "USAir Flight 427 crashes on approach to Pittsburgh International Airport, killing all 132 people aboard; subsequent investigation leads to changes in manufacturing practices and pilot training." }
      ]
   }
]
