[
   {
      "births": [
         { "day":"19", "month":"10", "year":"1784", "text": "Leigh Hunt, English journalist, essayist, poet and political radical." },
         { "day":"19", "month":"10", "year":"1817", "text": "Tom Taylor, British playwright whose play Our American Cousin was being performed at Ford’s Theater when President Abraham Lincoln was assassinated by John Wilkes Booth." },
         { "day":"19", "month":"10", "year":"1833", "text": "Adam Lindsay Gordon, Australian poet." },
         { "day":"19", "month":"10", "year":"1858", "text": "Alice Josephine McLellan Birney, child welfare worker whose ideas evolved into the PTA." },
         { "day":"19", "month":"10", "year":"1895", "text": "Lewis Mumford, American writer, urban planner and social critic (The City in History)." },
         { "day":"19", "month":"10", "year":"1931", "text": "John Le Carré, English suspense and spy novelist." },
         { "day":"19", "month":"10", "year":"1932", "text": "Robert Reed, actor; best known for his role as Mike Brady on the ABC sitcom The Brady Bunch, he received Emmy nominations for his appearances in Medical Center, Rich Man, Poor Man, and Roots." },
         { "day":"19", "month":"10", "year":"1934", "text": "General Yakubu \"Jack\" Gowon, leader of Nigeria 1966-75; his government prevented Biafran secession during the Nigerian Civil War (1967-70)." },
         { "day":"19", "month":"10", "year":"1937", "text": "Peter Max, illustrator and graphic artist whose use of psychedelic shapes and bright colors made him popular in the 1960s." },
         { "day":"19", "month":"10", "year":"1944", "text": "Peter Tosh, reggae musician; member of The Wailers before establishing a successful solo career." },
         { "day":"19", "month":"10", "year":"1945", "text": "John Lithgow, actor (The World According to Garp; Terms of Endearment; 3rd Rock from the Sun TV sitcom)." },
         { "day":"19", "month":"10", "year":"1945", "text": "Jeannie C. Riley, country and gospel singer, whose 1968 hit \"Harper Valley PTA\" (penned by Tom T. Hall) reached No. 1 on both the Pop and Country charts of Billboard magazine." },
         { "day":"19", "month":"10", "year":"1948", "text": "Patrick Simmons, guitarist and vocalist for The Doobie Brothers band." },
         { "day":"19", "month":"10", "year":"1956", "text": "Grover Norquist, founder and president of Americans for Tax Reform political group, which opposes all tax increases." },
         { "day":"19", "month":"10", "year":"1962", "text": "Evander Holyfield, professional boxer; held Undisputed World Champion title in both cruiserweight and heavyweight divisions; known as \"The Real Deal.\" In a 1997  bout, challenger Mike Tyson bit off part of one of Holyfield’s ears." },
         { "day":"19", "month":"10", "year":"1963", "text": "Prince Laurent of Belgium." },
         { "day":"19", "month":"10", "year":"1967", "text": "Amy Carter, daughter of American president (1977-81) Jimmy Carter, she engaged in social activism in the 1980s." },
         { "day":"19", "month":"10", "year":"1969", "text": "Trey Parker, actor, animator, screenwriter, director, musician; co-creator of animated TV series South Park; co-wrote, co-directed multiple–Tony Award winning musical The Book of Mormon." }
      ]
   }
]
