[
   {
      "births": [
         { "day":"28", "month":"10", "year":"1875", "text": "Gilbert Grosvenor, editor, turned the National Geographic Society’s irregularly published pamphlet into a periodical with a circulation of nearly two million." },
         { "day":"28", "month":"10", "year":"1896", "text": "Howard Hansen, composer, director of the Eastman School of music." },
         { "day":"28", "month":"10", "year":"1903", "text": "Evelyn Waugh, English novelist who wrote Decline and Fall and Brideshead Revisited." },
         { "day":"28", "month":"10", "year":"1909", "text": "Francis Bacon, English artist who painted expressionist portraits." },
         { "day":"28", "month":"10", "year":"1912", "text": "Richard Doll, English epidemiologist who established a link between tobacco smoke and cancer." },
         { "day":"28", "month":"10", "year":"1914", "text": "Jonas Salk, U.S. scientist who developed the first vaccine against polio." },
         { "day":"28", "month":"10", "year":"1926", "text": "Bowie Kuhn, Commissioner of Major League Baseball (1969–1984)." },
         { "day":"28", "month":"10", "year":"1936", "text": "Charlie Daniels, country / Southern rock singer, songwriter, musician (\"The Devil Went Down to Georgia\")." },
         { "day":"28", "month":"10", "year":"1938", "text": "Anne Perry, an author of historical detective fiction, she was herself convicted at age 15 of aiding in the murder of a friend’s mother in New Zealand; their crime was the basis for the 1994 film Heavenly Creatures." },
         { "day":"28", "month":"10", "year":"1944", "text": "Anton Schlecker, founder of the Schlecker Company, which operated retail stores across Europe." },
         { "day":"28", "month":"10", "year":"1949", "text": "Bruce Jenner, athlete, actor; won gold medal in the Decathlon at the Summer Olympics in Montreal (1976)." },
         { "day":"28", "month":"10", "year":"1951", "text": "Joe R. Lansdale, author (\"Hap and Leonard\" novel series, \"Bubba Ho-Tep\"); won World Horror Convention Grand Master Award 2007." },
         { "day":"28", "month":"10", "year":"1955", "text": "William \"Bill\" Gates, the chairman and CEO of Microsoft Corporation, the world’s largest software firm." },
         { "day":"28", "month":"10", "year":"1967", "text": "Sophie, Hereditary Princess of Liechtenstein." },
         { "day":"28", "month":"10", "year":"1967", "text": "Julia Roberts, actress (Pretty Woman, Steel Magnolias; won Academy Award for Best Actress in Erin Brockovich)." },
         { "day":"28", "month":"10", "year":"1967", "text": "John Romero, game designer, developer; co-founded id Software (Doom, Quake)." },
         { "day":"28", "month":"10", "year":"1972", "text": "Brad Paisley, country / Southern rock singer, songwriter, musician (\"I’m Gonna Miss Her,\" \"Letter to Me\"); his many awards include the Country Music Association’s Entertainer of the Year 2010." }
      ]
   }
]
