[
   {
      "births": [
         { "day":"29", "month":"10", "year":"1882", "text": "Jean Giraudoux, French dramatist, novelist and diplomat, famous for his book Tiger at the Gates." },
         { "day":"29", "month":"10", "year":"1891", "text": "Fanny Brice, comedian, singer and actress." },
         { "day":"29", "month":"10", "year":"1897", "text": "Joseph G. Göbbels, German Nazi Propaganda Minister who committed suicide in Hitler’s bunker." },
         { "day":"29", "month":"10", "year":"1905", "text": "Henry Green, novelist (Living, Party Going)." },
         { "day":"29", "month":"10", "year":"1910", "text": "A. J. Ayer, English philosopher." },
         { "day":"29", "month":"10", "year":"1921", "text": "Bill Maudlin, American cartoonist whose GI characters \"Willie\" and \"Joe\" appeared in Stars and Stripes newspapers during World War II." },
         { "day":"29", "month":"10", "year":"1938", "text": "Ralph Bakshi, Palestinian-American director of live films and animated full-length films for adults including 1972’s Fritz the Cat (first animated film to be rated X by the Motion Picture Association of America), Wizards (1977) and The Lord of the Rings (1978)." },
         { "day":"29", "month":"10", "year":"1943", "text": "Don Simpson, film producer, screenwriter, actor; (co-producer Flashdance, 1985; Top Gun, 1986)." },
         { "day":"29", "month":"10", "year":"1945", "text": "Melba Moore, disco and R&B singer, actress (\"You Stepped into My Life,\" \"Lean on Me\")." },
         { "day":"29", "month":"10", "year":"1946", "text": "Peter Green, guitarist, songwriter, founder of the band Fleetwood Mac; regarded as one of the greatest guitarists of all time." },
         { "day":"29", "month":"10", "year":"1947", "text": "Richard Dreyfuss, actor (American Graffiti, Jaws; won Academy Award for Best Actor for 1977’s The Goodbye Girl)." },
         { "day":"29", "month":"10", "year":"1948", "text": "Kate Jackson, actress, director, producer (original Charlie’s Angels TV series, Scarecrow and Mrs. King TV series)." },
         { "day":"29", "month":"10", "year":"1954", "text": "Lee Child, author; creator of the Jack Reacher novel series." },
         { "day":"29", "month":"10", "year":"1958", "text": "David Remnick, journals, author, magazine editor (The New Yorker); won Pulitzer Prize for Lenin’s Tomb: The Last Days of the Soviet Empire (1994)." },
         { "day":"29", "month":"10", "year":"1971", "text": "Winona Ryder, actress, producer (Beetlejuice; Girl, Interrupted)." }
      ]
   }
]
