[
   {
      "births": [
         { "day":"30", "month":"10", "year":"1735", "text": "John Adams, second president of the United States who helped draft the Declaration of Independence and the Treaty of Paris, ending the American Revolution." },
         { "day":"30", "month":"10", "year":"1751", "text": "Richard Sheridan, playwright (The Rivals, The School for Scandal)." },
         { "day":"30", "month":"10", "year":"1839", "text": "Alfred Sisley, landscape painter." },
         { "day":"30", "month":"10", "year":"1857", "text": "Gertrude Atherton, novelist." },
         { "day":"30", "month":"10", "year":"1871", "text": "Paul Valery, poet and essayist." },
         { "day":"30", "month":"10", "year":"1882", "text": "William F. \"Bull\" Halsey, Jr., American admiral who played an instrumental role in the defeat of Japan during World War II. The Japanese surrender was signed on his flagship, the USS Missouri." },
         { "day":"30", "month":"10", "year":"1885", "text": "Ezra Pound, American poet who promoted Imagism, a poetic movement stressing free phrase rather than forced metric. He was imprisoned for his pro-Fascist radio broadcasts." },
         { "day":"30", "month":"10", "year":"1896", "text": "Ruth Gordon, Oscar, Emmy and Golden Globe–winning actress (Harold and Maude, Rosemary’s Baby)." },
         { "day":"30", "month":"10", "year":"1906", "text": "Hermann Fegelein, SS general of WWII who was brother-in-law to Adolf Hitler’s mistress Eva Braun." },
         { "day":"30", "month":"10", "year":"1915", "text": "Fred W. Friendly, president of CBS News and co-creator of the documentary series See It Now, the program largely credited for bringing down Sen. Joe McCarthy." },
         { "day":"30", "month":"10", "year":"1930", "text": "Clifford \"Brpwnie\" Brown, influential jazz trumpeter and composer (\"Joy Spring,\" \"Daahoud\")." },
         { "day":"30", "month":"10", "year":"1936", "text": "Dick Vermeil, head coach of the National Football League’s Philadelphia Eagles (1976–1982), St. Louis Rams (1997–1999), and Kansas City Chiefs (2001–2005)." },
         { "day":"30", "month":"10", "year":"1939", "text": "Grace Slick, singer, songwriter; lead singer for the bands The Great Society, Jefferson Airplane, Jefferson Starship and Starship." },
         { "day":"30", "month":"10", "year":"1945", "text": "Henry Winkler, actor, director, producer; rose to fame as \"The Fonz\" on Happy Days TV series, a role that twice earned him a Golden Globe for Best Actor in a Television Series Musical or Comedy." },
         { "day":"30", "month":"10", "year":"1970", "text": "Tory Belleci, filmmaker and model maker known for his work on the Mythbusters TV series; also worked on two Star Wars films." }
      ]
   }
]
