[
   {
      "facts":[
         { "day":"10", "month":"11", "year":"1493", "text": "Christopher Columbus discovers Antigua during his second expedition." },
         { "day":"10", "month":"11", "year":"1556", "text": "The Englishman Richard Chancellor is drowned off Aberdeenshire on his return from a second voyage to Russia." },
         { "day":"10", "month":"11", "year":"1647", "text": "All Dutch-held areas of New York are returned to English control by the treaty of Westminster." },
         { "day":"10", "month":"11", "year":"1775", "text": "U.S. Marine Corps founded." },
         { "day":"10", "month":"11", "year":"1782", "text": "In the last battle of the American Revolution, George Rogers Clark attacks Indians and Loyalists at Chillicothe, in Ohio Territory." },
         { "day":"10", "month":"11", "year":"1871", "text": "Henry M. Stanley finds Dr. Livingstone at Ujiji near Unyanyembe in Africa." },
         { "day":"10", "month":"11", "year":"1879", "text": "Little Bighorn participant Major Marcus Reno is caught window-peeping at the daughter of his commanding officer—an offense for which he will be courtmartialed." },
         { "day":"10", "month":"11", "year":"1911", "text": "President Taft ends a 15,000-mile, 57-day speaking tour." },
         { "day":"10", "month":"11", "year":"1911", "text": "The Imperial government of China retakes Nanking." },
         { "day":"10", "month":"11", "year":"1917", "text": "Forty-one US suffragettes are arrested protesting outside the White House." },
         { "day":"10", "month":"11", "year":"1938", "text": "Fascist Italy enacts anti-Semitic legislation." },
         { "day":"10", "month":"11", "year":"1941", "text": "Churchill promises to join the U.S. \"within the hour\" in the event of war with Japan." },
         { "day":"10", "month":"11", "year":"1942", "text": "Admiral Jean Darlan orders French forces in North Africa to cease resistance to the Anglo-American forces." },
         { "day":"10", "month":"11", "year":"1952", "text": "U.S. Supreme Court upholds the decision barring segregation on interstate railways." },
         { "day":"10", "month":"11", "year":"1961", "text": "Andrew Hatcher is named associate press secretary to President John F. Kennedy." },
         { "day":"10", "month":"11", "year":"1962", "text": "Eleanor Roosevelt is buried, she had died three days earlier." },
         { "day":"10", "month":"11", "year":"1964", "text": "Australia begins a draft to fulfill its commitment in Vietnam." },
         { "day":"10", "month":"11", "year":"1969", "text": "The PBS children’s program Sesame Street debuts." },
         { "day":"10", "month":"11", "year":"1971", "text": "Two women are tarred and feathered in Belfast for dating British soldiers, while in Londonderry, Northern Ireland a Catholic girl is also tarred and feathered for her intention of marrying a British soldier." },
         { "day":"10", "month":"11", "year":"1972", "text": "Hijackers divert a jet to Detroit, demanding $10 million and ten parachutes." },
         { "day":"10", "month":"11", "year":"1975", "text": "The iron ore freighter Edmund Fitzgerald breaks in half and sinks at the eastern end of Lake Superior–all 29 crew members perish." },
         { "day":"10", "month":"11", "year":"1986", "text": "President Ronald Reagan refuses to reveal details of the Iran arms sale." },
         { "day":"10", "month":"11", "year":"1989", "text": "German citizens begin tearing down the Berlin Wall." },
         { "day":"10", "month":"11", "year":"1997", "text": "WorldCom and MCI Communications announce a merger, the largest in US history up to that time." },
         { "day":"10", "month":"11", "year":"2008", "text": "NASA declares the Phoenix mission concluded after losing communications with the lander, five months after it began its exploration on the surface of Mars." },
         { "day":"10", "month":"11", "year":"2009", "text": "North Korean and South Korean ships skirmish off Daecheon Island." }
      ]
   }
]
