[
   {
      "facts":[
         { "day":"15", "month":"11", "year":"1315", "text": "Swiss soldiers ambush and slaughter invading Austrians in the battle of Morgarten." },
         { "day":"15", "month":"11", "year":"1533", "text": "The explorer Francisco Pizarro enters Cuzco, Peru." },
         { "day":"15", "month":"11", "year":"1626", "text": "The Pilgrim Fathers, who have settled in New Plymouth, buy out their London investors." },
         { "day":"15", "month":"11", "year":"1777", "text": "The Articles of Confederation, instituting perpetual union of the United States of America, are adopted by Congress." },
         { "day":"15", "month":"11", "year":"1805", "text": "Meriwether Lewis, William Clark and their party reach the mouth of the Columbia River, completing their trek to the Pacific." },
         { "day":"15", "month":"11", "year":"1806", "text": "Explorer Zebulon Pike discovers the Colorado Peak that bears his name, despite the fact that he didn’t climb it." },
         { "day":"15", "month":"11", "year":"1864", "text": "Union Major General William T. Sherman’s troops set fires that destroy much of Atlanta’s industrial district prior to beginning Sherman’s March to the Sea." },
         { "day":"15", "month":"11", "year":"1881", "text": "The American Federation of Labor is founded." },
         { "day":"15", "month":"11", "year":"1909", "text": "M. Metrot takes off in a Voisin biplane from Algiers, making the first manned flight in Africa." },
         { "day":"15", "month":"11", "year":"1917", "text": "Kerensky flees and Bolsheviks take command in Moscow." },
         { "day":"15", "month":"11", "year":"1920", "text": "Forty-one nations open the first League of Nations session in Geneva.." },
         { "day":"15", "month":"11", "year":"1922", "text": "It is announced that Dr. Alexis Carrel has discovered white corpuscles." },
         { "day":"15", "month":"11", "year":"1930", "text": "General strikes and riots paralyze Madrid, Spain." },
         { "day":"15", "month":"11", "year":"1937", "text": "Eighteen lawsuits are brought against the Tennessee Valley Authority, calling for its dissolution." },
         { "day":"15", "month":"11", "year":"1942", "text": "An American fleet defeats a Japanese naval force in a clash off Guadalcanal." },
         { "day":"15", "month":"11", "year":"1946", "text": "The 17th Paris Air Show opens at the Grand Palais des Champs-Elysees. It is the first show of this kind since World War II." },
         { "day":"15", "month":"11", "year":"1952", "text": "Newark Airport in New Jersey reopens after closing earlier in the year because of an increase in accidents." },
         { "day":"15", "month":"11", "year":"1957", "text": "Soviet Premier Nikita Khrushchev asserts Soviet superiority in missiles, challenging the United States to a rocket-range shooting match." },
         { "day":"15", "month":"11", "year":"1960", "text": "The first submarine with nuclear missiles, USS George Washington, takes to sea from Charleston, South Carolina." },
         { "day":"15", "month":"11", "year":"1962", "text": "Cuba threatens to down U.S. planes on reconnaissance flights over its territory." },
         { "day":"15", "month":"11", "year":"1963", "text": "Argentina voids all foreign oil contracts." },
         { "day":"15", "month":"11", "year":"1965", "text": "In the second day of combat, regiments of the 1st Cavalry Division battle on Landing Zones X-Ray against North Vietnamese forces in the Ia Drang Valley." },
         { "day":"15", "month":"11", "year":"1969", "text": "A quarter of a million anti-Vietnam War demonstrators march in Washington, D.C." },
         { "day":"15", "month":"11", "year":"1976", "text": "A Syrian peace force takes control of Beirut, Lebanon." },
         { "day":"15", "month":"11", "year":"1984", "text": "Baby Fae dies 20 days after receiving a baboon heart transplant in Loma Linda, California." },
         { "day":"15", "month":"11", "year":"1985", "text": "Anglo-Irish Agreement signed by British Prime Minister Margaret Thatcher and Irish Taoiseach Garret Fitzgerald." },
         { "day":"15", "month":"11", "year":"1988", "text": "Palestinian National Council proclaims an independent State of Palestine." },
         { "day":"15", "month":"11", "year":"1990", "text": "People’s Republic of Bulgaria replaced by a new republican government." },
         { "day":"15", "month":"11", "year":"2007", "text": "Cyclone Sidr strikes Bangladesh, killing an estimated 5,000 people." }
      ]
   }
]
