[
   {
      "facts":[
         { "day":"16", "month":"11", "year":"1798", "text": "British seamen board the U.S. frigate Baltimore and impress a number of crewmen as alleged deserters, a practice that contributed to the War of 1812." },
         { "day":"16", "month":"11", "year":"1813", "text": "The British announce a blockade of Long Island Sound, leaving only the New England coast open to shipping." },
         { "day":"16", "month":"11", "year":"1821", "text": "Trader William Becknell reaches Santa Fe, N.M., on the route that will become known as the Santa Fe Trail." },
         { "day":"16", "month":"11", "year":"1846", "text": "General Zachary Taylor takes Saltillo, Mexico." },
         { "day":"16", "month":"11", "year":"1864", "text": "Union General William T. Sherman departs Atlanta and begins his \"March to the Sea.\"" },
         { "day":"16", "month":"11", "year":"1892", "text": "King Behanzin of Dahomey (now Benin), leads soldiers against the French." },
         { "day":"16", "month":"11", "year":"1902", "text": "A cartoon appears in the Washington Star, prompting the Teddy Bear Craze, after President Teddy Roosevelt refused to kill a captive bear tied up for him to shoot during a hunting trip to Mississippi." },
         { "day":"16", "month":"11", "year":"1907", "text": "The Indian and Oklahoma territories are unified to make Oklahoma, which becomes the 46th state." },
         { "day":"16", "month":"11", "year":"1913", "text": "Swann’s Way, the first volume of Marcel Proust’s 7-part novel Remembrance of Things Past, is published." },
         { "day":"16", "month":"11", "year":"1920", "text": "Metered mail is born in Stamford, Connecticut with the first Pitney Bowes postage meter." },
         { "day":"16", "month":"11", "year":"1945", "text": "Eighty-eight German scientists, holding Nazi secrets, arrive in the United States." },
         { "day":"16", "month":"11", "year":"1948", "text": "President Harry S Truman rejects four-power talks on Berlin until the blockade is removed." },
         { "day":"16", "month":"11", "year":"1953", "text": "The United States joins in the condemnation of Israel for its raid on Jordan." },
         { "day":"16", "month":"11", "year":"1955", "text": "The Big Four talks, taking place in Geneva on German reunification, end in failure." },
         { "day":"16", "month":"11", "year":"1960", "text": "After the integration of two all-white schools, 2,000 whites riot in the streets of New Orleans." },
         { "day":"16", "month":"11", "year":"1965", "text": "In the last day of the fighting at Landing Zone X-Ray, regiments of the U.S. 1st Cavalry Division repulse NVA forces in the Ia Drang Valley." },
         { "day":"16", "month":"11", "year":"1967", "text": "U.S. planes hit Haiphong shipyard in North Vietnam for the first time." },
         { "day":"16", "month":"11", "year":"1979", "text": "American Airlines is fined $500,000 for improper DC-10 maintenance." },
         { "day":"16", "month":"11", "year":"1982", "text": "The space shuttle Columbia completes its first operational flight." },
         { "day":"16", "month":"11", "year":"1989", "text": "Salvadoran Army death squad kills six Jesuit priests and two others at Jose Simeon Canas University." },
         { "day":"16", "month":"11", "year":"1992", "text": "Eric Lawes, while using a metal detector to search for a friend’s lost hammer near Hoxne, Suffolk, England, discovers the Hoxne Hoard, the largest hoard of Roman silver and gold ever found in Britain, and the largest collection of 4th and 5th century coins found anywhere within the bounds of the former Roman Empire" },
         { "day":"16", "month":"11", "year":"1997", "text": "Pro-democracy Chinese dissident Wei Jingsheng released from prison after 18 years, for health reasons." }
      ]
   }
]
