[
   {
      "facts":[
         { "day":"21", "month":"11", "year":"1620", "tet": "Leaders of the Mayflower expedition frame the \"Mayflower Compact,\" designed to bolster unity among the settlers." },
         { "day":"21", "month":"11", "year":"1783", "tet": "Jean de Rozier and the Marquis d’Arlandes make the first free-flight ascent in a balloon to over 500 feet in Paris." },
         { "day":"21", "month":"11", "year":"1789", "tet": "North Carolina ratifies the Constitution, becoming the 12th state to do it." },
         { "day":"21", "month":"11", "year":"1855", "tet": "Franklin Colman, a pro-slavery Missourian, guns down Charles Dow, a Free Stater from Ohio, near Lawrence, Kansas." },
         { "day":"21", "month":"11", "year":"1864", "tet": "From Georgia, Confederate General John B. Hood launches the Franklin-Nashville Campaign into Tennessee." },
         { "day":"21", "month":"11", "year":"1904", "tet": "Motorized omnibuses replace horse-drawn cars in Paris." },
         { "day":"21", "month":"11", "year":"1906", "tet": "In San Juan, President Theodore Roosevelt pledges citizenship for Puerto Rican people." },
         { "day":"21", "month":"11", "year":"1907", "tet": "Cunard liner Mauritania sets a new speed record for steamship travel, 624 nautical miles in a one day run." },
         { "day":"21", "month":"11", "year":"1911", "tet": "Suffragettes storm Parliament in London. All are arrested and all choose prison terms." },
         { "day":"21", "month":"11", "year":"1917", "tet": "German ace Rudolf von Eschwege is killed over Macedonia when he attacks a booby-trapped observation balloon packed with explosives." },
         { "day":"21", "month":"11", "year":"1918", "tet": "The last German troops leave Alsace-Lorraine, France." },
         { "day":"21", "month":"11", "year":"1927", "tet": "Police turn machine guns on striking Colorado mine workers, killing five and wounding 20." },
         { "day":"21", "month":"11", "year":"1934", "tet": "A New York court rules Gloria Vanderbilt unfit for custody of her daughter." },
         { "day":"21", "month":"11", "year":"1934", "tet": "Cole Porter’s musical Anything Goes premieres at New York’s Alvin Theatre." },
         { "day":"21", "month":"11", "year":"1949", "tet": "The United Nations grants Libya its independence by 1952." },
         { "day":"21", "month":"11", "year":"1967", "tet": "President Lyndon B. Johnson signs the air quality act, allotting $428 million for the fight against pollution." },
         { "day":"21", "month":"11", "year":"1970", "tet": "U.S. planes conduct widespread bombing raids in North Vietnam." },
         { "day":"21", "month":"11", "year":"1985", "tet": "US Navy intelligence analyst Jonathan Pollard arrested for spying and passing classified information to Israel; he received a life sentence on Nov. 1, 1987." },
         { "day":"21", "month":"11", "year":"1986", "tet": "The Justice Department begins an inquiry into the National Security Council into what will become known as the Iran-Contra scandal." },
         { "day":"21", "month":"11", "year":"1995", "tet": "The Dayton Peace Agreement is initialed at Wright Patterson Air Force Base near Dayton, Ohio; the agreement, formally ratified in Paris on Dec. 14, ends the three-and-a-half year war between Bosnia and Herzegovina." },
         { "day":"21", "month":"11", "year":"2006", "tet": "Anti-Syrian Lebanese Minister and MP Pierre Gemayel assassinated in Beirut." }
      ]
   }
]
