[
   {
      "facts":[
         { "day":"22", "month":"11", "year":"1220", "text": "After promising to go to the aid of the Fifth Crusade within nine months, Frederick II is crowned emperor by Pope Honorius III." },
         { "day":"22", "month":"11", "year":"1542", "text": "New laws are passed in Spain giving Indians in America protection against enslavement." },
         { "day":"22", "month":"11", "year":"1757", "text": "The Austrian army defeats the Prussians at Breslau in the Seven Years War." },
         { "day":"22", "month":"11", "year":"1847", "text": "In New York, the Astor Place Opera House, the city’s first operatic theater, is opened." },
         { "day":"22", "month":"11", "year":"1902", "text": "A fire causes considerable damage to the unfinished Williamsburg bridge in New York." },
         { "day":"22", "month":"11", "year":"1915", "text": "The Anglo-Indian army, led by British General Sir Charles Townshend, attacks a larger Turkish force under General Nur-ud-Din at Ctesiphon, Iraq, but is repulsed." },
         { "day":"22", "month":"11", "year":"1919", "text": "A Labor conference committee in the United States urges an eight-hour workday and a 48-hour week." },
         { "day":"22", "month":"11", "year":"1928", "text": "British King George is confined to bed with a congested lung; the queen is to take over duties." },
         { "day":"22", "month":"11", "year":"1935", "text": "Pan Am inaugurates the first transpacific airmail service from San Francisco to Manila." },
         { "day":"22", "month":"11", "year":"1936", "text": "1,200 soldiers are killed in a battle between the Japanese and Mongolians in China." },
         { "day":"22", "month":"11", "year":"1942", "text": "Soviet troops complete the encirclement of the German Sixth Army at Stalingrad." },
         { "day":"22", "month":"11", "year":"1948", "text": "Ho Chi Minh’s Democratic Republic of Vietnam requests admittance to the UN." },
         { "day":"22", "month":"11", "year":"1963", "text": "Lee Harvey Oswald assassinates President John F. Kennedy in Dallas, Texas. Lyndon B. Johnson becomes president." },
         { "day":"22", "month":"11", "year":"1964", "text": "Almost 40,000 people pay tribute to John F. Kennedy at Arlington Cemetery on the first anniversary of his death." },
         { "day":"22", "month":"11", "year":"1973", "text": "Great Britain announces a plan for moderate Protestants and Catholics to share power in Northern Ireland." },
         { "day":"22", "month":"11", "year":"1980", "text": "Eighteen Communist Party secretaries in 49 provinces are ousted from Poland." },
         { "day":"22", "month":"11", "year":"1982", "text": "President Ronald Reagan calls for defense-pact deployment of the MX missile." },
         { "day":"22", "month":"11", "year":"1986", "text": "Justice Department finds memo in Lt. Col. Oliver North’s office on the transfer of $12 million to Contras of Nicaragua from Iranian arms sale." },
         { "day":"22", "month":"11", "year":"1988", "text": "First prototype of B-2 Spirit strategic stealth bomber unveiled for public viewing." },
         { "day":"22", "month":"11", "year":"1989", "text": "Lebanese President Rene Moawad killed when a bomb explodes near his motorcade in West Beirut." },
         { "day":"22", "month":"11", "year":"1990", "text": "Britain’s Prime Minister Margaret Thatcher confirms the end of her premiership by withdrawing from the leadership election of the Conservative Party." },
         { "day":"22", "month":"11", "year":"1995", "text": "The first feature-length film created entirely with computer generated imagery – Toy Story – premiers." },
         { "day":"22", "month":"11", "year":"2004", "text": "The Orange Revolution, protesting a primary election believed to have been rigged, begins in the Ukraine. On Dec 26 Ukraine’s Supreme Court orders a revote.." },
         { "day":"22", "month":"11", "year":"2005", "text": "Angela Merkel becomes the first woman ever to be Chancellor of Germany; the former research scientist had previously been the first secretary-general of the Christian Democratic Union." },
         { "day":"22", "month":"11", "year":"2008", "text": "Hamas and Israel begin a cease-fire following eight days of violence and 150 deaths." }
      ]
   }
]
