[
   {
      "facts":[
         { "day":"25", "month":"11", "year":"2348 BC", "text": "Biblical scholars have long asserted this to be the day of the Great Deluge, or Flood." },
         { "day":"25", "month":"11", "year":"1863", "text": "Union ends the siege of Chattanooga with the Battle of Missionary Ridge." },
         { "day":"25", "month":"11", "year":"1876", "text": "Colonel Ronald MacKenzie destroys Cheyenne Chief Dull Knife‘s village, in the Bighorn Mountains near the Red Fork of the Powder River, during the so-called Great Sioux War." },
         { "day":"25", "month":"11", "year":"1901", "text": "Japanese Prince Ito arrives in Russia to seek concessions in Korea." },
         { "day":"25", "month":"11", "year":"1914", "text": "German Field Marshal Fredrich von Hindenburg calls off the Lodz offensive 40 miles from Warsaw, Poland. The Russians lose 90,000 to the Germans’ 35,000 in two weeks of fighting." },
         { "day":"25", "month":"11", "year":"1918", "text": "Chile and Peru sever relations." },
         { "day":"25", "month":"11", "year":"1921", "text": "Hirohito becomes regent of Japan." },
         { "day":"25", "month":"11", "year":"1923", "text": "Transatlantic broadcasting from England to America commences for the first time." },
         { "day":"25", "month":"11", "year":"1930", "text": "An earthquake in Shizouka, Japan kills 187 people." },
         { "day":"25", "month":"11", "year":"1939", "text": "Germany reports four British ships sunk in the North Sea, but London denies the claim." },
         { "day":"25", "month":"11", "year":"1946", "text": "The U.S. Supreme Court grants the Oregon Indians land payment rights from the U.S. government." },
         { "day":"25", "month":"11", "year":"1947", "text": "The Big Four meet to discuss the German and European economy." },
         { "day":"25", "month":"11", "year":"1951", "text": "A truce line between U.N. troops and North Korea is mapped out at the peace talks in Panmunjom, Korea." },
         { "day":"25", "month":"11", "year":"1955", "text": "The Interstate Commerce Commission bans segregation in interstate travel." },
         { "day":"25", "month":"11", "year":"1963", "text": "The body of assassinated President John F. Kennedy is buried at Arlington National Cemetery." },
         { "day":"25", "month":"11", "year":"1964", "text": "Eleven nations give a total of $3 billion to rescue the value of the British currency." },
         { "day":"25", "month":"11", "year":"1986", "text": "As President Ronald Reagan announces the Justice Department’s findings concerning the Iran-Contra affair; secretary Fawn Hall smuggles important documents out of Lt. Col. Oliver North’s office." },
         { "day":"25", "month":"11", "year":"1987", "text": "Typhoon Nina sticks the Philippines with 165 mph winds and a devastating storm surge and causes over 1,030 deaths." },
         { "day":"25", "month":"11", "year":"1992", "text": "Federal Assembly of Czechoslovakia votes to partition the country into the Czech Republic and Slovakia, beginning Jan. 1, 1993." },
         { "day":"25", "month":"11", "year":"2008", "text": "Sri Lanka is hit by Cyclone Nisha, bringing the highest rainfall the area had seen in 9 decades; 15 people die, 90,000 are left homeless." }
      ]
   }
]
