[
   {
      "facts":[
         { "day":"29", "month":"11", "year":"1760", "text":"Major Roger Rogers takes possession of Detroit on behalf of Britain." },
         { "day":"29", "month":"11", "year":"1787", "text":"Louis XVI promulgates an edict of tolerance, granting civil status to Protestants." },
         { "day":"29", "month":"11", "year":"1812", "text":"The last elements of Napoleon Bonaparte’s Grand Armee retreats across the Beresina River in Russia." },
         { "day":"29", "month":"11", "year":"1863", "text":"The Battle of Fort Sanders, Knoxville, Tenn., ends with a Confederate withdrawal." },
         { "day":"29", "month":"11", "year":"1864", "text":"Colonel John M. Chivington’s 3rd Colorado Volunteers massacre Black Kettles’ camp of Cheyenne and Arapahoe Indians at Sand Creek, Colo." },
         { "day":"29", "month":"11", "year":"1903", "text":"An Inquiry into the U.S. Postal Service demonstrates the government has lost millions in fraud." },
         { "day":"29", "month":"11", "year":"1923", "text":"An international commission headed by American banker Charles Dawes is set up to investigate the German economy." },
         { "day":"29", "month":"11", "year":"1929", "text":"Commander Richard Byrd makes the first flight over the South Pole." },
         { "day":"29", "month":"11", "year":"1931", "text":"The Spanish government seizes large estates for land redistribution." },
         { "day":"29", "month":"11", "year":"1939", "text":"Soviet planes bomb an airfield at Helsinki, Finland." },
         { "day":"29", "month":"11", "year":"1948", "text":"The Metropolitan Opera is televised for the first time as the season opens with \"Othello.\"" },
         { "day":"29", "month":"11", "year":"1948", "text":"The popular children’s television show, Kukla, Fran and Ollie, premieres." },
         { "day":"29", "month":"11", "year":"1949", "text":"The United States announces it will conduct atomic tests at Eniwetok Atoll in the Pacific." },
         { "day":"29", "month":"11", "year":"1961", "text":"NASA launches a chimpanzee named Enos into Earth orbit." },
         { "day":"29", "month":"11", "year":"1962", "text":"Algeria bans the Communist Party." },
         { "day":"29", "month":"11", "year":"1963", "text":"President Lyndon B. Johnson appoints Chief Justice Earl Warren head of a commission to investigate the assassination of President John F. Kennedy." },
         { "day":"29", "month":"11", "year":"1967", "text":"US Secretary of Defense Robert McNamara announces his resignation." },
         { "day":"29", "month":"11", "year":"1972", "text":"Atari announces the release of Pong, the first commercially successful video game." },
         { "day":"29", "month":"11", "year":"2007", "text":"Armed forces of the Philippines besiege The Peninsula Manila in response to a mutiny led by Senator Antonio Trillanes." },
      ]
   }
]
