[
   {
      "facts":[
         { "day":"5", "month":"11", "year":"1219", "text": "The port of Damietta falls to the Crusaders after a siege." },
         { "day":"5", "month":"11", "year":"1556", "text": "The Emperor Akbar defeats the Hindus at Panipat and secures control of the Mogul Empire." },
         { "day":"5", "month":"11", "year":"1605", "text": "Guy Fawkes is betrayed and arrested in an attempt to blow up the British Parliament in the \"Gunpowder Plot.\" Ever since, England has celebrated Guy Fawkes Day." },
         { "day":"5", "month":"11", "year":"1653", "text": "The Iroquois League signs a peace treaty with the French, vowing not to wage war with other tribes under French protection." },
         { "day":"5", "month":"11", "year":"1757", "text": "Frederick II of Prussia defeats the French at Rosbach in the Seven Years War." },
         { "day":"5", "month":"11", "year":"1768", "text": "William Johnson, the northern Indian Commissioner, signs a treaty with the Iroquois Indians to acquire much of the land between the Tennessee and Ohio rivers for future settlement." },
         { "day":"5", "month":"11", "year":"1814", "text": "Having decided to abandon the Niagara frontier, the American army blows up Fort Erie." },
         { "day":"5", "month":"11", "year":"1840", "text": "Afghanistan surrenders to the British army." },
         { "day":"5", "month":"11", "year":"1854", "text": "British and French defeat the Russians at Inkerman, Crimea." },
         { "day":"5", "month":"11", "year":"1862", "text": "President Abraham Lincoln relieves General George McClellan of command of the Union armies and names Maj. Gen. Ambrose Burnside commander of the Army of the Potomac." },
         { "day":"5", "month":"11", "year":"1872", "text": "Susan B. Anthony is arrested for trying to vote." },
         { "day":"5", "month":"11", "year":"1911", "text": "Calbraith P. Rodgers ends first transcontinental flight–49 days from New York to Pasadena, Calif." },
         { "day":"5", "month":"11", "year":"1912", "text": "Woodrow Wilson is elected 28th president of the United States." },
         { "day":"5", "month":"11", "year":"1914", "text": "France and Great Britain declare war on Turkey." },
         { "day":"5", "month":"11", "year":"1917", "text": "General John Pershing leads U.S. troops into the first American action against German forces." },
         { "day":"5", "month":"11", "year":"1930", "text": "Sinclair Lewis becomes the first American to win a Nobel Prize in Literature for his novel Babbit." },
         { "day":"5", "month":"11", "year":"1935", "text": "Parker Brothers company launches \"Monopoly,\" a game of real estate and capitalism." },
         { "day":"5", "month":"11", "year":"1940", "text": "President Franklin D. Roosevelt is re-elected for third term." },
         { "day":"5", "month":"11", "year":"1968", "text": "Richard Nixon is elected 37th president of the United States." },
         { "day":"5", "month":"11", "year":"1968", "text": "Shirley Chisholm of Brooklyn, New York, becomes the first elected African American woman to serve in the House of Representatives." },
         { "day":"5", "month":"11", "year":"1995", "text": "Andre Dallaire’s attempt to assassinate Canadian Prime Minister Jean Chretien is foiled when the minister’s wife locks the door." },
         { "day":"5", "month":"11", "year":"2003", "text": "Gary Ridgway, known as the Green River Killer, pleads guilty to 48 counts of murder." },
         { "day":"5", "month":"11", "year":"2006", "text": "Former president of Iraq Saddam Hussein, along with Barzan Ibrahim al-Tikriti and Awad Hamed al-Bandar, is sentenced to death for the massacre of 148 Shi’a Muslims in 1982." },
         { "day":"5", "month":"11", "year":"2007", "text": "Chang’e 1, China’s first lunar satellite, begins its orbit of the moon." },
         { "day":"5", "month":"11", "year":"2009", "text": "The deadliest mass shooting at a US military installation occurs at Fort Hood, Texas, when US Army Major Nidal Malik Hasan kills 13 and wounds 29." }
      ]
   }
]
