[
   {
      "facts":[
         { "day":"7", "month":"11", "year":"1665", "text": "The London Gazette, the oldest surviving journal, is first published." },
         { "day":"7", "month":"11", "year":"1811", "text": "Rebellious Indians in a conspiracy organized in defiance of the United States government by Tecumseh, Shawnee chief, are defeated during his absence in the Battle of the Wabash (or Tippecanoe) by William Henry Harrison, governor of Indiana Territory." },
         { "day":"7", "month":"11", "year":"1814", "text": "Andrew Jackson attacks and captures Pensacola, Florida, defeating the Spanish and driving out a British force." },
         { "day":"7", "month":"11", "year":"1846", "text": "Zachary Taylor, one of the heroes of the Mexican War, is elected president." },
         { "day":"7", "month":"11", "year":"1861", "text": "Union General Ulysses S. Grant launches an unsuccessful raid on Belmont, Missouri." },
         { "day":"7", "month":"11", "year":"1876", "text": "Rutherford B. Hayes is elected 19th president of the United States." },
         { "day":"7", "month":"11", "year":"1881", "text": "Wyatt Earp and Doc Holliday, two participants in Tombstone, Arizona’s, famous Gunfight at the O.K. Corral, are jailed as the hearings on what happened in the fight grow near." },
         { "day":"7", "month":"11", "year":"1916", "text": "President Woodrow Wilson is re-elected, but the race is so close that all votes must be counted before an outcome can be determined, so the results are not known until November 11." },
         { "day":"7", "month":"11", "year":"1916", "text": "Jeannette Rankin (R-Montana) is elected the first congresswoman." },
         { "day":"7", "month":"11", "year":"1917", "text": "British General Sir Edmond Allenby breaks the Turkish defensive line in the Third Battle of Gaza." },
         { "day":"7", "month":"11", "year":"1917", "text": "The Bolsheviks, led by Lenin, take power in Russia." },
         { "day":"7", "month":"11", "year":"1921", "text": "Benito Mussolini declares himself to be leader of the National Fascist Party in Italy." },
         { "day":"7", "month":"11", "year":"1940", "text": "Tacoma Bridge in Washington State collapses." },
         { "day":"7", "month":"11", "year":"1943", "text": "British troops launch a limited offensive along the coast of Burma." },
         { "day":"7", "month":"11", "year":"1944", "text": "President Franklin D. Roosevelt is elected to a fourth term by defeating Thomas Dewey." },
         { "day":"7", "month":"11", "year":"1956", "text": "UN General Assembly calls for France, Israel and the UK to immediately withdraw their troops from Egypt." },
         { "day":"7", "month":"11", "year":"1967", "text": "In Cleveland, Ohio, Carl B. Stokes becomes the first African American elected mayor of a major American city." },
         { "day":"7", "month":"11", "year":"1967", "text": "President Lyndon B. Johnson signs a bill establishing the Corporation for Public Broadcasting." },
         { "day":"7", "month":"11", "year":"1972", "text": "President Richard Nixon is re-elected." },
         { "day":"7", "month":"11", "year":"1973", "text": "Congress overrides Pres. Richard M. Nixon’s veto of the War Powers Resolution that limited presidential power to wage ware without congressional approval." },
         { "day":"7", "month":"11", "year":"1975", "text": "A uprising in Bangladesh kills Brig. Gen. Khaled Mosharraf and frees Maj. Gen. Ziaur Rahman, future president of the country, from house arrest." },
         { "day":"7", "month":"11", "year":"1983", "text": "A bomb explodes in the US Capitol’s Senate Chambers area, causing $250,000 damages but no one is harmed; a group calling itself the Armed Resistance Unit claimed the bomb was retaliation for US military involvement in Grenada and Lebanon." },
         { "day":"7", "month":"11", "year":"1989", "text": "Douglas Wilder wins Virginia’s gubernatorial election, becoming the first elected African American governor in the US; during Reconstruction Mississippi had an acting governor and Louisiana had an appointed governor who were black." },
         { "day":"7", "month":"11", "year":"1990", "text": "Mary Robinson becomes the first woman elected President of the Republic of Ireland." },
         { "day":"7", "month":"11", "year":"1994", "text": "The world’s first internet radio broadcast originates from WXYC, the student radio station of the University of North Carolina at Chapel Hill." },
         { "day":"7", "month":"11", "year":"2000", "text": "Hilary Rodham Clinton becomes the first First Lady (1993–2001) elected to public office in the US when she wins a US Senate seat." },
         { "day":"7", "month":"11", "year":"2000", "text": "Election Day in the US ends with the winner between presidential candidates George W. Bush and Al Gore still undecided." }
      ]
   }
]
