[
   {
      "facts":[
         { "day":"8", "month":"11", "year":"392	", "text": 	"Theodosius of Rome passes legislation prohibiting all pagan worship in the empire." },
         { "day":"8", "month":"11", "year":"1226", "text":	"Louis IX succeeds Louis VIII as king of France." },
         { "day":"8", "month":"11", "year":"1576", "text":	"The 17 provinces of the Netherlands form a federation to maintain peace." },
         { "day":"8", "month":"11", "year":"1620", "text":	"The King of Bohemia is defeated at the Battle of Prague." },
         { "day":"8", "month":"11", "year":"1685", "text":	"Fredrick William of Brandenburg issues the Edict of Potsdam, offering Huguenots refuge." },
         { "day":"8", "month":"11", "year":"1793", "text":	"The Louvre opens in Paris. But wasn’t it already a Palace and it merely opens to the people?" },
         { "day":"8", "month":"11", "year":"1861", "text":	"Charles Wilkes seizes Confederate commissioners John Slidell and James M. Mason from the British ship Trent." },
         { "day":"8", "month":"11", "year":"1864", "text":	"President Abraham Lincoln is re-elected in the first wartime election in the United States." },
         { "day":"8", "month":"11", "year":"1887", "text":	"Doc Holliday, who fought on the side of the Earp brothers during the Gunfight at the O.K. Corral 6 years earlier, dies of tuberculosis in Glenwood Springs, Colorado." },
         { "day":"8", "month":"11", "year":"1889", "text":	"Montana becomes the 41st state of the Union." },
         { "day":"8", "month":"11", "year":"1900", "text":	"Theodore Dresier’s first novel Sister Carrie is published by Doubleday, but is recalled from stores shortly due to public sentiment." },
         { "day":"8", "month":"11", "year":"1904", "text":	"President Theodore Roosevelt is elected president of the United States. He had been vice president until the shooting death of President William McKinley." },
         { "day":"8", "month":"11", "year":"1910", "text":	"The Democrats prevail in congressional elections for the first time since 1894." },
         { "day":"8", "month":"11", "year":"1923", "text":	"Adolf Hitler attempts a coup in Munich, the \"Beer Hall Putsch,\" and proclaims himself chancellor and Ludendorff dictator. ." },
         { "day":"8", "month":"11", "year":"1932", "text":	"Franklin D. Roosevelt is elected 32nd president of the United States." },
         { "day":"8", "month":"11", "year":"1938", "text":	"Crystla Bird Fauset of Pennsylvania, becomes the first African-American woman to be elected to a state legislature." },
         { "day":"8", "month":"11", "year":"1942", "text":	"The United States and Great Britain invade Axis-occupied North Africa." },
         { "day":"8", "month":"11", "year":"1960", "text":	"John F. Kennedy is elected 35th president, defeating Republican candidate Richard Nixon in the closest election, by popular vote, since 1880." },
         { "day":"8", "month":"11", "year":"1965", "text":	"Vietnam War, Operation Hump: US 173rd Airborne Brigade Combat Team ambushed by over 1,200 Viet Cong in Bien Hoa Province. Nearby, in the Gang Toi Hills, a company of the Royal Australian Regiment also engaged Viet Cong forces." },
         { "day":"8", "month":"11", "year":"1966", "text":	"Republican Edward Brooke of Massachusetts becomes the first African American elected to the Senate in 85 years." },
         { "day":"8", "month":"11", "year":"1977", "text":	"Greek archaeologist Manolis Andronikos discovers what is believed to be the tomb of Philip II of Macedon at Vergina in northern Greece." },
         { "day":"8", "month":"11", "year":"1983", "text":	"Wilson B. Goode is elected as the first black mayor of the city of Philadelphia." },
         { "day":"8", "month":"11", "year":"1987", "text":	"A dozen people are killed and over 60 wounded when the IRA detonates a bomb during a Remembrance Day ceremony in Enniskillen, Northern Ireland, honoring those who had died in wars involving British forces." },
         { "day":"8", "month":"11", "year":"2000", "text":	"Dispute begins over US presidential election between George W. Bush and Al Gore; Supreme Court ruling on Dec. 12 results in a 271-266 electoral victory for Bush." },
         { "day":"8", "month":"11", "year":"2004", "text":	"More than 10,000 US troops and a few Iraqi army units besiege an insurgent stronghold at Fallujah." },
         { "day":"8", "month":"11", "year":"2013", "text":	"Super Typhoon Haiyan, one of the strongest storms ever recorded, slams into the Philippines, with sustained winds of 195 mpg (315 kph) and gusts up to 235 mph (380 kph); over 5,000 are killed (date is Nov 7 in US)." }
      ]
   }
]
