[
   {
      "facts":[
         { "day":"21", "month":"2", "year": "1595", "text": "The Jesuit poet Robert Southwell is hanged for \"treason\" being a Catholic." },
         { "day":"21", "month":"2", "year": "1631", "text": "Michael Romanov, son of the Patriarch of Moscow, is elected Russian Tsar." },
         { "day":"21", "month":"2", "year": "1744", "text": "The British blockade of Toulon is broken by 27 French and Spanish warships attacking 29 British ships." },
         { "day":"21", "month":"2", "year": "1775", "text": "As troubles with Great Britain increase, colonists in Massachusetts vote to buy military equipment for 15,000 men." },
         { "day":"21", "month":"2", "year": "1797", "text": "Trinidad, West Indies surrenders to the British." },
         { "day":"21", "month":"2", "year": "1828", "text": "The first issue of the Cherokee Phoenix is printed, both in English and in the newly invented Cherokee alphabet." },
         { "day":"21", "month":"2", "year": "1849", "text": "In the Second Sikh War, Sir Hugh Gough’s well placed guns win a victory over a Sikh force twice the size of his at Gujerat on the Chenab River, assuring British control of the Punjab for years to come." },
         { "day":"21", "month":"2", "year": "1862", "text": "The Texas Rangers win a Confederate victory in the Battle of Val Verde, New Mexico." },
         { "day":"21", "month":"2", "year": "1878", "text": "The world’s first telephone book is issued by the New Haven Connecticut Telephone Company containing the names of its 50 subscribers." },
         { "day":"21", "month":"2", "year": "1885", "text": "The Washington Monument is dedicated in Washington, D.C." },
         { "day":"21", "month":"2", "year": "1905", "text": "The Mukden campaign of the Russo-Japanese War, begins." },
         { "day":"21", "month":"2", "year": "1916", "text": "The battle of Verdun begins with an unprecedented German artillery barrage of the French lines." },
         { "day":"21", "month":"2", "year": "1940", "text": "The Germans begin construction of a concentration camp at Auschwitz." },
         { "day":"21", "month":"2", "year": "1944", "text": "Hideki Tojo becomes chief of staff of the Japanese army." },
         { "day":"21", "month":"2", "year": "1949", "text": "Nicaragua and Costa Rica sign a friendship treaty ending hostilities over their borders." },
         { "day":"21", "month":"2", "year": "1951", "text": "The U. S. Eighth Army launches Operation Killer, a counterattack to push Chinese forces north of the Han River in Korea." },
         { "day":"21", "month":"2", "year": "1956", "text": "A grand jury in Montgomery, Alabama indicts 115 in a Negro bus boycott." },
         { "day":"21", "month":"2", "year": "1960", "text": "Havana places all Cuban industry under direct control of the government." },
         { "day":"21", "month":"2", "year": "1965", "text": "El-Hajj Malik El-Shabazz (Malcom X) is assassinated in front of 400 people." },
         { "day":"21", "month":"2", "year": "1972", "text": "Richard Nixon arrives in Beijing, China, becoming the first U.S. president to visit a country not diplomatically recognized by the U.S." },
         { "day":"21", "month":"2", "year": "1974", "text": "A report claims that the use of defoliants by the U.S. has scarred Vietnam for a century." }
      ]
   }
]
