[
   {
      "facts":[
         { "day":"23", "month":"2", "year": "303", "text":  "Emperor Diocletian orders the general persecution of Christians in Rome." },
         { "day":"23", "month":"2", "year": "1516", "text": "The Hapsburg Charles I succeeds Ferdinand in Spain." },
         { "day":"23", "month":"2", "year": "1540", "text": "Spanish explorer Francisco Vasquez de Coronado begins his unsuccessful search for the fabled Seven Cities of Gold in the American Southwest." },
         { "day":"23", "month":"2", "year": "1574", "text": "The 5th War of Religion breaks out in France." },
         { "day":"23", "month":"2", "year": "1615", "text": "The Estates-General in Paris is dissolved, having been in session since October 1614." },
         { "day":"23", "month":"2", "year": "1778", "text": "Baron von Steuben joins the Continental Army at Valley Forge." },
         { "day":"23", "month":"2", "year": "1821", "text": "Poet John Keats dies of tuberculosis at the age of 25." },
         { "day":"23", "month":"2", "year": "1836", "text": "The Alamo is besieged by Santa Anna." },
         { "day":"23", "month":"2", "year": "1846", "text": "The Liberty Bell tolls for the last time, to mark George Washington’s birthday." },
         { "day":"23", "month":"2", "year": "1847", "text": "Forces led by Zachary Taylor defeat the Mexicans at the Battle of Buena Vista." },
         { "day":"23", "month":"2", "year": "1854", "text": "Great Britain officially recognizes the independence of the Orange Free State." },
         { "day":"23", "month":"2", "year": "1861", "text": "Texas becomes the seventh state to secede from the Union." },
         { "day":"23", "month":"2", "year": "1885", "text": "John Lee survives three attempts to hang him in Exeter Prison, as the trap fails to open." },
         { "day":"23", "month":"2", "year": "1898", "text": "Writer Emile Zola is imprisoned in France for his letter J’accuse in which he accuses the French government of anti-semitism and the wrongful imprisonment of army captain Alfred Dreyfus." },
         { "day":"23", "month":"2", "year": "1901", "text": "Britain and Germany agree on a boundary between German East Africa and Nyasaland." },
         { "day":"23", "month":"2", "year": "1904", "text": "Japan guarantees Korean sovereignty in exchange for military assistance." },
         { "day":"23", "month":"2", "year": "1916", "text": "Secretary of State Lansing hints that the U.S. may have to abandon the policy of avoiding \"entangling foreign alliances\"." },
         { "day":"23", "month":"2", "year": "1921", "text": "An airmail plane sets a record of 33 hours and 20 minutes from San Francisco to New York." },
         { "day":"23", "month":"2", "year": "1926", "text": "President Calvin Coolidge opposes a large air force, believing it would be a menace to world peace." },
         { "day":"23", "month":"2", "year": "1936", "text": "In Russia, an unmanned balloon rises to a record height of 25 miles." },
         { "day":"23", "month":"2", "year": "1938", "text": "Twelve Chinese fighter planes drop bombs on Japan." },
         { "day":"23", "month":"2", "year": "1942", "text": "A Japanese submarine shells an oil refinery near Santa Barbara, California, the first Axis bombs to hit American soil." },
         { "day":"23", "month":"2", "year": "1944", "text": "American bombers strike the Marianas Islands bases, only 1,300 miles from Tokyo." },
         { "day":"23", "month":"2", "year": "1945", "text": "Eisenhower opens a large offensive in the Rhineland." },
         { "day":"23", "month":"2", "year": "1945", "text": "U.S. Marines plant an American flag atop Mount Suribachi on Iwo Jima." },
         { "day":"23", "month":"2", "year": "1946", "text": "Japanese General Tomoyuki Yamashita is hanged in Manila, the Philippines, for war crimes." },
         { "day":"23", "month":"2", "year": "1947", "text": "Several hundred Nazi organizers are arrested in Frankfurt by U.S. and British forces." },
         { "day":"23", "month":"2", "year": "1950", "text": "New York’s Metropolitan Museum exhibits a collection of Hapsburg art. The first showing of this collection in the U.S." },
         { "day":"23", "month":"2", "year": "1954", "text": "Mass innoculation begins as Salk’s polio vaccine is given to children for first time." },
         { "day":"23", "month":"2", "year": "1955", "text": "Eight nations meet in Bangkok for the first SEATO council." },
         { "day":"23", "month":"2", "year": "1960", "text": "Whites join Negro students in a sit-in at a Winston-Salem, N.C. Woolworth store." },
         { "day":"23", "month":"2", "year": "1964", "text": "The U.S. and Britain recognize the new Zanzibar government." },
         { "day":"23", "month":"2", "year": "1967", "text": "American troops begin the largest offensive of the war, near the Cambodian border." },
         { "day":"23", "month":"2", "year": "1972", "text": "Black activist Angela Davis is released from jail where she was held for kidnapping , conspiracy and murder." },
         { "day":"23", "month":"2", "year": "1991", "text": "French forces unofficially start the Persian Gulf ground war by crossing the Saudi-Iraqi border." }
      ]
   }
]
