[
   {
      "facts":[
         { "day":"27", "month":"2", "year": "425",  "text":  "Theodosius effectively founds a university in Constantinople." },
         { "day":"27", "month":"2", "year": "1531", "text": "German Protestants form the League of Schmalkalden to resist the power of the emperor." },
         { "day":"27", "month":"2", "year": "1700", "text": "The Pacific Island of New Britain is discovered." },
         { "day":"27", "month":"2", "year": "1814", "text": "Napoleon’s Marshal Nicholas Oudinot is pushed back at Barsur-Aube by the Emperor’s allied enemies shortly before his abdication." },
         { "day":"27", "month":"2", "year": "1827", "text": "The first Mardi-Gras celebration is held in New Orleans." },
         { "day":"27", "month":"2", "year": "1864", "text": "The first Union prisoners arrive at Andersonville Prison in Georgia." },
         { "day":"27", "month":"2", "year": "1865", "text": "Confederate raider William Quantrill and his bushwackers attack Hickman, Kentucky, shooting women and children." },
         { "day":"27", "month":"2", "year": "1905", "text": "The Japanese push Russians back in Manchuria and cross the Sha River." },
         { "day":"27", "month":"2", "year": "1908", "text": "The forty-sixth star is added to the U.S. flag, signifying Oklahoma’s admission to statehood." },
         { "day":"27", "month":"2", "year": "1920", "text": "The United States rejects a Soviet peace offer as propaganda." },
         { "day":"27", "month":"2", "year": "1925", "text": "Glacier Bay National Monument is dedicated in Alaska." },
         { "day":"27", "month":"2", "year": "1933", "text": "The burning down of the Reichstag building in Berlin gives the Nazis the opportunity to suspend personal liberty with increased power." },
         { "day":"27", "month":"2", "year": "1939", "text": "The Supreme Court outlaws sit-down strikes." },
         { "day":"27", "month":"2", "year": "1942", "text": "British Commandos raid a German radar station at Bruneval on the French coast." },
         { "day":"27", "month":"2", "year": "1953", "text": "F-84 Thunderjets raid North Korean base on Yalu River." },
         { "day":"27", "month":"2", "year": "1962", "text": "South Vietnamese president Ngo Dinh Diem is unharmed as two planes bomb the presidential palace in Saigon." },
         { "day":"27", "month":"2", "year": "1963", "text": "The Soviet Union says that 10,000 troops will remain in Cuba." },
         { "day":"27", "month":"2", "year": "1969", "text": "Thousands of students protest President Richard Nixon’s arrival in Rome." },
         { "day":"27", "month":"2", "year": "1973", "text": "U.S. Supreme Court rules that a Virginia pool club can’t bar residents because of color." },
         { "day":"27", "month":"2", "year": "1988", "text": "Debi Thomas becomes the first African American to win a medal at the Winter Olympics." },
         { "day":"27", "month":"2", "year": "1991", "text": "Coalition forces liberate Kuwait after seven months of occupation by the Iraqi army." }
      ]
   }
]
