[
   {
      "facts":[
         { "day":"28", "month":"2", "year": "1066", "text": "Westminster Abbey, the most famous church in England, opens its doors." },
         { "day":"28", "month":"2", "year": "1574", "text": "On the orders of the Holy Office of the Inquisition, two Englishmen and an Irishman are burnt for heresy." },
         { "day":"28", "month":"2", "year": "1610", "text": "Thomas West is appointed governor of Virginia." },
         { "day":"28", "month":"2", "year": "1704", "text": "Indians attack Deerfield, Mass. killing 40 and kidnapping 100." },
         { "day":"28", "month":"2", "year": "1847", "text": "Colonel Alexander Doniphan and his ragtag Missouri Mounted Volunteers ride to victory at the Battle of Sacramento, during the Mexican War." },
         { "day":"28", "month":"2", "year": "1861", "text": "The territory of Colorado is established." },
         { "day":"28", "month":"2", "year": "1900", "text": "After a 119-day siege by the Boers, the surrounded British troops in Ladysmith, South Africa, are relieved." },
         { "day":"28", "month":"2", "year": "1863", "text": "Four Union gunboats destroy the CSS Nashville near Fort McAllister, Georgia." },
         { "day":"28", "month":"2", "year": "1916", "text": "Haiti becomes the first U.S. protectorate." },
         { "day":"28", "month":"2", "year": "1924", "text": "U.S. troops are sent to Honduras to protect American interests during an election conflict." },
         { "day":"28", "month":"2", "year": "1936", "text": "The Japanese Army restores order in Tokyo and arrests officers involved in a coup." },
         { "day":"28", "month":"2", "year": "1945", "text": "U.S. tanks break the natural defense line west of the Rhine and cross the Erft River." },
         { "day":"28", "month":"2", "year": "1946", "text": "The U.S. Army declares that it will use V-2 rocket to test radar as an atomic rocket defense system." },
         { "day":"28", "month":"2", "year": "1953", "text": "Greece, Turkey and Yugoslavia sign a 5-year defense pact in Ankara." },
         { "day":"28", "month":"2", "year": "1967", "text": "In Mississippi, 19 are indicted in the slayings of three civil rights workers." },
         { "day":"28", "month":"2", "year": "1969", "text": "A Los Angeles court refuses Robert Kennedy assassin Sirhan Sirhan’s request to be executed." },
         { "day":"28", "month":"2", "year": "1971", "text": "The male electorate in Lichtenstein refuses to give voting rights to women." },
         { "day":"28", "month":"2", "year": "1994", "text": "U.S. warplanes shoot down four Serb aircraft over Bosnia in the first NATO use of force in the troubled area." }
      ]
   }
]
