[
   {
      "facts":[
         { "day":"10", "month":"7", "year":"1520", "text": "The Spanish explorer Cortes is driven from Tenochtitlan and retreats to Tlaxcala." },
         { "day":"10", "month":"7", "year":"1609", "text": "The Catholic states in Germany set up a league under the leadership of Maximillian of Bavaria." },
         { "day":"10", "month":"7", "year":"1679", "text": "The British crown claims New Hampshire as a royal colony." },
         { "day":"10", "month":"7", "year":"1747", "text": "Persian ruler Nadir Shah is assassinated at Fathabad." },
         { "day":"10", "month":"7", "year":"1776", "text": "The statue of King George III is pulled down in New York City." },
         { "day":"10", "month":"7", "year":"1778", "text": "In support of the American Revolution, Louis XVI declares war on England." },
         { "day":"10", "month":"7", "year":"1850", "text": "Millard Fillmore is sworn in as the 13th president of the United States following the death of Zachary Taylor." },
         { "day":"10", "month":"7", "year":"1890", "text": "Wyoming becomes the 44th state." },
         { "day":"10", "month":"7", "year":"1893", "text": "Dr. Daniel Hale Williams performs the first successful open-heart surgery, without anesthesia." },
         { "day":"10", "month":"7", "year":"1925", "text": "The trial of Tennessee teacher John T. Scopes opens, with Clarence Darrow appearing for the defense and William Jennings Bryan for the prosecution." },
         { "day":"10", "month":"7", "year":"1940", "text": "Germany begins the bombing of England." },
         { "day":"10", "month":"7", "year":"1942", "text": "General Carl Spaatz becomes the head of the U.S. Air Force in Europe." },
         { "day":"10", "month":"7", "year":"1943", "text": "American and British forces complete their amphibious landing of Sicily." },
         { "day":"10", "month":"7", "year":"1945", "text": "U.S. carrier-based aircraft begin airstrikes against Japan in preparation for invasion." },
         { "day":"10", "month":"7", "year":"1951", "text": "Armistice talks between the United Nations and North Korea begin at Kaesong." },
         { "day":"10", "month":"7", "year":"1960", "text": "Belgium sends troops to the Congo to protect whites as the Congolese Bloodbath begins, just 10 days after the former colony became independent of Belgian rule." },
         { "day":"10", "month":"7", "year":"1962", "text": "The satellite Telstar is launched from Cape Canaveral, Florida, beaming live television from Europe to the United States." },
         { "day":"10", "month":"7", "year":"1965", "text": "“(I Can’t Get No) Satisfaction” becomes the Rolling Stones’ first No. 1 single in the USA." },
         { "day":"10", "month":"7", "year":"1967", "text": "Singer Bobbie Gentry records “Ode to Billie Joe,” which will become a country music classic and win 4 Grammys." },
         { "day":"10", "month":"7", "year":"1976", "text": "In Seveso, near Milan, Italy, an explosion in a chemical factory covers the surrounding area with toxic dioxin. Time magazine has ranked the Seveso incident No. 8 on its list of 10 worst environmental disasters." },
         { "day":"10", "month":"7", "year":"1985", "text": "Coca-Cola Co. announces it will resume selling “old formula Coke,” following public outcry and falling sales of its “new Coke.”" },
         { "day":"10", "month":"7", "year":"1991", "text": "Boris Yeltsin is sworn in as the first elected president of the Russian Federation, following the breakup of the USSR." },
         { "day":"10", "month":"7", "year":"1993", "text": "Kenyan runner Yobes Ondieki becomes the first man to run 10,000 meters in less than 27 minutes." }
      ]
   }
]
