[
   {
      "facts":[
         { "day":"13", "month":"7", "year":"1099", "text": "The Crusaders launch their final assault on Jerusalem." },
         { "day":"13", "month":"7", "year":"1534", "text": "Ottoman armies capture Tabriz in northwestern Persia." },
         { "day":"13", "month":"7", "year":"1558", "text": "Led by the court of Egmont, the Spanish army defeats the French at Gravelines, France." },
         { "day":"13", "month":"7", "year":"1585", "text": "A group of 108 English colonists, led by Sir Richard Grenville, reaches Roanoke Island, North Carolina." },
         { "day":"13", "month":"7", "year":"1643", "text": "In England, the Roundheads, led by Sir William Waller, are defeated by Royalist troops under Lord Wilmot in the Battle of Roundway Down." },
         { "day":"13", "month":"7", "year":"1754", "text": "George Washington surrenders Fort Necessity to the French, leaving them in control of the Ohio Valley." },
         { "day":"13", "month":"7", "year":"1787", "text": "Congress, under the Articles of Confederation, enacts the Northwest Ordinance, establishing rules for governing the Northwest Territory, for admitting new states to the Union and limiting the expansion of slavery." },
         { "day":"13", "month":"7", "year":"1798", "text": "English poet William Wordsworth visits the ruins of Tintern Abbey." },
         { "day":"13", "month":"7", "year":"1832", "text": "Henry Schoolcraft discovers the source of the Mississippi River in Minnesota." },
         { "day":"13", "month":"7", "year":"1862", "text": "Confederate General Nathan Bedford Forrest defeats a Union army at Murfreesboro, Tennessee." },
         { "day":"13", "month":"7", "year":"1863", "text": "Opponents of the draft begin three days of rioting in New York City." },
         { "day":"13", "month":"7", "year":"1866", "text": "The Great Eastern begins a two week voyage to complete a 12-year effort to lay telegraph cable across the Atlantic between Britain and the United States." },
         { "day":"13", "month":"7", "year":"1878", "text": "The Congress of Berlin divides the Balkans among European powers." },
         { "day":"13", "month":"7", "year":"1939", "text": "Frank Sinatra records his first song, \"From the Bottom of my Heart,\" with the Harry James Band." },
         { "day":"13", "month":"7", "year":"1941", "text": "Britain and the Soviet Union sign a mutual aid pact, providing the means for Britain to send war materiel to the Soviet Union." },
         { "day":"13", "month":"7", "year":"1954", "text": "In Geneva, Great Britain, the Soviet Union, the People’s Republic of China and France reach an accord on Indochina, dividing Vietnam into two countries, North and South, along the 17th parallel." },
         { "day":"13", "month":"7", "year":"1971", "text": "The Army of Morrocco executes 10 leaders accused of leading a revolt." }
      ]
   }
]
