[
   {
      "facts":[
         { "day":"14", "month":"7", "year":"1223", "text": "In France, Louis VIII succeeds his father, Philip Augustus." },
         { "day":"14", "month":"7", "year":"1430", "text": "Joan of Arc, taken prisoner by the Burgundians in May, is handed over to Pierre Cauchon, the bishop of Beauvais." },
         { "day":"14", "month":"7", "year":"1456", "text": "Hungarians defeat the Ottomans at the Battle of Belgrade, in present-day Yugoslavia." },
         { "day":"14", "month":"7", "year":"1536", "text": "France and Portugal sign the Treaty of Lyons, aligning themselves against Spain." },
         { "day":"14", "month":"7", "year":"1789", "text": "The Bastille, a fortress in Paris used to hold political prisoners, is stormed by a mob." },
         { "day":"14", "month":"7", "year":"1798", "text": "The Sedition Act is passed by the U.S. Congress." },
         { "day":"14", "month":"7", "year":"1864", "text": "At Harrisburg, Mississippi, Federal troops under General Andrew Jackson Smith repulse an attack by General Nathan Bedford Forrest." },
         { "day":"14", "month":"7", "year":"1900", "text": "European Allies retake Tientsin, China, from the rebelling Boxers." },
         { "day":"14", "month":"7", "year":"1933", "text": "Nazi Germany promulgates the Law for the Protection of Hereditary Health–the begining of the Euthanasia program." },
         { "day":"14", "month":"7", "year":"1938", "text": "Howard Huges and crew set a new world record for an around-the-world flight." },
         { "day":"14", "month":"7", "year":"1940", "text": "A force of German bombers attacks Suez, Egypt, from bases in Crete." },
         { "day":"14", "month":"7", "year":"1941", "text": "Vichy French Foreign Legionaries sign an armistice in Damascus, allowing them to join the Free French Foreign Legion." },
         { "day":"14", "month":"7", "year":"1945", "text": "American battleships and cruisers bombard the Japanese home islands for the first time." },
         { "day":"14", "month":"7", "year":"1951", "text": "The George Washington Carver National Monument in Joplin, Missouri becomes the first national park honoring an African American." },
         { "day":"14", "month":"7", "year":"1964", "text": "The United States sends 600 more troops to Vietnam." }
      ]
   }
]
