[
   {
      "facts":[
         { "day":"17", "month":"7", "year":"1453", "text": "France defeats England at Castillon, France, ending the Hundred Years’ War." },
         { "day":"17", "month":"7", "year":"1762", "text": "Peter III of Russia is murdered and his wife, Catherine II, takes the throne." },
         { "day":"17", "month":"7", "year":"1785", "text": "France limits the importation of goods from Britain." },
         { "day":"17", "month":"7", "year":"1791", "text": "National Guard troops open fire on a crowd of demonstrators in Paris." },
         { "day":"17", "month":"7", "year":"1799", "text": "Ottoman forces, supported by the British, capture Aboukir, Egypt from the French." },
         { "day":"17", "month":"7", "year":"1801", "text": "The U.S. fleet arrives in Tripoli." },
         { "day":"17", "month":"7", "year":"1815", "text": "Napoleon Bonaparte surrenders to the British at Rochefort, France." },
         { "day":"17", "month":"7", "year":"1821", "text": "Andrew Jackson becomes the governor of Florida." },
         { "day":"17", "month":"7", "year":"1864", "text": "Confederate President Jefferson Davis replaces General Joseph E. Johnston with General John Bell Hood in hopes of defeating Union General William T. Sherman outside Atlanta." },
         { "day":"17", "month":"7", "year":"1898", "text": "U.S. troops under General William R. Shafter take Santiago de Cuba during the Spanish-American War." },
         { "day":"17", "month":"7", "year":"1944", "text": "Field Marshall Erwin Rommel is wounded when an Allied fighter strafes his staff car in France." },
         { "day":"17", "month":"7", "year":"1946", "text": "Chinese communists attack the Nationalist army on the Yangtze River." },
         { "day":"17", "month":"7", "year":"1960", "text": "American pilot Francis Gary Powers pleads guilty to spying charges in a Moscow court." },
         { "day":"17", "month":"7", "year":"1966", "text": "Ho Chi Minh orders a partial mobilization of North Vietnam to defend against American airstrikes." },
         { "day":"17", "month":"7", "year":"1987", "text": "Lt. Col. Oliver North and Rear Adm. John Poindexter begin testifying to Congress regarding the Iran-Contra scandal." }
      ]
   }
]
