[
   {
      "facts":[
         { "day":"2", "month":"7", "year":"1298", "text": "An army under Albert of Austria defeats forces led by Adolf of Nassau." },
         { "day":"2", "month":"7", "year":"1625", "text": "The Spanish army takes Breda, Spain, after nearly a year of siege." },
         { "day":"2", "month":"7", "year":"1644", "text": "Oliver Cromwell crushes the Royalists at the Battle of Marston Moor." },
         { "day":"2", "month":"7", "year":"1747", "text": "Marshall Saxe leads the French forces to victory over an Anglo-Dutch force under the Duke of Cumberland at the Battle of Lauffeld." },
         { "day":"2", "month":"7", "year":"1776", "text": "The Continental Congress resolves with the Declaration of Independence that the American colonies “are, and of right ought to be, free and independent States.”" },
         { "day":"2", "month":"7", "year":"1822", "text": "Denmark Vesey is executed in Charleston, South Carolina, for planning a massive slave revolt." },
         { "day":"2", "month":"7", "year":"1858", "text": "Czar Alexander II frees the serfs working on imperial lands." },
         { "day":"2", "month":"7", "year":"1863", "text": "The Union left flank holds at Little Round Top during the Battle of Gettysburg." },
         { "day":"2", "month":"7", "year":"1881", "text": "Charles J. Guiteau fatally wounds President James A. Garfield in Washington, D.C." },
         { "day":"2", "month":"7", "year":"1926", "text": "Congress establishes the Army Air Corps." },
         { "day":"2", "month":"7", "year":"1937", "text": "American aviation pioneer Amelia Earhart disappears in the Central Pacific during an attempt to fly around the world." },
         { "day":"2", "month":"7", "year":"1961", "text": "Novelist Ernest Hemingway commits suicide at his home in Ketchum, Idaho." },
         { "day":"2", "month":"7", "year":"1964", "text": "President Lyndon Johnson signs the Civil Rights Act into law." },
         { "day":"2", "month":"7", "year":"1967", "text": "The U.S. launches Operation Buffalo in Vietnam." },
         { "day":"2", "month":"7", "year":"1976", "text": "North and South Vietnam are officially reunified." },
         { "day":"2", "month":"7", "year":"1980", "text": "President Jimmy Carter reinstates draft registration for males 18 years of age." }
      ]
   }
]
