[
   {
      "facts":[
         { "day":"21", "month":"7", "year":"1403", "text": "Henry IV defeats the Percys in the Battle of Shrewsbury in England." },
         { "day":"21", "month":"7", "year":"1667", "text": "The Peace of Breda ends the Second Anglo-Dutch War and cedes Dutch New Amsterdam to the English." },
         { "day":"21", "month":"7", "year":"1711", "text": "Russia and Turkey sign the Treaty of Pruth, ending the year-long Russo-Turkish War." },
         { "day":"21", "month":"7", "year":"1718", "text": "The Treaty of Passarowitz is signed by Austria, Venice and the Ottoman Empire." },
         { "day":"21", "month":"7", "year":"1773", "text": "Pope Clement XIV abolishes the Jesuit order." },
         { "day":"21", "month":"7", "year":"1798", "text": "Napoleon Bonaparte defeats the Arab Mameluke warriors at the Battle of the Pyramids." },
         { "day":"21", "month":"7", "year":"1861", "text": "In the first major battle of the Civil War, Confederate forces defeat the Union Army along Bull Run near Manassas Junction, Virginia. The battle becomes known as Manassas by the Confederates, while the Union calls it Bull Run." },
         { "day":"21", "month":"7", "year":"1865", "text": "Wild Bill Hickok kills gunman Dave Tutt in Springfield, Missouri, in what is regarded as the first formal quick-draw duel." },
         { "day":"21", "month":"7", "year":"1873", "text": "The James Gang robs a train in Adair, Iowa." },
         { "day":"21", "month":"7", "year":"1896", "text": "Mary Church Terrell founds the National Association of Colored Women in Washington, D.C." },
         { "day":"21", "month":"7", "year":"1906", "text": "French Captain Alfred Dreyfus is vindicated of his earlier court-martial for spying for Germany." },
         { "day":"21", "month":"7", "year":"1919", "text": "The British House of Lords ratifies the Versailles Treaty." },
         { "day":"21", "month":"7", "year":"1925", "text": "John Scopes is found guilty for teaching evolution in Dayton, Tenn., and is fined $100." },
         { "day":"21", "month":"7", "year":"1941", "text": "France accepts Japan’s demand for military control of Indochina." },
         { "day":"21", "month":"7", "year":"1944", "text": "U.S. Army and Marine forces land on Guam in the Marianas." },
         { "day":"21", "month":"7", "year":"1954", "text": "The French sign an armistice with the Viet Minh that ends the war but divides Vietnam into two countries." },
         { "day":"21", "month":"7", "year":"1960", "text": "Sirimavo Bandaranaike becomes the first woman prime minister of Ceylon." }
      ]
   }
]
