[
   {
      "facts":[
         { "day":"24", "month":"7", "year":"1505", "text": "On their way to India, a group of Portuguese explorers sack the city-state of Kilwa." },
         { "day":"24", "month":"7", "year":"1567", "text": "Mary, Queen of Scots, is imprisoned and forced to abdicate her throne to her 1-year-old son James VI." },
         { "day":"24", "month":"7", "year":"1701", "text": "Antoine de la Mothe Cadillac establishes Fort Ponchartrain for France at present-day Detroit, Michigan." },
         { "day":"24", "month":"7", "year":"1704", "text": "Admiral George Rooke takes Gibraltar from the Spanish." },
         { "day":"24", "month":"7", "year":"1766", "text": "At Fort Ontario, Canada, Ottawa chief Pontiac and William Johnson sign a peace agreement." },
         { "day":"24", "month":"7", "year":"1791", "text": "Robespierre expels all Jacobins opposed to the principles of the French Revolution." },
         { "day":"24", "month":"7", "year":"1847", "text": "The first members of Church of Jesus Christ of Latter Day Saints (Mormons) arrive in Utah, settling in present-day Salt Lake City." },
         { "day":"24", "month":"7", "year":"1862", "text": "The eighth president of the United States, Martin Van Buren, dies at the age of 79." },
         { "day":"24", "month":"7", "year":"1897", "text": "African-American soldiers of the 25th Infantry Bicycle Corps arrive in St. Louis, Mo., after completing a 40-day bike ride from Missoula, Montana." },
         { "day":"24", "month":"7", "year":"1941", "text": "The U.S. government denounces Japanese actions in Indochina." },
         { "day":"24", "month":"7", "year":"1942", "text": "The Soviet city of Rostov is captured by German troops." },
         { "day":"24", "month":"7", "year":"1950", "text": "The U.S. Fifth Air Force relocates from Japan to Korea." },
         { "day":"24", "month":"7", "year":"1974", "text": "The Supreme Court rules that President Richard Nixon must surrender the Watergate tapes." }
      ]
   }
]
