[
   {
      "facts":[
         { "day":"25", "month":"7", "year":"326", "text": "Emperor Constantine refuses to carry out traditional pagan sacrifices." },
         { "day":"25", "month":"7", "year":"1394", "text": "Charles VI of France issues a decree for the general expulsion of Jews from France." },
         { "day":"25", "month":"7", "year":"1564", "text": "Maximillian II becomes emperor of the Holy Roman Empire." },
         { "day":"25", "month":"7", "year":"1587", "text": "Hideyoshi bans Christianity in Japan and orders all Christians to leave." },
         { "day":"25", "month":"7", "year":"1759", "text": "British forces defeat a French army at Fort Niagara in Canada." },
         { "day":"25", "month":"7", "year":"1799", "text": "On his way back from Syria, Napoleon Bonaparte defeats the Ottomans at Aboukir, Egypt." },
         { "day":"25", "month":"7", "year":"1814", "text": "British and American forces fight each other to a standoff at Lundy’s Lane, Canada." },
         { "day":"25", "month":"7", "year":"1845", "text": "China grants Belgium equal trading rights with Britain, France and the United States." },
         { "day":"25", "month":"7", "year":"1867", "text": "President Andrew Johnson signs an act creating the territory of Wyoming." },
         { "day":"25", "month":"7", "year":"1850", "text": "Gold is discovered in the Rogue River in Oregon, extending the quest for gold up the Pacific coast." },
         { "day":"25", "month":"7", "year":"1861", "text": "The Crittenden Resolution, calling for the American Civil War to be fought to preserve the Union and not for slavery, is passed by Congress." },
         { "day":"25", "month":"7", "year":"1894", "text": "Japanese forces sink the British steamer Kowshing which was bringing Chinese reinforcements to Korea." },
         { "day":"25", "month":"7", "year":"1909", "text": "French aviator Louis Bleriot becomes the first man to fly across the English Channel in an airplane." },
         { "day":"25", "month":"7", "year":"1914", "text": "Russia declares that it will act to protect Serbian sovereignty." },
         { "day":"25", "month":"7", "year":"1924", "text": "Greece announces the deportation of 50,000 Armenians." },
         { "day":"25", "month":"7", "year":"1934", "text": "Austrian chancellor Engelbert Dollfuss is shot and killed by Nazis." },
         { "day":"25", "month":"7", "year":"1941", "text": "The U.S. government freezes Japanese and Chinese assets." },
         { "day":"25", "month":"7", "year":"1943", "text": "Italian Fascist dictator Benito Mussolini is overthrown in a coup." },
         { "day":"25", "month":"7", "year":"1944", "text": "Allied forces begin the breakthrough of German lines in Normandy." },
         { "day":"25", "month":"7", "year":"1978", "text": "The first test-tube baby, Louis Brown, is born in Oldham, England." },
         { "day":"25", "month":"7", "year":"1984", "text": "Svetlana Savitskaya becomes first woman to perform a space walk." }
      ]
   }
]
