[
   {
      "facts":[
         { "day":"26", "month":"7", "year":"657", "text": "Mu’awiyan defeats Caliph Ali in the Battle of Siffin in Mesopotamia." },
         { "day":"26", "month":"7", "year":"1526", "text": "Lucas Vasquez de Ayllon and colonists leave Santo Domingo for Florida." },
         { "day":"26", "month":"7", "year":"1529", "text": "Francisco Pizarro receives a royal warrant to \"discover and conquer\" Peru." },
         { "day":"26", "month":"7", "year":"1758", "text": "British forces capture France’s Fortress of Louisbourg after a seven-week siege." },
         { "day":"26", "month":"7", "year":"1759", "text": "The French relinquish Fort Ticonderoga in New York to the British under General Jeffrey Amherst." },
         { "day":"26", "month":"7", "year":"1775", "text": "The Continental Congress establishes a postal system for the colonies with Benjamin Franklin as the first postmaster general." },
         { "day":"26", "month":"7", "year":"1790", "text": "An attempt at a counter-revolution in France is put down by the National Guard at Lyons." },
         { "day":"26", "month":"7", "year":"1794", "text": "The French defeat an Austrian army at the Battle of Fleurus, France." },
         { "day":"26", "month":"7", "year":"1830", "text": "King Charles X of France issues five ordinances limiting the political and civil rights of citizens." },
         { "day":"26", "month":"7", "year":"1847", "text": "Liberia becomes the first African colony to become an independent state." },
         { "day":"26", "month":"7", "year":"1848", "text": "The French army suppresses the Paris uprising." },
         { "day":"26", "month":"7", "year":"1886", "text": "William Gladstone is replaced by Lord Salisbury as Prime Minister of England." },
         { "day":"26", "month":"7", "year":"1918", "text": "Britain’s top war ace, Edward Mannock, is shot down by ground fire on the Western Front." },
         { "day":"26", "month":"7", "year":"1920", "text": "The 19th Amendment to the U.S. Constitution is ratified." },
         { "day":"26", "month":"7", "year":"1948", "text": "In an Executive Order, President Harry Truman calls for the end of discrimination and segregation in the U.S. armed forces." },
         { "day":"26", "month":"7", "year":"2005", "text": "The shuttle Discovery launches on mission STS-114, marking a return to space after the shuttle Columbia crash of 2003." }
      ]
   }
]
