[
   {
      "facts":[
        { "day":"29", "month":"7", "year":"1588", "text": "The Spanish Armada is sighted off the coast of England." },
        { "day":"29", "month":"7", "year":"1602", "text": "The Duke of Biron is executed in Paris for conspiring with Spain and Savoy against King Henry IV of France." },
        { "day":"29", "month":"7", "year":"1603", "text": "Bartholomew Gilbert is killed in Virginia by Indians, during a search for the missing Roanoke colonists." },
        { "day":"29", "month":"7", "year":"1693", "text": "The Army of the Grand Alliance is destroyed by the French at the Battle of Neerwinden." },
        { "day":"29", "month":"7", "year":"1830", "text": "Liberals led by the Marquis of Lafayette seize Paris in opposition to the king’s restrictions on citizens’ rights." },
        { "day":"29", "month":"7", "year":"1848", "text": "A rebellion against British rule is put down in Tipperary, Ireland." },
        { "day":"29", "month":"7", "year":"1858", "text": "Japan signs a treaty of commerce and friendship with the United States." },
        { "day":"29", "month":"7", "year":"1862", "text": "Confederates are routed by Union guerrillas at Moore’s Mill, Missouri." },
        { "day":"29", "month":"7", "year":"1875", "text": "Peasants in Bosnia and Herzegovina rebel against the Ottoman army." },
        { "day":"29", "month":"7", "year":"1915", "text": "U.S. Marines land at Port-au-Prince to protect American interests in Haiti." },
        { "day":"29", "month":"7", "year":"1921", "text": "Adolf Hitler becomes the president of the Nationalist Socialist German Workers’ Party (Nazis)." },
        { "day":"29", "month":"7", "year":"1945", "text": "After delivering parts of the first atomic bomb to the island of Tinian, the U.S.S. Indianapolis is sunk by a Japanese submarine. The survivors are adrift for two days before help arrives." },
        { "day":"29", "month":"7", "year":"1981", "text": "Prince Charles marries Lady Diana." },
        { "day":"29", "month":"7", "year":"1990", "text": "Boston Red Sox hit 12 doubles in a game, setting major league record." },
        { "day":"29", "month":"7", "year":"1996", "text": "A US federal court strikes down the child protection portion of the 1996 Communications Decency Act, calling it too broad." },
        { "day":"29", "month":"7", "year":"2005", "text": "Astronomers announce discovery of dwarf planet Eris, leading the International Astronomic Union to clarify the definition of a planet." }
      ]
   }
]
