[
   {
      "facts":[
         { "day":"31", "month":"7", "year":"904", "text": "Arabs capture Thessalonica." },
         { "day":"31", "month":"7", "year":"1703", "text": "English novelist Daniel Defoe is made to stand in the pillory as punishment for offending the government and church with his satire The Shortest Way With Dissenters." },
         { "day":"31", "month":"7", "year":"1760", "text": "Ferdinand, Duke of Brunswick, drives the French army back to the Rhine River." },
         { "day":"31", "month":"7", "year":"1790", "text": "The U.S. Patent Office opens." },
         { "day":"31", "month":"7", "year":"1882", "text": "Belle and Sam Starr are charged with horse stealing in the Indian territory." },
         { "day":"31", "month":"7", "year":"1875", "text": "Former president Andrew Johnson dies at the age of 66." },
         { "day":"31", "month":"7", "year":"1891", "text": "Great Britain declares territories in Southern Africa up to the Congo to be within their sphere of influence." },
         { "day":"31", "month":"7", "year":"1904", "text": "The Trans-Siberian railroad connecting the Ural mountains with Russia’s Pacific coast, is completed." },
         { "day":"31", "month":"7", "year":"1917", "text": "The third Battle of Ypres commences as the British attack the German lines." },
         { "day":"31", "month":"7", "year":"1932", "text": "Adolf Hitler’s Nationalist Socialist German Workers’ Party (Nazis) doubles its strength in legislative elections." },
         { "day":"31", "month":"7", "year":"1944", "text": "The Soviet army takes Kovno, the capital of Lithuania." },
         { "day":"31", "month":"7", "year":"1962", "text": "Federation of Malaysia formally proposed." },
         { "day":"31", "month":"7", "year":"1971", "text": "Apollo 15 astronauts take a drive on the moon in their land rover." },
         { "day":"31", "month":"7", "year":"1987", "text": "An F4 tornado in Edmonton, Alberta kills 27 and causes $330 million in damages; the day is remembered as \"Black Friday.\"" },
         { "day":"31", "month":"7", "year":"1988", "text": "Bridge collapse at Sultan Abdul Halim ferry terminal in Butterworth, Malaysia, kills 32 and injures more than 1,600." },
         { "day":"31", "month":"7", "year":"1990", "text": "Bosnia-Hercegovina declares independence from Yugoslavia." },
         { "day":"31", "month":"7", "year":"1991", "text": "US and USSR sign a long-range nuclear weapons reduction pact." },
         { "day":"31", "month":"7", "year":"1999", "text": "NASA purposely crashes its Discovery Program’s Lunar Prospector into the moon, ending the agency’s mission to detect frozen water on Earth’s moon." },
         { "day":"31", "month":"7", "year":"2006", "text": "Fidel Castro temporarily hands over power to his brother Raul Castro." },
         { "day":"31", "month":"7", "year":"2007", "text": "The British Army’s longest continual operation, Operation Banner (1969-2007), ends as British troops withdraw from Northern Ireland." }
      ]
   }
]
