[
   {
      "facts":[
         { "day":"7", "month":"7", "year":"1742", "text": "A Spanish force invading Georgia runs headlong into the colony’s British defenders.The battle decides the fate of a colony." },
         { "day":"7", "month":"7", "year":"1777", "text": "American troops give up Fort Ticonderoga, on Lake Champlain, to the British." },
         { "day":"7", "month":"7", "year":"1791", "text": "Benjamin Rush, Richard Allen and Absalom Jones found the Non-denominational African Church." },
         { "day":"7", "month":"7", "year":"1795", "text": "Thomas Paine defends the principal of universal suffrage at the Constitutional Convention in Paris." },
         { "day":"7", "month":"7", "year":"1798", "text": "Napoleon Bonaparte’s army begins its march towards Cairo from Alexandria." },
         { "day":"7", "month":"7", "year":"1807", "text": "Czar Alexander meets with Napoleon Bonaparte." },
         { "day":"7", "month":"7", "year":"1814", "text": "Sir Walter Scott’s novel Waverly is published anonymously so as not to damage his reputation as a poet." },
         { "day":"7", "month":"7", "year":"1815", "text": "After defeating Napoleon at Waterloo, the victorious Allies march into Paris." },
         { "day":"7", "month":"7", "year":"1853", "text": "Japan opens its ports to trade with the West after 250 years of isolation." },
         { "day":"7", "month":"7", "year":"1863", "text": "Confederate General Robert E. Lee, in Hagerstown, Maryland, reports his defeat at Gettysburg to President Jefferson Davis." },
         { "day":"7", "month":"7", "year":"1925", "text": "Afrikaans is recognized as one of the official languages of South Africa, along with English and Dutch." },
         { "day":"7", "month":"7", "year":"1927", "text": "Christopher Stone becomes the first British ‘disc jockey’ when he plays records for the BBC." },
         { "day":"7", "month":"7", "year":"1941", "text": "Although a neutral country, the United States sends troops to occupy Iceland to keep it out of Germany’s hands." },
         { "day":"7", "month":"7", "year":"1943", "text": "Adolf Hitler makes the V-2 missile program a top priority in armament planning." },
         { "day":"7", "month":"7", "year":"1966", "text": "The U.S. Marine Corps launches Operation Hasting to drive the North Vietnamese Army back across the Demilitarized Zone in Vietnam." },
         { "day":"7", "month":"7", "year":"1969", "text": "The first U.S. units to withdraw from South Vietnam leave Saigon." },
         { "day":"7", "month":"7", "year":"1981", "text": "Sandra Day O’Connor becomes the first woman to serve on the Supreme Court." }
      ]
   }
]
