[
   {
      "facts":[
         { "day":"9", "month":"7", "year":"118", "text": "Hadrian, Rome’s new emperor, makes his entry into the city." },
         { "day":"9", "month":"7", "year":"455", "text": "Avitus, the Roman military commander in Gaul, becomes Emperor of the West." },
         { "day":"9", "month":"7", "year":"1553", "text": "Maurice of Saxony is mortally wounded at Sievershausen, Germany, while defeating Albert of Brandenburg-Kulmbach." },
         { "day":"9", "month":"7", "year":"1609", "text": "Emperor Rudolf II grants Bohemia freedom of worship." },
         { "day":"9", "month":"7", "year":"1755", "text": "General Edward Braddock is killed by French and Indian troops." },
         { "day":"9", "month":"7", "year":"1789", "text": "In Versailles, the French National Assembly declares itself the Constituent Assembly and begins to prepare a French constitution." },
         { "day":"9", "month":"7", "year":"1790", "text": "The Swedish navy captures one third of the Russian fleet at the Battle of Svensksund in the Baltic Sea." },
         { "day":"9", "month":"7", "year":"1850", "text": "U.S. President Zachary Taylor dies in office at the age of 65. He is succeeded by Millard Fillmore." },
         { "day":"9", "month":"7", "year":"1861", "text": "Confederate cavalry led by John Morgan captures Tompkinsville, Kentucky." },
         { "day":"9", "month":"7", "year":"1900", "text": "The Commonwealth of Australia is established by an act of British Parliament, uniting the separate colonies under a federal government." },
         { "day":"9", "month":"7", "year":"1942", "text": "Anne Frank and her family go into hiding in the attic above her father’s office in an Amsterdam warehouse." },
         { "day":"9", "month":"7", "year":"1943", "text": "American and British forces make an amphibious landing on Sicily." },
         { "day":"9", "month":"7", "year":"1971", "text": "The United States turns over complete responsibility of the Demilitarized Zone to South Vietnamese units." }
      ]
   }
]
