[
   {
      "facts":[
         { "day":"10", "month":"8", "year":"955", "text": "Otto organizes his nobles and defeats the invading Magyars at the Battle of Lechfeld in Germany." },
         { "day":"10", "month":"8", "year":"1539", "text": "King Francis of France declares that all official documents are to be written in French, not Latin." },
         { "day":"10", "month":"8", "year":"1557", "text": "French troops are defeated by Emmanuel Philibert’s Spanish army at St. Quentin, France." },
         { "day":"10", "month":"8", "year":"1582", "text": "Russia ends its 25-year war with Poland." },
         { "day":"10", "month":"8", "year":"1628", "text": "The Swedish warship Vasa capsizes and sinks in Stockholm harbor on her maiden voyage." },
         { "day":"10", "month":"8", "year":"1779", "text": "Louis XVI of France frees the last remaining serfs on royal land." },
         { "day":"10", "month":"8", "year":"1831", "text": "William Driver of Salem, Massachusetts, is the first to use the term \"Old Glory\" in connection with the American flag, when he gives that name to a large flag aboard his ship, the Charles Daggett." },
         { "day":"10", "month":"8", "year":"1846", "text": "The Smithsonian Institution is established in Washington through the bequest of James Smithson." },
         { "day":"10", "month":"8", "year":"1864", "text": "Confederate Commander John Bell Hood sends his cavalry north of Atlanta to cut off Union General William Sherman’s supply lines." },
         { "day":"10", "month":"8", "year":"1911", "text": "The House of Lords in Great Britain gives up its veto power, making the House of Commons the more powerful House." },
         { "day":"10", "month":"8", "year":"1913", "text": "The Treaty of Bucharest ends the Second Balkan War." },
         { "day":"10", "month":"8", "year":"1941", "text": "Great Britain and the Soviet Union promise aid to Turkey if it is attacked by the AxisPowers." },
         { "day":"10", "month":"8", "year":"1949", "text": "National Military Establishment renamed Department of Defense." },
         { "day":"10", "month":"8", "year":"1950", "text": "President Harry S. Truman calls the National Guard to active duty to fight in the Korean War." },
         { "day":"10", "month":"8", "year":"1954", "text": "English jockey Sir Gordon Richards retires with a world-record total of 4,870 victories, later broken by Johnny Longden of the United States. Richards was the first jockey ever to be knighted." },
         { "day":"10", "month":"8", "year":"1954", "text": "The groundbreaking ceremony for the St. Lawrence Seaway is held at Massena, New York." },
         { "day":"10", "month":"8", "year":"1960", "text": "NASA launches Discoverer 13 satellite; it would become the first object ever recovered from orbit." },
         { "day":"10", "month":"8", "year":"1970", "text": "Rocker Jim Morrison tried in Miami on \"lewd & lascivious behavior.\" Although convicted and sentenced to jail, he was free on bond while his case was being appealed when he died in Paris, July 3, 1971." },
         { "day":"10", "month":"8", "year":"1975", "text": "David Frost purchases the exclusive rights to interview Richard Nixon." },
         { "day":"10", "month":"8", "year":"1977", "text": "US and Panama sign Panama Canal Zone accord, guaranteeing Panama would have control of the canal after 1999." },
         { "day":"10", "month":"8", "year":"1997", "text": "The last British troops leave Hong Kong. After 156 years of British rule, the island is returned to China." },
         { "day":"10", "month":"8", "year":"2003", "text": "For the first time ever, temperatures exceed 100 degrees Fahrenheit when thermometers hit 101.3 F (38.5 Celsius)  at Kent." },
         { "day":"10", "month":"8", "year":"2006", "text": "All toiletries are banned from commercial airplanes after Scotland Yard disrupts a a major terrorist plot involving liquid explosives. After a few weeks, the toiletries ban was modified." }
      ]
   }
]
