[
   {
      "facts":[
         { "day":"13", "month":"8", "year":"1521", "text": "Cortes captures the city of Tenochtitlan, Mexico, and sets it on fire." },
         { "day":"13", "month":"8", "year":"1630", "text": "Emperor Ferdinand II dismisses Albert Eusebius van Wallenstein, his most capable general." },
         { "day":"13", "month":"8", "year":"1680", "text": "War starts when the Spanish are expelled from Santa Fe, New Mexico, by Indians under Chief Pope." },
         { "day":"13", "month":"8", "year":"1704", "text": "The Duke of Marlborough and Prince Eugene of Austria defeat the French Army at the Battle of Blenheim." },
         { "day":"13", "month":"8", "year":"1787", "text": "The Ottoman Empire declares war on Russia." },
         { "day":"13", "month":"8", "year":"1862", "text": "Confederate General Nathan Bedford Forrest defeats a Union army under Thomas Crittenden at Murfreesboro, Tennessee." },
         { "day":"13", "month":"8", "year":"1881", "text": "The first African-American nursing school opens at Spelman College in Atlanta, Georgia." },
         { "day":"13", "month":"8", "year":"1889", "text": "The first coin-operated telephone is patented by William Gray." },
         { "day":"13", "month":"8", "year":"1892", "text": "The first issue of the Afro American newspaper is published in Baltimore, Maryland." },
         { "day":"13", "month":"8", "year":"1898", "text": "Manila, the capital of the Philippines, falls to the U.S. Army." },
         { "day":"13", "month":"8", "year":"1910", "text": "British nurse Florence Nightingale, famous for her care of British soldiers during the Crimean War, dies." },
         { "day":"13", "month":"8", "year":"1932", "text": "Adolf Hitler refuses to serve as Franz Von Papen’s vice chancellor." },
         { "day":"13", "month":"8", "year":"1948", "text": "During the Berlin Airlift, the weather over Berlin becomes so stormy that American planes have their most difficult day landing supplies. They deem it ‘Black Friday.’" },
         { "day":"13", "month":"8", "year":"1961", "text": "Construction begins on Berlin Wall during the night." },
         { "day":"13", "month":"8", "year":"1963", "text": "A 17 year-old Buddhist monk burns himself to death in Saigon, South Vietnam." },
         { "day":"13", "month":"8", "year":"1978", "text": "Bomb attack in Beirut during Second Lebanese Civil War kills more than 150 people." },
         { "day":"13", "month":"8", "year":"1989", "text": "The wreckage of a plane that carried U.S. congressman Mickey Leland and others on a humanitarian mission is found on a mountain side in Ethiopia; there are no survivors." },
         { "day":"13", "month":"8", "year":"1993", "text": "US Court of Appeals rules Congress must save all emails." }
      ]
   }
]
