[
   {
      "facts":[
         { "day":"16", "month":"8", "year":"1513", "text": "Henry VIII of England and Emperor Maximilian defeat the French at Guinegatte, France, in the Battle of the Spurs." },
         { "day":"16", "month":"8", "year":"1777", "text": "France declares a state of bankruptcy." },
         { "day":"16", "month":"8", "year":"1780", "text": "American troops are badly defeated by the British at the Battle of Camden, South Carolina." },
         { "day":"16", "month":"8", "year":"1812", "text": "American General William Hull surrenders Detroit without resistance to a smaller British force under General Issac Brock." },
         { "day":"16", "month":"8", "year":"1858", "text": "U.S. President James Buchanan and Britain’s Queen Victoria exchange messages inaugurating the first transatlantic telegraph line." },
         { "day":"16", "month":"8", "year":"1861", "text": "Union and Confederate forces clash near Fredericktown and Kirkville, Missouri." },
         { "day":"16", "month":"8", "year":"1863", "text": "Union General William S. Rosecrans moves his army south from Tullahoma, Tennessee to attack Confederate forces in Chattanooga." },
         { "day":"16", "month":"8", "year":"1896", "text": "Gold is discovered in the Klondike of Canada’s Yukon Territory, setting off the Klondike Gold Rush." },
         { "day":"16", "month":"8", "year":"1914", "text": "Liege, Belgium, falls to the German army." },
         { "day":"16", "month":"8", "year":"1945", "text": "Lieutenant General Jonathan Wainwright, who was taken prisoner by the Japanese on Corregidor on May 6, 1942, is released from a POW camp in Manchuria by U.S. troops." },
         { "day":"16", "month":"8", "year":"1965", "text": "The Watts riots end in south-central Los Angeles after six days." },
         { "day":"16", "month":"8", "year":"1977", "text": "Elvis Presley dies of a heart attack in the upstairs bedroom suite area of his Graceland Mansion in Memphis, Tennessee." },
         { "day":"16", "month":"8", "year":"1984", "text": "The safe of the sunken ocean liner Andrea Doria is opened on TV after three decades, revealing cash and certificates but no other valuables." },
         { "day":"16", "month":"8", "year":"1986", "text": "Sudanese rebels shoot down a Sudanese Airways plane, killing 57 people." },
         { "day":"16", "month":"8", "year":"1987", "text": "Astrological alignment of sun, moon and six planets marks what believers maintain is the dawning of a New Age." },
         { "day":"16", "month":"8", "year":"1988", "text": "IBM introduces artificial intelligence software." },
         { "day":"16", "month":"8", "year":"1990", "text": "Iraq orders 2,500 Americans and 4,000 British nationals in Kuwait to Iraq, in the aftermath of Iraq’s invasion of that country." },
         { "day":"16", "month":"8", "year":"2012", "text": "In South Africa police fire on striking mine workers, killing at least 34." }
      ]
   }
]
