[
   {
      "facts":[
         { "day":"17", "month":"8", "year":"1743", "text": "By the Treaty of Abo, Sweden cedes southeast Finland to Russia, ending Sweden’s failed war with Russia." },
         { "day":"17", "month":"8", "year":"1812", "text": "Napoleon Bonaparte’s army defeats the Russians at the Battle of Smolensk during the Russian retreat to Moscow." },
         { "day":"17", "month":"8", "year":"1833", "text": "The first steam ship to cross the Atlantic entirely on its own power, the Canadian ship Royal William, begins her journey from Nova Scotia to The Isle of Wight." },
         { "day":"17", "month":"8", "year":"1863", "text": "Union gunboats attack Fort Sumter in Charleston, South Carolina, for the first time." },
         { "day":"17", "month":"8", "year":"1942", "text": "Marine Raiders attack Makin Island in the Gilbert Islands from two submarines." },
         { "day":"17", "month":"8", "year":"1943", "text": "Allied forces complete the conquest of Sicily." },
         { "day":"17", "month":"8", "year":"1944", "text": "The mayor of Paris, Pierre Charles Tattinger, meets with the German commander Dietrich von Choltitz to protest the explosives being deployed throughout the city." },
         { "day":"17", "month":"8", "year":"1945", "text": "Upon hearing confirmation that Japan has surrendered, Sukarno proclaims Indonesia’s independence." },
         { "day":"17", "month":"8", "year":"1960", "text": "American Francis Gary Powers pleads guilty at his Moscow trial for spying over the Soviet Union in a U-2 plane." },
         { "day":"17", "month":"8", "year":"1978", "text": "Three Americans complete the first crossing of the Atlantic in a balloon." },
         { "day":"17", "month":"8", "year":"1987", "text": "93-year-old Rudolf Hess, former Nazi leader and deputy of Hitler, is found hanged to death in Spandau Prison." },
         { "day":"17", "month":"8", "year":"1988", "text": "Pakistani President Zia-ul-Haq is killed in an airplane crash suspected of being an assassination." },
         { "day":"17", "month":"8", "year":"1998", "text": "President Bill Clinton admits to the American public that he had affair with White House intern Monica Lewinsky." },
         { "day":"17", "month":"8", "year":"1999", "text": "A 7.4-magnitude earthquake near Izmit, Turkey kills over 17,000 and injures nearly 45,000." },
         { "day":"17", "month":"8", "year":"2005", "text": "Israel begins the first forced evacuation of Israeli settlers from the Gaza Strip and northern West Bank, as part of a unilateral disengagement plan." },
         { "day":"17", "month":"8", "year":"2012", "text": "Moscow’s top court upholds ban of gay pride events in Russia’s capital city for 100 years." }
      ]
   }
]
