[
   {
      "facts":[
         { "day":"21", "month":"8", "year":"1129", "text": "The warrior Yoritomo is made Shogun without equal in Japan." },
         { "day":"21", "month":"8", "year":"1525", "text": "Estavao Gomes returns to Portugal after failing to find a clear waterway to Asia." },
         { "day":"21", "month":"8", "year":"1794", "text": "France surrenders the island of Corsica to the British." },
         { "day":"21", "month":"8", "year":"1808", "text": "Napoleon Bonaparte’s General Junot is defeated by Wellington at the first Battle of the Peninsular War at Vimiero, Portugal." },
         { "day":"21", "month":"8", "year":"1831", "text": "Nat Turner leads a slave revolt in Southampton County, Virginia that kills close to 60 whites." },
         { "day":"21", "month":"8", "year":"1858", "text": "The first of a series of debates begins between Abraham Lincoln and Stephen Douglas. Douglas goes on to win the Senate seat in November, but Lincoln gains national visibility for the first time." },
         { "day":"21", "month":"8", "year":"1863", "text": "Confederate raiders under William Quantrill strike Lawrence, Kansas, leaving 150 civilians dead." },
         { "day":"21", "month":"8", "year":"1864", "text": "Confederate General A.P. Hill attacks Union troops south of Petersburg, Va., at the Weldon railroad. His attack is repulsed, resulting in heavy Confederate casualties." },
         { "day":"21", "month":"8", "year":"1915", "text": "Italy declares war on Turkey." },
         { "day":"21", "month":"8", "year":"1942", "text": "U.S. Marines turn back the first major Japanese ground attack on Guadalcanal in the Battle of Tenaru." },
         { "day":"21", "month":"8", "year":"1944", "text": "The Dumbarton Oaks conference, which lays the foundation for the establishment of the United Nations, is held in Washington, D.C." },
         { "day":"21", "month":"8", "year":"1945", "text": "President Harry S. Truman cancels all contracts under the Lend-Lease Act." },
         { "day":"21", "month":"8", "year":"1959", "text": "Hawaii is admitted into the Union." },
         { "day":"21", "month":"8", "year":"1963", "text": "The South Vietnamese Army arrests over 100 Buddhist monks in Saigon." },
         { "day":"21", "month":"8", "year":"1968", "text": "Soviet forces invade Czechoslovakia because of the country’s experiments with a more liberal government." },
         { "day":"21", "month":"8", "year":"1972", "text": "US orbiting astronomy observatory Copernicus launched." },
         { "day":"21", "month":"8", "year":"1976", "text": "Mary Langdon in Battle, East Sussex, becomes Britain’s first firewoman." },
         { "day":"21", "month":"8", "year":"1976", "text": "Operation Paul Bunyan: after North Korean guards killed two American officers sent to trim a poplar tree along the DMZ on Aug. 18, US and ROK soldiers with heavy support chopped down the tree." },
         { "day":"21", "month":"8", "year":"1986", "text": "In Cameroon 2,000 die from poison gas from a volcanic eruption." },
         { "day":"21", "month":"8", "year":"1988", "text": "Ceasefire in the 8-year war between Iran and Iraq." },
         { "day":"21", "month":"8", "year":"1989", "text": "Voyager 2 begins a flyby of planet Neptune." },
         { "day":"21", "month":"8", "year":"1991", "text": "Communist hardliners’ coup is crushed in USSR after just 2 days; Latvia declares independence from USSR." },
         { "day":"21", "month":"8", "year":"1994", "text": "Ernesto Zedillo wins Mexico’s presidential election." },
         { "day":"21", "month":"8", "year":"1996", "text": "The new Globe theater opens in England." },
         { "day":"21", "month":"8", "year":"2000", "text": "Tiger Woods wins golf’s PGA Championship, the first golfer to win 3 majors in a calendar year since Ben Hogan in 1953." },
         { "day":"21", "month":"8", "year":"2001", "text": "NATO decides to send a peacekeeping force to the former Yugoslav Republic of Macedonia." }
      ]
   }
]
