[
   {
      "facts":[
         { "day":"22", "month":"8", "year":"1350", "text": "John II, also known as John the Good, succeeds Philip VI as king of France." },
         { "day":"22", "month":"8", "year":"1485", "text": "Henry Tudor defeats Richard III at Bosworth. This victory establishes the Tudor dynasty in England and ends the War of the Roses." },
         { "day":"22", "month":"8", "year":"1642", "text": "Civil war in England begins as Charles I declares war on Parliament at Nottingham." },
         { "day":"22", "month":"8", "year":"1717", "text": "The Austrian army forces the Turkish army out of Belgrade, ending the Turkish revival in the Balkans." },
         { "day":"22", "month":"8", "year":"1777", "text": "With the approach of General Benedict Arnold’s army, British Colonel Barry St. Ledger abandons Fort Stanwix and returns to Canada." },
         { "day":"22", "month":"8", "year":"1849", "text": "The Portuguese governor of Macao, China, is assassinated because of his anti-Chinese policies." },
         { "day":"22", "month":"8", "year":"1911", "text": "The Mona Lisa, the famous painting by Leonardo da Vinci, is stolen from the Louvre in Paris, where it had hung for more than 100 years. It is recovered in 1913." },
         { "day":"22", "month":"8", "year":"1922", "text": "Michael Collins, Irish politician, is killed in an ambush." },
         { "day":"22", "month":"8", "year":"1942", "text": "Brazil declares war on the Axis powers. She is the only South American country to send combat troops into Europe." },
         { "day":"22", "month":"8", "year":"1945", "text": "Soviet troops land at Port Arthur and Dairen on the Kwantung Peninsula in China." },
         { "day":"22", "month":"8", "year":"1945", "text": "Conflict in Vietnam begins when a group of Free French parachute into southern Indochina, in repsonse to a successful coup by communist guerilla Ho Chi Minh." },
         { "day":"22", "month":"8", "year":"1952", "text": "Devil’s Island’s penal colony is permanently closed." },
         { "day":"22", "month":"8", "year":"1956", "text": "Incumbent US President Dwight D. Eisenhower & Vice President Richard Nixon renominated by Republican convention in San Francisco." },
         { "day":"22", "month":"8", "year":"1962", "text": "OAS (Secret Army Organization) gunmen unsuccessfully attempt to assassinate French president Charles de Gaulle; the incident inspires Frederick Forsyth’s novel, The Day of the Jackal." },
         { "day":"22", "month":"8", "year":"1962", "text": "The world’s first nuclear-powered passenger-cargo ship, NS Savannah, completes its maiden voyage from Yorktown, Va., to Savannah, Ga." },
         { "day":"22", "month":"8", "year":"1968", "text": "First papal visit to Latin America; Pope Paul VI arrives in Bogota." },
         { "day":"22", "month":"8", "year":"1969", "text": "Hurricane Camille hits US Gulf Coast, killing 256 and causing $1.421 billion in damages." },
         { "day":"22", "month":"8", "year":"1971", "text": "Bolivian military coup: Col. Hugo Banzer Suarez ousts leftist president, Gen. Juan Jose Torres and assumes power." },
         { "day":"22", "month":"8", "year":"1971", "text": "FBI arrests members of The Camden 28, an anti-war group, as the group is raiding a draft office in Camden, NJ." },
         { "day":"22", "month":"8", "year":"1972", "text": "International Olympic Committee votes 36–31 with 3 abstentions to ban Rhodesia from the games because of the country’s racist policies." },
         { "day":"22", "month":"8", "year":"1975", "text": "US president Gerald Ford survives second assassination attempt in 17 days, this one by Sarah Jane Moore in San Francisco, Cal." },
         { "day":"22", "month":"8", "year":"1983", "text": "Benigno Aquino, the only real opposition on Ferdinand Marcos’ reign as president of the Philippines, is gunned down at Manila Airport." },
         { "day":"22", "month":"8", "year":"1989", "text": "First complete ring around Neptune discovered." },
         { "day":"22", "month":"8", "year":"1995", "text": "During 11-day siege at at Ruby Ridge, Id., FBI HRT sniper Lon Horiuchi kills Vicki Weaver while shooting at another target." },
         { "day":"22", "month":"8", "year":"2003", "text": "Alabama Chief Justice Roy Moore suspended for refusing to comply with federal court order to remove the Ten Commandments from the Alabama Supreme Court building’s lobby." },
         { "day":"22", "month":"8", "year":"2005", "text": "Art heist: a version of The Scream and Madonna, two paintings by Edvard Munch, are stolen at gunpoint from a museum in Oslo, Norway." },
         { "day":"22", "month":"8", "year":"2007", "text": "Most runs scored by any team in modern MLB history as the Texas Rangers thump the Baltimore Orioles 30-3." }
      ]
   }
]
