[
   {
      "facts":[
         { "day":"23", "month":"8", "year":"1244", "text": "Turks expel the crusaders under Frederick II from Jerusalem." },
         { "day":"23", "month":"8", "year":"1305", "text": "Scottish patriot William Wallace is hanged, drawn, beheaded, and quartered in London." },
         { "day":"23", "month":"8", "year":"1541", "text": "Jacques Cartier lands near Quebec on his third voyage to North America." },
         { "day":"23", "month":"8", "year":"1711", "text": "A British attempt to invade Canada by sea fails." },
         { "day":"23", "month":"8", "year":"1775", "text": "King George III of England refuses the American colonies’ offer of peace and declares them in open rebellion." },
         { "day":"23", "month":"8", "year":"1821", "text": "After 11 years of war, Spain grants Mexican independence as a constitutional monarchy." },
         { "day":"23", "month":"8", "year":"1863", "text": "Union batteries cease their first bombardment of Fort Sumter, leaving it a mass of rubble but still unconquered by the Northern besiegers." },
         { "day":"23", "month":"8", "year":"1900", "text": "Booker T. Washington forms the National Negro Business League in Boston, Massachusetts." },
         { "day":"23", "month":"8", "year":"1902", "text": "Fanny Farmer, among the first to emphasize the relationship of diet to health, opens her School of Cookery in Boston." },
         { "day":"23", "month":"8", "year":"1914", "text": "The Emperor of Japan declares war on Germany." },
         { "day":"23", "month":"8", "year":"1926", "text": "American film star Rudolph Valentino dies, causing world-wide hysteria and a number of suicides." },
         { "day":"23", "month":"8", "year":"1927", "text": "Immigrant laborers Nicola Sacco and Bartolomeo Vanzetti are executed for a robbery they did not commit. Fifty years later, in 1977, Massachusetts Governor Michael Dukakis establishes a memorial in the victims’ honor." },
         { "day":"23", "month":"8", "year":"1939", "text": "Joseph Stalin and German Foreign Minister Joachim von Ribbentrop sign a non-aggression pact between the Soviet Union and Germany, freeing Hitler to invade Poland and Stalin to invade Finland." },
         { "day":"23", "month":"8", "year":"1942", "text": "German forces begin an assault on the major Soviet industrial city of Stalingrad." },
         { "day":"23", "month":"8", "year":"1944", "text": "German SS engineers begin placing explosive charges around the Eiffel Tower in Paris." },
         { "day":"23", "month":"8", "year":"1950", "text": "Up to 77,000 members of the U.S. Army Organized Reserve Corps are called involuntarily to active duty to fight the Korean War." },
         { "day":"23", "month":"8", "year":"1952", "text": "Arab League security pact linking seven Arab States in a military, political and economic alliance goes into effect." },
         { "day":"23", "month":"8", "year":"1954", "text": "First flight of the C-130 Hercules transport aircraft." },
         { "day":"23", "month":"8", "year":"1958", "text": "The Second Taiwan Strait crisis begins: People’s Liberation Army bombards island of Quemoy during Chinese Civil War." },
         { "day":"23", "month":"8", "year":"1961", "text": "Belgium sends troops to Rwanda-Urundi during bloody Tutsi-Hutu conflict." },
         { "day":"23", "month":"8", "year":"1966", "text": "Lunar Orbiter 1 takes first photograph of Earth from the moon." },
         { "day":"23", "month":"8", "year":"1975", "text": "Pathet Lao communists occupy Vientiane, Laos." },
         { "day":"23", "month":"8", "year":"1977", "text": "Bryan Allen, piloting the Gossamer Condor, wins the Kremer prize for the first human-powered aircraft to fly a one-mile, figure-eight course." },
         { "day":"23", "month":"8", "year":"1979", "text": "Iranian army opens offensive against Kurds." },
         { "day":"23", "month":"8", "year":"1979", "text": "Bolshoi Ballet dancer Alexander Godunov defects in New York City." },
         { "day":"23", "month":"8", "year":"1990", "text": "Armenia declares independence from USSR." },
         { "day":"23", "month":"8", "year":"1990", "text": "East and West Germany announce they will unite on Oct 3." },
         { "day":"23", "month":"8", "year":"1996", "text": "Osama bin Laden issues message entitled \"A declaration of war against the Americans occupying the land of the two holy places.\"" },
         { "day":"23", "month":"8", "year":"2006", "text": "Natascha Kampusch,  was abducted at the age of 10 in Austria, escapes from her captor, Wolfgang Priklopil, after 8 years of captivity." },
         { "day":"23", "month":"8", "year":"2011", "text": "Libyan leader Muammar al-Gaddafi is overthrown after National Transitional Council forces take control of Bab al-Azizia compound during the 2011 Libyan Civil War." },
         { "day":"23", "month":"8", "year":"2011", "text": "A 5.8 earthquake centered at Mineral, Virginia, damages the Washington Monument, forcing the landmark to close for repairs." }
      ]
   }
]
