[
   {
      "facts":[
         { "day":"24", "month":"8", "year":"79", "text": "Mount Vesuvius erupts destroying Pompeii, Stabiae, Herculaneum and other smaller settlements." },
         { "day":"24", "month":"8", "year":"410", "text": "German barbarians sack Rome." },
         { "day":"24", "month":"8", "year":"1542", "text": "In South America, Gonzalo Pizarro returns to the mouth of the Amazon River after having sailed the length of the great river as far as the Andes Mountains." },
         { "day":"24", "month":"8", "year":"1572", "text": "Some 50,000 people are put to death in the ‘Massacre of St. Bartholomew’ as Charles IX of France attempts to rid the country of Huguenots." },
         { "day":"24", "month":"8", "year":"1780", "text": "King Louis XVI abolishes torture as a means to get suspects to confess." },
         { "day":"24", "month":"8", "year":"1814", "text": "British troops under General Robert Ross capture Washington, D.C., which they set on fire in retaliation for the American burning of the parliament building in York (Toronto), the capital of Upper Canada." },
         { "day":"24", "month":"8", "year":"1847", "text": "Charlotte Bronte, using the pseudonym Currer Bell, sends a manuscript of Jane Eyre to her publisher in London." },
         { "day":"24", "month":"8", "year":"1869", "text": "Cornelius Swarthout of Troy, New York, patents the waffle iron." },
         { "day":"24", "month":"8", "year":"1891", "text": "Thomas Edison files a patent for the motion picture camera." },
         { "day":"24", "month":"8", "year":"1894", "text": "Congress passes the first graduated income tax law, which is declared unconstitutional the next year." },
         { "day":"24", "month":"8", "year":"1896", "text": "Thomas Brooks is shot and killed by an unknown assailant begining a six year feud with the McFarland family." },
         { "day":"24", "month":"8", "year":"1912", "text": "By an act of Congress, Alaska is given a territorial legislature of two houses." },
         { "day":"24", "month":"8", "year":"1942", "text": "In the battle of the Eastern Solomons, the third carrier-versus-carrier battle of the war, U.S. naval forces defeat a Japanese force attempting to screen reinforcements for the Guadalcanal fighting." },
         { "day":"24", "month":"8", "year":"1948", "text": "Edith Mae Irby becomes the first African-American student to attend the University of Arkansas." },
         { "day":"24", "month":"8", "year":"1954", "text": "Congress outlaws the Communist Party in the United States." },
         { "day":"24", "month":"8", "year":"1963", "text": "US State Department cables embassy in Saigon that if South Vietnam’s president Ngo Dinh Diem does not remove his brother Ngo Dinh Nhu as his political adviser the US would explore alternative leadership, setting the stage for a coup by ARVN generals." },
         { "day":"24", "month":"8", "year":"1975", "text": "The principal leaders of Greece’s 1967 coup—Georgios Papadopoulos, Stylianos Pattakos, and Nikolaos Maarezos—sentenced to death for high treason, later commuted to life in prison." },
         { "day":"24", "month":"8", "year":"1981", "text": "Mark David Chapman sentenced to 20 years to life for murdering former Beatles band member John Lennon." },
         { "day":"24", "month":"8", "year":"1989", "text": "Colombian drug lords declare \"total and absolute war\" on Colombia’s government, booming the offices of two political parties and burning two politicians’ homes." },
         { "day":"24", "month":"8", "year":"1989", "text": "Baseball commissioner A. Bartlett Giamatti bans Pete Rose from baseball for gambling." },
         { "day":"24", "month":"8", "year":"1991", "text": "Mikhail Gorbachev resigns as head of the Comunist Party of the Soviet Union; Ukraine declares its independence from USSR." },
         { "day":"24", "month":"8", "year":"1992", "text": "Hurricane Andrew makes landfall in Florida. The Category 5 storm, which had already caused extensive damage in the Bahamas, caused $26.5 billion in US damages, caused 65 deaths, and felled 70,000 acres of trees in the Everglades." },
         { "day":"24", "month":"8", "year":"1994", "text": "Israel and the Palestinian Liberation Organization (PLO) create initial accord regarding partial self-rule for Palestinians living on the West Bank, the Agreement on Preparatory Transfer of Powers and Responsibilities." },
         { "day":"24", "month":"8", "year":"2004", "text": "Chechnyan suicide bombers blow up two airliners near Moscow, killing 89 passengers." },
         { "day":"24", "month":"8", "year":"2006", "text": "Pluto is downgraded to a dwarf planet when the International Astronomical Union (IAU) redefines \"planet.\"" },
         { "day":"24", "month":"8", "year":"2010", "text": "The Mexican criminal syndicate Los Zetas kills 72 illegal immigrants from Central and South America in San Fernando, Tamaulipas, Mexico." }
      ]
   }
]
