[
   {
      "facts":[
         { "day":"26", "month":"8", "year":"1071", "text": "Turks defeat the Byzantine army under Emperor Romanus IV at Manzikert, Eastern Turkey." },
         { "day":"26", "month":"8", "year":"1429", "text": "Joan of Arc makes a triumphant entry into Paris." },
         { "day":"26", "month":"8", "year":"1789", "text": "The Constituent Assembly in Versailles, France, approves the final version of the Declaration of Human Rights." },
         { "day":"26", "month":"8", "year":"1862", "text": "Confederate General Thomas ‘Stonewall’ Jackson seizes Manassas Junction, Virginia, and moves to encircle Union forces under General John Pope." },
         { "day":"26", "month":"8", "year":"1883", "text": "The Indonesian island of Krakatoa erupts in the largest explosion recorded in history, heard 2,200 miles away in Madagascar. The resulting destruction sends volcanic ash up 50 miles into the atmosphere and kills almost 36,000 people–both on the island itself and from the resulting 131-foot tidal waves that obliterate 163 villages on the shores of nearby Java and Sumatra." },
         { "day":"26", "month":"8", "year":"1920", "text": "The 19th Amendment to the Constitution is officially ratified, giving women the right to vote." },
         { "day":"26", "month":"8", "year":"1943", "text": "The United States recognizes the French Committee of National Liberation." },
         { "day":"26", "month":"8", "year":"1957", "text": "Ford Motor Company reveals the Edsel, its latest luxury car." },
         { "day":"26", "month":"8", "year":"1966", "text": "South African Defense Force troops attack a People’s Liberation Army of Nambia at Omugulugwombashe, the first battle of the 22-year Namibian War of Independence." },
         { "day":"26", "month":"8", "year":"1970", "text": "A nationwide Women’s Strike for Equality, led by Betty Friedan on the 50th anniversary of the passage of the 19th Amendment calls attention to unequal pay and other gender inequalities in America." },
         { "day":"26", "month":"8", "year":"1977", "text": "The National Assembly of Quebec adopts Bill 101, Charter of the French Language, making French the official language of the Canadian province." },
         { "day":"26", "month":"8", "year":"1978", "text": "Albino Luciani elected to the Papacy and chooses the name Pope John Paul I ; his 33-day reign is among the shortest in Papal history." },
         { "day":"26", "month":"8", "year":"1978", "text": "Sigmund Jähn becomes first German to fly in space, on board Soviet Soyuz 31." },
         { "day":"26", "month":"8", "year":"1999", "text": "Russia begins the Second Chechen War in response to the Invasion of Dagestan by the Islamic International Peacekeeping Brigade." }
      ]
   }
]
