[
   {
      "facts":[
         { "day":"30", "month":"8", "year":"1617", "text": "Rosa de Lima of Peru becomes the first American saint to be canonized." },
         { "day":"30", "month":"8", "year":"1721", "text": "The Peace of Nystad ends the Second Northern War between Sweden and Russia, giving Russia considerably more power in the Baltic region." },
         { "day":"30", "month":"8", "year":"1781", "text": "The French fleet arrives in the Chesapeake Bay to aid the American Revolution." },
         { "day":"30", "month":"8", "year":"1813", "text": "Creek Indians massacre over 500 whites at Fort Mims Alabama." },
         { "day":"30", "month":"8", "year":"1860", "text": "The first British tramway is inaugurated at Birkenhead by an American, George Francis Train." },
         { "day":"30", "month":"8", "year":"1861", "text": "Union General John Fremont declares martial law throughout Missouri and makes his own emancipation proclamation to free slaves in the state. President Lincoln overrules the general." },
         { "day":"30", "month":"8", "year":"1892", "text": "The Moravia, a passenger ship arriving from Germany, brings cholera to the United States." },
         { "day":"30", "month":"8", "year":"1932", "text": "Nazi leader Hermann Goering is elected president of the Reichstag." },
         { "day":"30", "month":"8", "year":"1944", "text": "Ploesti, the center of the Rumanian oil industry, falls to Soviet troops." },
         { "day":"30", "month":"8", "year":"1961", "text": "President John F. Kennedy appoints General Lucius D. Clay as his personal representative in Berlin." },
         { "day":"30", "month":"8", "year":"1963", "text": "Hot Line communications link installed between Moscow and Washington, DC." },
         { "day":"30", "month":"8", "year":"1967", "text": "US Senate confirms Thurgood Marshall as first African-American Supreme Court justice." },
         { "day":"30", "month":"8", "year":"1976", "text": "Tom Brokaw becomes news anchor of Today Show." },
         { "day":"30", "month":"8", "year":"1979", "text": "First recorded instance of a comet (Howard-Koomur-Michels) hitting the sun; the energy released is equal to approximately 1 million hydrogen bombs." },
         { "day":"30", "month":"8", "year":"1982", "text": "Yasser Arafat, leader of the Palestinian Liberation Organization (PLO) forced out of Lebanon after 10 years in Beirut during Lebanese Civil War." },
         { "day":"30", "month":"8", "year":"1983", "text": "Lieutenant Colonel Guion S. Bluford, Jr., becomes the first African-American astronaut to travel in space." },
         { "day":"30", "month":"8", "year":"1986", "text": "KGB arrest journalist Nicholas Daniloff (US News World Report) on a charge of spying and hold him for 13 days." },
         { "day":"30", "month":"8", "year":"1983", "text": "Eiffel Tower welcomes its 150 millionth visitor, 33-year-old Parisian Jacqueline Martinez." }
      ]
   }
]
