[
   {
      "facts":[
         { "day":"31", "month":"8", "year":"1303", "text": "The War of Vespers in Sicily ends with an agreement between Charles of Valois, who invaded the country, and Frederick, the ruler of Sicily." },
         { "day":"31", "month":"8", "year":"1756", "text": "The British at Fort William Henry, New York, surrender to Louis Montcalm of France." },
         { "day":"31", "month":"8", "year":"1802", "text": "Captain Merriwether Lewis leaves Pittsburgh to meet up with Captain William Clark and begin their trek to the Pacific Ocean." },
         { "day":"31", "month":"8", "year":"1864", "text": "At the Democratic convention in Chicago, General George B. McClellan is nominated for president." },
         { "day":"31", "month":"8", "year":"1919", "text": "The Communist Labor Party is founded in Chicago, with the motto, \"Workers of the world unite!\"" },
         { "day":"31", "month":"8", "year":"1928", "text": "Kurt Weill’s The Threepenny Opera opens in Berlin." },
         { "day":"31", "month":"8", "year":"1940", "text": "Joseph Avenol steps down as Secretary-General of the League of Nations." },
         { "day":"31", "month":"8", "year":"1942", "text": "The British army under General Bernard Law Montgomery defeats Field Marshal Erwin Rommel’s Afrika Korps in the Battle of Alam Halfa in Egypt." },
         { "day":"31", "month":"8", "year":"1944", "text": "The British Eighth Army penetrates the German Gothic Line in Italy." },
         { "day":"31", "month":"8", "year":"1949", "text": "Six of the 16 surviving Union veterans of the Civil War attend the last-ever encampment of the Grand Army of the Republic, held in Indianapolis, Indiana." },
         { "day":"31", "month":"8", "year":"1951", "text": "The 1st Marine Division begins its attack on Bloody Ridge in Korea. The four-day battle results in 2,700 Marine casualties." },
         { "day":"31", "month":"8", "year":"1961", "text": "A concrete wall replaces the barbed wire fence that separates East and West Germany, it will be called the Berlin wall." },
         { "day":"31", "month":"8", "year":"1965", "text": "US Congress creates Department of Housing & Urban Development." },
         { "day":"31", "month":"8", "year":"1968", "text": "The Dasht-e Bayaz 7.3 earthquake in NE Iran completely destroys five villages and severely damages six others." },
         { "day":"31", "month":"8", "year":"1970", "text": "Lonnie McLucas convicted of torturing and murdering fellow Black Panther Party member Alex Rackley in the first of the New Haven Black Panther Trials." },
         { "day":"31", "month":"8", "year":"1980", "text": "Polish government forced to sign Gdansk Agreement allowing creation of the trade union Solidarity." },
         { "day":"31", "month":"8", "year":"1985", "text": "Police capture Richard Ramirez, dubbed the \"Night Stalker\" for a string of gruesome murders that stretched from Mission Viejo to San Francisco, Cal." },
         { "day":"31", "month":"8", "year":"1986", "text": "A Russian cargo ship collides with cruise ship Admiral Nakhimov, killing 398." },
         { "day":"31", "month":"8", "year":"1987", "text": "Longest mine strike in South Africa’s history ends, after 11 people were killed, 500 injured and 400 arrested." },
         { "day":"31", "month":"8", "year":"1990", "text": "East and West Germany sign the Treaty of Unification (Einigungsvertrag) to join their legal and political systems." },
         { "day":"31", "month":"8", "year":"1990", "text": "Ken Griffey and Ken Griffey Jr. become first father and son to play on same team simultaneously in professional baseball (Seattle Mariners)." },
         { "day":"31", "month":"8", "year":"1994", "text": "Last Russian troops leave Estonia and Latvia." },
         { "day":"31", "month":"8", "year":"1994", "text": "The Irish Republican Army (IRA) announces a \"complete cessation of military operations,\" opening the way to a political settlement in Ireland for the first time in a quarter of a century." },
         { "day":"31", "month":"8", "year":"1997", "text": "Diana, Princess of Wales, dies in a Paris car crash along with her companion Dodi Fayed and driver Henri Paul while fleeing paparazzi." },
         { "day":"31", "month":"8", "year":"1997", "text": "New York Yankees retire Don Mattingly’s #23 (first baseman, coach, manager)." },
         { "day":"31", "month":"8", "year":"2006", "text": "Edvard Munch’s famed painting The Scream recovered by Norwegian police. The artwork had been stolen on Aug. 22, 2004." }
      ]
   }
]
