[
   {
      "facts":[
         { "day":"4", "month":"8", "year":"1265", "text": "King Henry III puts down a revolt of English barons lead by Simon de Montfort." },
         { "day":"4", "month":"8", "year":"1578", "text": "A crusade against the Moors of Morocco is routed at the Battle of Alcazar-el-Kebir. King Sebastian of Portugal and 8,000 of his soldiers are killed." },
         { "day":"4", "month":"8", "year":"1717", "text": "A friendship treaty is signed between France and Russia." },
         { "day":"4", "month":"8", "year":"1789", "text": "The Constituent Assembly in France abolishes the privileges of nobility." },
         { "day":"4", "month":"8", "year":"1790", "text": "The Revenue Cutter service, the parent service of the U.S. Navy and Coast Guard, is organized." },
         { "day":"4", "month":"8", "year":"1864", "text": "Federal troops fail to capture Fort Gaines on Dauphin Island, one of the Confederate forts defending Mobile Bay." },
         { "day":"4", "month":"8", "year":"1875", "text": "The first Convention of Colored Newspapermen is held in Cincinnati, Ohio." },
         { "day":"4", "month":"8", "year":"1879", "text": "A law is passed in Germany making Alsace Lorraine a territory of the empire." },
         { "day":"4", "month":"8", "year":"1914", "text": "Germany invades Belgium causing Great Britain to declare war on Germany." },
         { "day":"4", "month":"8", "year":"1942", "text": "The British government charges that Mohandas Gandhi and his All-Indian Congress Party favor \"appeasement\" with Japan." },
         { "day":"4", "month":"8", "year":"1944", "text": "RAF pilot T. D. Dean becomes the first pilot to destroy a V-1 buzz bomb when he tips the pilotless craft’s wing, sending it off course." },
         { "day":"4", "month":"8", "year":"1952", "text": "Helicopters from the U.S. Air Force Air Rescue Service land in Germany, completing the first transatlantic flight by helicopter in 51 hours and 55 minutes of flight time." },
         { "day":"4", "month":"8", "year":"1964", "text": "The bodies of civil rights workers Michael Schwerner, Andrew Goodman & James E Chaney, discovered in an earthen Mississippi dam." },
         { "day":"4", "month":"8", "year":"1964", "text": "The U.S.S. Maddox and Turner Joy exchange fire with North Vietnamese patrol boats." },
         { "day":"4", "month":"8", "year":"1971", "text": "US launches first satellite into lunar orbit from a manned spacecraft (Apollo 15)." },
         { "day":"4", "month":"8", "year":"1972", "text": "Arthur Bremer sentenced to 63 years for shooting Alabama governor George Wallace, later reduced to 53 years." },
         { "day":"4", "month":"8", "year":"1979", "text": "President Jimmy Carter establishes the Department of Energy." },
         { "day":"4", "month":"8", "year":"1988", "text": "US Senate votes to give each Japanese-American who was interned during WWII $20,000 compensation and an apology." },
         { "day":"4", "month":"8", "year":"2007", "text": "NASA launches Phoenix spacecraft on a mission to Mars." }
      ]
   }
]
