[
   {
      "facts":[
         { "day":"6", "month":"8", "year":"1497", "text": "John Cabot returns to England after his first successful journey to the Labrador coast." },
         { "day":"6", "month":"8", "year":"1863", "text": "The CSS Alabama captures the USS Sea Bride near the Cape of Good Hope." },
         { "day":"6", "month":"8", "year":"1888", "text": "Martha Turner is murdered by an unknown assailant, believed to be Jack the Ripper, in London, England." },
         { "day":"6", "month":"8", "year":"1890", "text": "William Kemmler becomes the first man to be executed by the electric chair." },
         { "day":"6", "month":"8", "year":"1904", "text": "The Japanese army in Korea surrounds a Russian army retreating to Manchuria." },
         { "day":"6", "month":"8", "year":"1914", "text": "Ellen Louise Wilson, the first wife of the twenty-eighth president, Woodrow Wilson, dies of Barite’s disease." },
         { "day":"6", "month":"8", "year":"1927", "text": "A Massachusetts high court hears the final plea from Sacco and Vanzetti, two Italians convicted of murder." },
         { "day":"6", "month":"8", "year":"1942", "text": "The Soviet city of Voronezh falls to the German army." },
         { "day":"6", "month":"8", "year":"1945", "text": "Paul Tibbets, the commander of Enola Gay, drops the first atomic bomb on Hiroshima, Japan.It was the second atomic bomb, dropped on Nagasaki, that induced the Japanese to surrender." },
         { "day":"6", "month":"8", "year":"1962", "text": "Jamaica becomes independent, after 300 years of British rule." },
         { "day":"6", "month":"8", "year":"1965", "text": "President Lyndon B. Johnson signs the Voting Rights Act, outlawing the literacy test for voting eligibility in the South." },
         { "day":"6", "month":"8", "year":"1972", "text": "Atlanta Braves’ right fielder Hank Arron hits his 660th and 661st home runs, setting the Major League record for most home runs by a player for a single franchise." },
         { "day":"6", "month":"8", "year":"1973", "text": "Singer-songwriter Stevie Wonder is in an automobile accident and goes into a four-day coma." },
         { "day":"6", "month":"8", "year":"1979", "text": "Twelve-year-old Marcus Hooper becomes the youngest person to swim the English Channel." },
         { "day":"6", "month":"8", "year":"1981", "text": "Argentina’s ex-resident Isabel Peron freed from house arrest." },
         { "day":"6", "month":"8", "year":"1988", "text": "A melee that became known as the Tompkins Square Park Police Riot in New York City leads to NYPD reforms." },
         { "day":"6", "month":"8", "year":"1991", "text": "Tim Berners-Lee publishes the first-ever website, Info.cern.ch." },
         { "day":"6", "month":"8", "year":"1993", "text": "Pope John Paul II publishes \"Veritatis splendor encyclical,\" regarding fundamentals of the Catholic Church’s role in moral teachings." },
         { "day":"6", "month":"8", "year":"1997", "text": "Microsoft announces it will invest $150 million in troubled rival Apple Computer, Inc." },
         { "day":"6", "month":"8", "year":"2012", "text": "New Zealand’s Mount Tongariro erupts for the first time since 1897." }
      ]
   }
]
