[
   {
      "facts":[
         { "day":"11", "month":"6", "year":"1346", "text": "Charles IV of Luxembourg is elected Holy Roman Emperor." },
         { "day":"11", "month":"6", "year":"1509", "text": "Henry VIII of England marries Catherine of Aragon." },
         { "day":"11", "month":"6", "year":"1770", "text": "Captain James Cook runs aground on the Great Barrier Reef." },
         { "day":"11", "month":"6", "year":"1798", "text": "Napoleon Bonaparte takes the island of Malta." },
         { "day":"11", "month":"6", "year":"1861", "text": "Union forces under General George B. McClellen repulse a Confederate force at Rich Mountain in western Virginia." },
         { "day":"11", "month":"6", "year":"1865", "text": "Major General Henry W. Halleck finds documents and archives of the Confederate government in Richmond, Virginia. This discovery will lead to the publication of the official war records." },
         { "day":"11", "month":"6", "year":"1895", "text": "Charles E. Duryea receives the first U.S. patent granted to an American inventor for a gasoline-driven automobile." },
         { "day":"11", "month":"6", "year":"1903", "text": "King Alexander and Queen Draga of Belgrade are assassinated by members of the Serbia army." },
         { "day":"11", "month":"6", "year":"1915", "text": "British troops take Cameroon in Africa." },
         { "day":"11", "month":"6", "year":"1927", "text": "Charles Lindbergh, a captain in the US Army Air Corps Reserve, receives the first Distinguished Flying Cross ever awarded, for his solo trans-Atlantic Flight." },
         { "day":"11", "month":"6", "year":"1930", "text": "William Beebe, of the New York Zoological Society, dives to a record-setting depth of 1,426 feet off the coast of Bermuda, in a diving chamber called a bathysphere." },
         { "day":"11", "month":"6", "year":"1934", "text": "The Disarmament Conference in Geneva ends in failure." },
         { "day":"11", "month":"6", "year":"1940", "text": "The Italian Air Force bombs the British fortress at Malta in the Mediterranean." },
         { "day":"11", "month":"6", "year":"1943", "text": "The Italian island of Pantelleria surrenders after a heavy air bombardment." },
         { "day":"11", "month":"6", "year":"1944", "text": "U.S. carrier-based planes attack Japanese airfields on Guam , Rota, Saipan and Tinian islands, preparing for the invasion of Saipan." },
         { "day":"11", "month":"6", "year":"1963", "text": "Dr. Martin Luther King, Jr. is arrested in Florida for trying to integrate restaurants." },
         { "day":"11", "month":"6", "year":"1967", "text": "Israel and Syria accept a U. N. cease-fire." },
         { "day":"11", "month":"6", "year":"1987", "text": "Margaret Thatcher wins her third consecutive term as Prime Minister." }
      ]
   }
]
