[
   {
      "facts":[
         { "day":"12", "month":"6", "year":"1442", "text": "Alfonso V of Aragon is crowned King of Naples." },
         { "day":"12", "month":"6", "year":"1812", "text": "Napoleon Bonaparte and his army invade Russia." },
         { "day":"12", "month":"6", "year":"1849", "text": "The gas mask is patented by L. P. Haslett." },
         { "day":"12", "month":"6", "year":"1862", "text": "Confederate General J. E. B. Stuart begins his ride around the Union Army outside of Richmond, Virginia." },
         { "day":"12", "month":"6", "year":"1901", "text": "Cuba agrees to become an American protectorate by accepting the Platt Amendment." },
         { "day":"12", "month":"6", "year":"1918", "text": "The first airplane bombing raid by an American unit occurs in France." },
         { "day":"12", "month":"6", "year":"1920", "text": "Republicans nominate Warren G. Harding for president and Calvin Coolidge for vice president." },
         { "day":"12", "month":"6", "year":"1921", "text": "President Warren Harding urges every young man to attend military training camp." },
         { "day":"12", "month":"6", "year":"1926", "text": "Brazil quits the League of Nations in protest over plans to admit Germany." },
         { "day":"12", "month":"6", "year":"1931", "text": "Gangster Al Capone and 68 of his henchmen are indicted for violating Prohibition laws." },
         { "day":"12", "month":"6", "year":"1937", "text": "Eight of Stalin’s generals are sentenced to death during purges in the Soviet Union." },
         { "day":"12", "month":"6", "year":"1942", "text": "American bombers strike the oil refineries of Ploesti, Rumania for the first time." },
         { "day":"12", "month":"6", "year":"1963", "text": "Black civil rights leader Medgar Evers is assassinated by a gunman outside his home in Jackson, Mississippi." },
         { "day":"12", "month":"6", "year":"1967", "text": "The Supreme Court rules that states cannot ban interracial marriages." },
         { "day":"12", "month":"6", "year":"1972", "text": "At a hearing in front the of a U.S. House of Representatives committee, Air Force General John Lavalle defends his orders on engagement in Vietnam." },
         { "day":"12", "month":"6", "year":"1977", "text": "David Berkowitz gets 25 years to life for the Son of Sam murders in New York." },
         { "day":"12", "month":"6", "year":"1985", "text": "The U.S. House of Representatives approves $27 million in aid to the Nicaraguan Contras." },
         { "day":"12", "month":"6", "year":"1991", "text": "Mount Pinatubo in the Phillipines begins erupting for the first time in 600 years." }
      ]
   }
]
