[
   {
      "facts":[
         { "day":"16", "month":"6", "year":"455", "text": "Rome is sacked by the Vandal army." },
         { "day":"16", "month":"6", "year":"1815", "text": "Napoleon defeats the Prussians at the Battle of Ligny." },
         { "day":"16", "month":"6", "year":"1858", "text": "Abraham Lincoln, in accepting the Republican nomination for the U.S. Senate in Illinois, declares that, \"A house divided against itself cannot stand.\"" },
         { "day":"16", "month":"6", "year":"1864", "text": "The siege of Petersburg and Richmond begins after a moonlight skirmish." },
         { "day":"16", "month":"6", "year":"1907", "text": "The Russian czar dissolves the Duma in St. Petersburg." },
         { "day":"16", "month":"6", "year":"1910", "text": "The first Father’s Day is celebrated in Spokane Washington." },
         { "day":"16", "month":"6", "year":"1925", "text": "France accepts a German proposal for a security pact." },
         { "day":"16", "month":"6", "year":"1932", "text": "The ban on Nazi storm troopers is lifted by the von Papen government in Germany." },
         { "day":"16", "month":"6", "year":"1935", "text": "President Roosevelt’s New Deal legislation is passed by the House of Representatives." },
         { "day":"16", "month":"6", "year":"1940", "text": "French Chief of State, Henri Petain asks for an armistice with Germany." },
         { "day":"16", "month":"6", "year":"1952", "text": "Anne Frank: Diary of a Young Girl is published in the United States." },
         { "day":"16", "month":"6", "year":"1955", "text": "The U.S. House of Representatives votes to extend Selective Service until 1959." },
         { "day":"16", "month":"6", "year":"1961", "text": "Ballet star Rudolf Nureyev defects from the Soviet Union while in Paris." },
         { "day":"16", "month":"6", "year":"1971", "text": "An El Greco sketch, \"The Immaculate Conception,\" stolen in Spain 35 years earlier, is recovered in New York City by the FBI." },
         { "day":"16", "month":"6", "year":"1977", "text": "Leonid Brezhnev is named president of the Soviet Union." }
      ]
   }
]
