[
   {
      "facts":[
         { "day":"18", "month":"6", "year":"1155", "text": "German-born Frederick I, Barbarossa, is crowned emperor of Rome." },
         { "day":"18", "month":"6", "year":"1667", "text": "The Dutch fleet sails up the Thames River and threatens London." },
         { "day":"18", "month":"6", "year":"1778", "text": "British troops evacuate Philadelphia." },
         { "day":"18", "month":"6", "year":"1812", "text": "The War of 1812 begins when the United States declares war against Great Britain." },
         { "day":"18", "month":"6", "year":"1815", "text": "At the Battle of Waterloo, Napoleon is defeated by an international army under the Duke of Wellington." },
         { "day":"18", "month":"6", "year":"1863", "text": "After repeated acts of insubordination, General Ulysses S. Grant relieves General John McClernand during the siege of Vicksburg." },
         { "day":"18", "month":"6", "year":"1864", "text": "At Petersburg, Union General Ulysses S. Grant realizes the town can no longer be taken by assault and settles into a siege." },
         { "day":"18", "month":"6", "year":"1873", "text": "Susan B. Anthony is fined $100 for attempting to vote for president." },
         { "day":"18", "month":"6", "year":"1918", "text": "Allied forces on the Western Front begin their largest counter-attack yet against the German army." },
         { "day":"18", "month":"6", "year":"1928", "text": "Amelia Earhart becomes the first woman to cross the Atlantic by airplane." },
         { "day":"18", "month":"6", "year":"1936", "text": "Mobster Charles ‘Lucky’ Luciano is found guilty on 62 counts of compulsory prostitution." },
         { "day":"18", "month":"6", "year":"1942", "text": "The U.S. Navy commissions its first black officer, Harvard University medical student Bernard Whitfield Robinson." },
         { "day":"18", "month":"6", "year":"1944", "text": "The U.S. First Army breaks through the German lines on the Cotentin Peninsula and cuts off the German-held port of Cherbourg." },
         { "day":"18", "month":"6", "year":"1945", "text": "Organized Japanese resistance ends on the island of Mindanao." },
         { "day":"18", "month":"6", "year":"1951", "text": "General Vo Nguyen Giap ends his Red River Campaign against the French in Indochina." },
         { "day":"18", "month":"6", "year":"1953", "text": "South Korean President Syngman Rhee releases Korean non-repatriate POWs against the will of the United Nations." },
         { "day":"18", "month":"6", "year":"1959", "text": "A Federal Court annuls the Arkansas law allowing school closings to prevent integration." },
         { "day":"18", "month":"6", "year":"1966", "text": "Samuel Nabrit becomes the first African American to serve on the Atomic Energy Commission." },
         { "day":"18", "month":"6", "year":"1979", "text": "President Jimmy Carter and Leonid Brezhnev sign the Salt II pact to limit nuclear arms." },
         { "day":"18", "month":"6", "year":"1983", "text": "Sally Ride becomes the first American woman in space." }
      ]
   }
]
