[
   {
      "facts":[
         { "day":"23", "month":"6", "year":"1683", "text": "William Penn signs a friendship treaty with the Lenni Lenape Indians in Pennsylvania." },
         { "day":"23", "month":"6", "year":"1700", "text": "Russia gives up its Black Sea fleet as part of a truce with the Ottoman Empire." },
         { "day":"23", "month":"6", "year":"1758", "text": "British and Hanoverian armies defeat the French at Krefeld in Germany." },
         { "day":"23", "month":"6", "year":"1760", "text": "Austrian forces defeat the Prussians at Landshut, Germany." },
         { "day":"23", "month":"6", "year":"1848", "text": "A bloody insurrection of workers erupts in Paris." },
         { "day":"23", "month":"6", "year":"1860", "text": "The U.S. Secret Service is created to arrest counterfeiters and protect the president." },
         { "day":"23", "month":"6", "year":"1863", "text": "Confederate forces overwhelm a Union garrison at the Battle of Brasher City in Louisiana." },
         { "day":"23", "month":"6", "year":"1865", "text": "Confederate General Stand Watie surrenders his army at Fort Towson, in the Oklahoma Territory." },
         { "day":"23", "month":"6", "year":"1884", "text": "A Chinese Army defeats the French at Bacle, Indochina." },
         { "day":"23", "month":"6", "year":"1885", "text": "Former general and president Ulysses S. Grant dies at the age of 63." },
         { "day":"23", "month":"6", "year":"1902", "text": "Germany, Austria-Hungary and Italy renew the Triple Alliance for a 12-year duration." },
         { "day":"23", "month":"6", "year":"1934", "text": "Italy gains the right to colonize Albania after defeating the country." },
         { "day":"23", "month":"6", "year":"1944", "text": "In one of the largest air strikes of the war, the U.S. Fifteenth Air Force sends 761 bombers against the oil refineries at Ploesti, Romania." },
         { "day":"23", "month":"6", "year":"1951", "text": "Soviet U.N. delegate Jacob Malik proposes cease-fire discussions in the Korean War." },
         { "day":"23", "month":"6", "year":"1952", "text": "The U.S. Air Force bombs power plants on Yalu River, Korea." },
         { "day":"23", "month":"6", "year":"1964", "text": "Henry Cabot Lodge resigns as the U.S. envoy to Vietnam and is succeeded by Maxwell Taylor." },
         { "day":"23", "month":"6", "year":"1966", "text": "Civil Rights marchers in Mississippi are dispersed by tear gas." }
      ]
   }
]
