[
   {
      "facts":[
         { "day":"24", "month":"6", "year":"217 BC", "text": "Carthaginian forces led by Hannibal destroy a Roman army under consul Gaius Flaminius in a battle at Lake Trasimene in central Italy." },
         { "day":"24", "month":"6", "year":"1314", "text": "Scottish forces, led by Robert the Bruce, win an overwhelming victory against English King Edward II at the Battle of Bannockburn." },
         { "day":"24", "month":"6", "year":"1340", "text": "The English fleet defeats the French fleet at Sluys, off the Flemish coast." },
         { "day":"24", "month":"6", "year":"1497", "text": "Explorer John Cabot lands in North America in present-day Canada." },
         { "day":"24", "month":"6", "year":"1509", "text": "Henry VIII is crowned King of England." },
         { "day":"24", "month":"6", "year":"1664", "text": "The colony of New Jersey, named after the Isle of Jersey, is founded." },
         { "day":"24", "month":"6", "year":"1647", "text": "Margaret Brent, demands a voice and a vote for herself in the Maryland colonial assembly." },
         { "day":"24", "month":"6", "year":"1675", "text": "King Philip’s War begins." },
         { "day":"24", "month":"6", "year":"1812", "text": "Napoleon crosses the Nieman River and invades Russia." },
         { "day":"24", "month":"6", "year":"1859", "text": "At the Battle of Solferino, also known as the Battle of the Three Sovereigns, the French army, led by Napoleon III, defeats the Austrian army under Franz Joseph I." },
         { "day":"24", "month":"6", "year":"1861", "text": "Federal gunboats attack Confederate batteries at Mathias Point, Virginia." },
         { "day":"24", "month":"6", "year":"1862", "text": "U.S. intervention saves the British and French at the Dagu forts in China." },
         { "day":"24", "month":"6", "year":"1896", "text": "Booker T. Washington becomes the first African American to receive an honorary MA degree from Harvard University." },
         { "day":"24", "month":"6", "year":"1910", "text": "The Japanese army invades Korea." },
         { "day":"24", "month":"6", "year":"1913", "text": "Greece and Serbia annul their alliance with Bulgaria following border disputes over Macedonia and Thrace." },
         { "day":"24", "month":"6", "year":"1931", "text": "The Soviet Union and Afghanistan sign a treaty of neutrality." },
         { "day":"24", "month":"6", "year":"1940", "text": "France signs an armistice with Italy." },
         { "day":"24", "month":"6", "year":"1941", "text": "President Franklin Roosevelt pledges all possible support to the Soviet Union." },
         { "day":"24", "month":"6", "year":"1943", "text": "Royal Air Force Bombers hammer Muelheim, Germany, in a drive to cripple the Ruhr industrial base." },
         { "day":"24", "month":"6", "year":"1948", "text": "The Soviet Union begins the Berlin Blockade, America responds with the Berlin Airlift." },
         { "day":"24", "month":"6", "year":"1953", "text": "John F. Kennedy and Jacqueline Bouvier announce their engagement." },
         { "day":"24", "month":"6", "year":"1955", "text": "Soviet MIG’s down a U.S. Navy patrol plane over the Bering Strait." },
         { "day":"24", "month":"6", "year":"1964", "text": "The Federal Trade Commission announces that, starting in 1965, cigarette makers must include warning labels about the harmful effects of smoking." },
         { "day":"24", "month":"6", "year":"1970", "text": "The U.S. Senate votes overwhelmingly to repeal the Gulf of Tonkin Resolution" }
      ]
   }
]
