[
   {
      "facts":[
         { "day":"25", "month":"6", "year":"841", "text": "Charles the Bald and Louis the German defeat Lothar at Fontenay." },
         { "day":"25", "month":"6", "year":"1658", "text": "Aurangzeb proclaims himself emperor of the Moghuls in India." },
         { "day":"25", "month":"6", "year":"1767", "text": "Mexican Indians riot as Jesuit priests are ordered home." },
         { "day":"25", "month":"6", "year":"1857", "text": "Gustave Flaubert goes on trial for public immorality regarding his novel, Madame Bovary." },
         { "day":"25", "month":"6", "year":"1862", "text": "The first day of the Seven Days’ campaign begins with fighting at Oak Grove, Virginia." },
         { "day":"25", "month":"6", "year":"1864", "text": "Union troops surrounding Petersburg, Virginia, begin building a mine tunnel underneath the Confederate lines." },
         { "day":"25", "month":"6", "year":"1868", "text": "The U.S. Congress enacts legislation granting an eight-hour day to workers employed by the federal government." },
         { "day":"25", "month":"6", "year":"1876", "text": "General George A. Custer and over 260 men of the Seventh Cavalry are wiped out by Sioux and Cheyenne Indians at Little Big Horn in Montana." },
         { "day":"25", "month":"6", "year":"1903", "text": "Marie Curie announces her discovery of radium." },
         { "day":"25", "month":"6", "year":"1920", "text": "The Greeks take 8,000 Turkish prisoners in Smyrna." },
         { "day":"25", "month":"6", "year":"1921", "text": "Samuel Gompers is elected head of the American Federation of Labor for the 40th time." },
         { "day":"25", "month":"6", "year":"1941", "text": "Finland declares war on the Soviet Union." },
         { "day":"25", "month":"6", "year":"1946", "text": "Ho Chi Minh travels to France for talks on Vietnamese independence." },
         { "day":"25", "month":"6", "year":"1948", "text": "The Soviet Union tightens its blockade of Berlin by intercepting river barges heading for the city." },
         { "day":"25", "month":"6", "year":"1950", "text": "North Korea invades South Korea, beginning the Korean War." },
         { "day":"25", "month":"6", "year":"1959", "text": "The Cuban government seizes 2.35 million acres under a new agrarian reform law." },
         { "day":"25", "month":"6", "year":"1962", "text": "The U.S. Supreme Court bans official prayers in public schools." },
         { "day":"25", "month":"6", "year":"1964", "text": "President Lyndon Johnson orders 200 naval personnel to Mississippi to assist in finding three missing civil rights workers." },
         { "day":"25", "month":"6", "year":"1973", "text": "White House Counsel John Dean admits President Nixon took part in the Watergate cover-up." },
         { "day":"25", "month":"6", "year":"1986", "text": "Congress approves $100 million in aid to the Contras fighting in Nicaragua." }
      ]
   }
]
