[
   {
      "facts":[
         { "day":"27", "month":"6", "year":"363", "text": "Roman Emperor Julian dies, ending the Pagan Revival." },
         { "day":"27", "month":"6", "year":"1743", "text": "English King George defeats the French at Dettingen, Bavaria." },
         { "day":"27", "month":"6", "year":"1833", "text": "Prudence Crandall, a white woman, is arrested for conducting an academy for black women in Canterbury, Conn." },
         { "day":"27", "month":"6", "year":"1862", "text": "Confederates break through the Union lines at the Battle of Gaines’ Mill–the third engagement of the Seven Days’ campaign." },
         { "day":"27", "month":"6", "year":"1864", "text": "General Sherman is repulsed by Confederates at the Battle of Kennesaw Mountain." },
         { "day":"27", "month":"6", "year":"1871", "text": "The yen becomes the new form of currency in Japan." },
         { "day":"27", "month":"6", "year":"1905", "text": "The crew of the Russian battleship Potemkin mutinies." },
         { "day":"27", "month":"6", "year":"1918", "text": "Two German pilots are saved by parachutes for the first time." },
         { "day":"27", "month":"6", "year":"1923", "text": "Yugoslav Premier Nikola Pachitch is wounded by Serb attackers in Belgrade." },
         { "day":"27", "month":"6", "year":"1924", "text": "Democrats offer Mrs. Leroy Springs the vice presidential nomination, the first woman considered for the job." },
         { "day":"27", "month":"6", "year":"1927", "text": "The U.S. Marines adopt the English bulldog as their mascot." },
         { "day":"27", "month":"6", "year":"1929", "text": "Scientists at Bell Laboratories in New York reveal a system for transmitting television pictures." },
         { "day":"27", "month":"6", "year":"1942", "text": "The Allied convoy PQ-17 leaves Iceland for Murmansk and Archangel." },
         { "day":"27", "month":"6", "year":"1944", "text": "Allied forces capture the port city of Cherbourg, France." },
         { "day":"27", "month":"6", "year":"1950", "text": "The UN Security Council calls on members for troops to aid South Korea." },
         { "day":"27", "month":"6", "year":"1963", "text": "Henry Cabot Lodge is appointed U.S. ambassador to South Vietnam." },
         { "day":"27", "month":"6", "year":"1973", "text": "President Richard Nixon vetoes a Senate ban on the Cambodia bombing." },
         { "day":"27", "month":"6", "year":"1985", "text": "The U.S. House of Representatives votes to limit the use of combat troops in Nicaragua." }
      ]
   }
]
