[
   {
      "facts":[
         { "day":"28", "month":"6", "year":"1635", "text": "The French colony of Guadeloupe is established in the Caribbean." },
         { "day":"28", "month":"6", "year":"1675", "text": "Frederick William of Brandenburg crushes the Swedes." },
         { "day":"28", "month":"6", "year":"1709", "text": "Russians defeat the Swedes and Cossacks at the Battle of Poltava." },
         { "day":"28", "month":"6", "year":"1776", "text": "Colonists repulse a British sea attack on Charleston, South Carolina." },
         { "day":"28", "month":"6", "year":"1778", "text": "Mary \"Molly Pitcher\" Hays McCauley, wife of an American artilleryman, carries water to the soldiers during the Battle of Monmouth." },
         { "day":"28", "month":"6", "year":"1839", "text": "Cinque and other Africans are kidnapped and sold into slavery in Cuba." },
         { "day":"28", "month":"6", "year":"1862", "text": "Fighting continues between Union and Confederate forces during the Seven Days’ campaign." },
         { "day":"28", "month":"6", "year":"1863", "text": "General Meade replaces General Hooker three days before the Battle of Gettysburg." },
         { "day":"28", "month":"6", "year":"1874", "text": "The Freedmen’s Bank, created to assist former slaves in the United States, closes. Customers of the bank lose $3 million." },
         { "day":"28", "month":"6", "year":"1884", "text": "Congress declares Labor Day a legal holiday." },
         { "day":"28", "month":"6", "year":"1902", "text": "Congress passes the Spooner bill, authorizing a canal to be built across the isthmus of Panama." },
         { "day":"28", "month":"6", "year":"1911", "text": "Samuel J. Battle becomes the first African-American policeman in New York City." },
         { "day":"28", "month":"6", "year":"1914", "text": "Austria’s Archduke Francis Ferdinand is assassinated at Sarajevo, Serbia." },
         { "day":"28", "month":"6", "year":"1919", "text": "Germany signs the Treaty of Versailles under protest." },
         { "day":"28", "month":"6", "year":"1921", "text": "A coal strike in Britain is settled after three months." },
         { "day":"28", "month":"6", "year":"1930", "text": "More than 1,000 communists are routed during an assault on the British consulate in London." },
         { "day":"28", "month":"6", "year":"1938", "text": "Congress creates the Federal Housing Administration (FHA) to insure construction loans." },
         { "day":"28", "month":"6", "year":"1942", "text": "German troops launch an offensive to seize Soviet oil fields in the Caucasus and the city of Stalingrad." },
         { "day":"28", "month":"6", "year":"1945", "text": "General Douglas MacArthur announces the end of Japanese resistance in the Philippines." },
         { "day":"28", "month":"6", "year":"1949", "text": "The last U.S. combat troops are called home from Korea, leaving only 500 advisers." },
         { "day":"28", "month":"6", "year":"1950", "text": "General Douglas MacArthur arrives in South Korea as Seoul falls to the North." },
         { "day":"28", "month":"6", "year":"1954", "text": "French troops begin to pull out of Vietnam’s Tonkin province." },
         { "day":"28", "month":"6", "year":"1964", "text": "Malcolm X founds the Organization for Afro-American Unity to seek independence for blacks in the Western Hemisphere." },
         { "day":"28", "month":"6", "year":"1967", "text": "14 people are shot during race riots in Buffalo, New York." },
         { "day":"28", "month":"6", "year":"1970", "text": "Muhammed Ali [Cassius Clay] stands before the Supreme Court regarding his refusal of induction into the U.S. Army during the Vietnam War." },
         { "day":"28", "month":"6", "year":"1971", "text": "The Supreme Court overturns the draft evasion conviction of Muhammad Ali." },
         { "day":"28", "month":"6", "year":"1972", "text": "Nixon announces that no new draftees will be sent to Vietnam." },
         { "day":"28", "month":"6", "year":"1976", "text": "The first women enter the U.S. Air Force Academy." }
      ]
   }
]
