[
   {
      "facts":[
         { "day":"3", "month":"6", "year":"1098", "text": "Christian Crusaders of the First Crusade seize Antioch, Turkey." },
         { "day":"3", "month":"6", "year":"1539", "text": "Hernando De Soto claims Florida for Spain." },
         { "day":"3", "month":"6", "year":"1861", "text": "Union troops defeat Confederate forces at Philippi, in western Virginia" },
         { "day":"3", "month":"6", "year":"1864", "text": "Some 7,000 Union troops are killed within 30 minutes during the Battle of Cold Harbor in Virginia." },
         { "day":"3", "month":"6", "year":"1888", "text": "The classic baseball poem \"Casey at the Bat,\" written by Ernest L. Thayer, is published in the San Francisco Examiner." },
         { "day":"3", "month":"6", "year":"1918", "text": "The Finnish Parliament ratifies a treaty with Germany." },
         { "day":"3", "month":"6", "year":"1923", "text": "In Italy, dictator Benito Mussolini grants women the right to vote." },
         { "day":"3", "month":"6", "year":"1928", "text": "Manchurian warlord Chian Tso-Lin dies as a result of a bomb blast set off by the Japanese." },
         { "day":"3", "month":"6", "year":"1938", "text": "The German Third Reich votes to confiscate so-called \"degenerate art.\"" },
         { "day":"3", "month":"6", "year":"1940", "text": "The German Luftwaffe hits Paris with 1,100 bombs." },
         { "day":"3", "month":"6", "year":"1942", "text": "Japanese carrier-based planes strafe Dutch Harbor in the Aleutian Islands as a diversion of the attack on Midway Island." },
         { "day":"3", "month":"6", "year":"1952", "text": "A rebellion by North Korean prisoners in the Koje prison camp in South Korea is put down by American troops." },
         { "day":"3", "month":"6", "year":"1965", "text": "Astronaut Edward White becomes the first American to walk in space when he exits the Gemini 4 space capsule." },
         { "day":"3", "month":"6", "year":"1969", "text": "74 American sailors died when the destroyer USS Frank E. Evans was cut in two by an Australian aircraft carrier in the South China Sea." },
         { "day":"3", "month":"6", "year":"1974", "text": "Charles Colson, an aide to President Richard Nixon, pleads guilty to obstruction of justice." },
         { "day":"3", "month":"6", "year":"1989", "text": "The Chinese government begins its crackdown on pro-democracy activists in Beijing’s Tiananmen Square. Hundreds are killed and thousands are arrested." }
      ]
   }
]
