[
   {
      "facts":[
         { "day":"5", "month":"6", "year":"1099", "text": "Members of the First Crusade witness an eclipse of the moon and interpret it as a sign they will recapture Jerusalem." },
         { "day":"5", "month":"6", "year":"1568", "text": "Ferdinand, the Duke of Alba, crushes the Calvinist insurrection in Ghent." },
         { "day":"5", "month":"6", "year":"1595", "text": "Henry IV’s army defeats the Spanish at the Battle of Fontaine-Francaise." },
         { "day":"5", "month":"6", "year":"1637", "text": "American settlers in New England massacre a Pequot Indian village." },
         { "day":"5", "month":"6", "year":"1783", "text": "Joseph and Jacques Montgolfier make the first public balloon flight." },
         { "day":"5", "month":"6", "year":"1794", "text": "The U.S. Congress prohibits citizens from serving in any foreign armed forces." },
         { "day":"5", "month":"6", "year":"1827", "text": "Athens falls to Ottoman forces." },
         { "day":"5", "month":"6", "year":"1851", "text": "Harriet Beecher Stow publishes the first installment of Uncle Tom’s Cabin in The National Era." },
         { "day":"5", "month":"6", "year":"1856", "text": "U.S. Army troops in the Four creeks region of California, head back to quarters, officially ending the Tule River War. Fighting, however, will continue for a few more years." },
         { "day":"5", "month":"6", "year":"1863", "text": "The Confederate raider CSS Alabama captures the Talisman in the Mid-Atlantic." },
         { "day":"5", "month":"6", "year":"1872", "text": "The Republican National Convention, the first major political party convention to includes blacks, commences." },
         { "day":"5", "month":"6", "year":"1880", "text": "Wild woman of the west Myra Maybelle Shirley marries Sam Starr even though records show she was already married to Bruce Younger." },
         { "day":"5", "month":"6", "year":"1900", "text": "British troops under Lord Roberts seize Pretoria from the Boers." },
         { "day":"5", "month":"6", "year":"1940", "text": "The German army begins its offensive in Southern France." },
         { "day":"5", "month":"6", "year":"1944", "text": "The first B-29 bombing raid strikes the Japanese rail line in Bangkok, Thailand." },
         { "day":"5", "month":"6", "year":"1947", "text": "Secretary of State George C. Marshall outlines \"The Marshall Plan,\" a program intended to assist European nations, including former enemies, to rebuild their economies." },
         { "day":"5", "month":"6", "year":"1956", "text": "Premier Nikita Khrushchev denounces Josef Stalin to the Soviet Communist Party Congress." },
         { "day":"5", "month":"6", "year":"1967", "text": "The Six-Day War between Israel and Egypt, Syria and Jordan begins." },
         { "day":"5", "month":"6", "year":"1968", "text": "Sirhan Sirhan shoots Democratic presidential candidate Robert F. Kennedy after Kennedy’s victory in the pivotal California primary election." },
         { "day":"5", "month":"6", "year":"1973", "text": "Doris A. Davis becomes the first African-American woman to govern a city in a major metropolitan area when she is elected mayor of Compton, California." },
         { "day":"5", "month":"6", "year":"2004", "text": "Former U.S. President Ronald Reagan dies at age 93. Reagan was the 40th president of the United States." }
      ]
   }
]
