[
   {
      "facts":[
         { "day":"6", "month":"6", "year":"1523", "text": "Gustav Vasa becomes king of Sweden." },
         { "day":"6", "month":"6", "year":"1641", "text": "Spain loses Portugal." },
         { "day":"6", "month":"6", "year":"1674", "text": "Sivaji crowns himself King of India." },
         { "day":"6", "month":"6", "year":"1813", "text": "The United States invasion of Canada is halted at Stony Creek, Ontario." },
         { "day":"6", "month":"6", "year":"1862", "text": "The city of Memphis surrenders to the Union navy after an intense naval engagement on the Mississippi River." },
         { "day":"6", "month":"6", "year":"1865", "text": "Confederate raider Wiliam Quantrill dies from a wound received while escaping a Union patrol near Taylorsville, Kentucky." },
         { "day":"6", "month":"6", "year":"1918", "text": "U.S. Marines enter combat at the Battle of Belleau Wood." },
         { "day":"6", "month":"6", "year":"1924", "text": "The German Reichstag accepts the Dawes Plan, an American plan to help Germany pay off its war debts." },
         { "day":"6", "month":"6", "year":"1930", "text": "Frozen foods are sold commercially for the first time." },
         { "day":"6", "month":"6", "year":"1934", "text": "President Franklin Roosevelt signs the Securities Exchange Act, establishing the Securities and Exchange Commission." },
         { "day":"6", "month":"6", "year":"1941", "text": "The U.S. government authorizes the seizure of foreign ships in U.S. ports." },
         { "day":"6", "month":"6", "year":"1944", "text": "D-Day: Operation Overlord lands 400,000 Allied American, British, and Canadian troops on the beaches of Normandy in German-occupied France." },
         { "day":"6", "month":"6", "year":"1961", "text": "Swiss psychiatrist Carl Gustav Jung, one of the founders of modern psychiatry, dies." },
         { "day":"6", "month":"6", "year":"1966", "text": "African American James Meridith is shot and wounded while on a solo march in Mississippi to promote voter registration among blacks." },
         { "day":"6", "month":"6", "year":"1982", "text": "Israel invades southern Lebanon." },
         { "day":"6", "month":"6", "year":"1985", "text": "The body of Nazi war criminal Dr. Josef Mengele is located and exhumed near Sao Paolo, Brazil." }
      ]
   }
]
