[
   {
      "facts":[
         { "day":"1", "month":"11", "year":"79", "text": "The city of Pompeii is buried by eruption of Mt. Vesuvius." },
         { "day":"1", "month":"11", "year":"1512", "text": "Michelangelo’s painting on the Sistine Chapel ceiling is exhibited for the first time." },
         { "day":"1", "month":"11", "year":"1582", "text": "Maurice of Nassau, the son of William of Orange, becomes the governor of Holland, Zeeland and Utrecht." },
         { "day":"1", "month":"11", "year":"1755", "text": "A great earthquake at Lisbon, Portugal, kills over 50,000 people." },
         { "day":"1", "month":"11", "year":"1765", "text": "The Stamp Act goes into effect in the British colonies." },
         { "day":"1", "month":"11", "year":"1861", "text": "Lieutenant General Winfield Scott, 50 year-veteran and leader of the U.S. Army at the onset of the Civil War, retires. General George McClellan is appointed general-in-chief of the Union armies." },
         { "day":"1", "month":"11", "year":"1866", "text": "Wild woman of the west Myra Maybelle Shirley (Belle Starr) marries James C. Reed in Collins County, Texas." },
         { "day":"1", "month":"11", "year":"1869", "text": "Louis Riel seizes Fort Garry, Winnipeg, during the Red River Rebellion." },
         { "day":"1", "month":"11", "year":"1911", "text": "Italian planes perform the first aerial bombing on Tanguira oasis in Libya." },
         { "day":"1", "month":"11", "year":"1923", "text": "Goodyear Tire and Rubber Company buys the rights to manufacture Zeppelin dirigibles." },
         { "day":"1", "month":"11", "year":"1924", "text": "Legendary Oklahoma marshal Bill Tilghman, 71, is gunned down by a drunk in Cromwell, Oklahoma." },
         { "day":"1", "month":"11", "year":"1936", "text": "Italian Fascist leader Benito Mussolini announces the Rome-Berlin axis after Count Ciano’s visit to Germany." },
         { "day":"1", "month":"11", "year":"1936", "text": "The Rodeo Cowboy’s Association is founded." },
         { "day":"1", "month":"11", "year":"1943", "text": "American troops invade Bougainville in the Solomon Islands." },
         { "day":"1", "month":"11", "year":"1945", "text": "John H. Johnson publishes the first issue of Ebony magazine." },
         { "day":"1", "month":"11", "year":"1950", "text": "Two members of a Puerto Rican nationalist movement attempt to assassinate President Harry S Truman." },
         { "day":"1", "month":"11", "year":"1951", "text": "Algerian National Liberation Front begins guerrilla warfare against the French." },
         { "day":"1", "month":"11", "year":"1967", "text": "The first issue of Rolling Stone hits the streets." },
         { "day":"1", "month":"11", "year":"1968", "text": "President Lyndon B. Johnson calls a halt to bombing in Vietnam, hoping this will lead to progress at the Paris peace talks." },
         { "day":"1", "month":"11", "year":"1968", "text": "The Motion Picture Association of America officially introduces its rating system to indicate age-appropriateness of film content." },
         { "day":"1", "month":"11", "year":"1973", "text": "Leon Jaworski appointed as new Watergate Special  Prosecutor." },
         { "day":"1", "month":"11", "year":"1981", "text": "Antigua and Barbuda gain independence from the United Kingdom." },
         { "day":"1", "month":"11", "year":"1982", "text": "Honda opens a plant in Marysville, Ohio, becoming the first Asian automobile company to produce cars in the US." },
         { "day":"1", "month":"11", "year":"2000", "text": "Serbia joins the United Nations." }
      ]                                            
   }
]
