[
   {
      "facts":[
         { "day":"11", "month":"11", "year":"1499", "text": "Pretender to the throne Perkin Warbeck is executed." },
         { "day":"11", "month":"11", "year":"1778", "text": "Indians, led by William Butler, massacre the inhabitants of Cherry Valley, N.Y." },
         { "day":"11", "month":"11", "year":"1831", "text": "Nat Turner, a slave who led a revolt against slave owners, is hanged in Jerusalem, Virginia." },
         { "day":"11", "month":"11", "year":"1889", "text": "Washington becomes the 42nd state of the Union." },
         { "day":"11", "month":"11", "year":"1909", "text": "Construction begins on the naval base at Pearl Harbor in Hawaii." },
         { "day":"11", "month":"11", "year":"1918", "text": "The German leaders sign the armistice ending World War I." },
         { "day":"11", "month":"11", "year":"1919", "text": "The first two-minutes’ silence is observed in Britain to commemorate those who died in the Great War." },
         { "day":"11", "month":"11", "year":"1921", "text": "The Tomb of the Unknown Soldier at Arlington Cemetery is dedicated." },
         { "day":"11", "month":"11", "year":"1922", "text": "Canada’s Vernon McKenzie urges to fight U.S. propaganda with taxes on U.S. magazines." },
         { "day":"11", "month":"11", "year":"1933", "text": "The first of the great dust storms of the 1930s hits North Dakota." },
         { "day":"11", "month":"11", "year":"1935", "text": "Albert Anderson and Orvil Anderson set a new altitude record in South Dakota, when they float to 74,000 feet in a balloon." },
         { "day":"11", "month":"11", "year":"1938", "text": "Irving Berlin’s \"God Bless America\" is performed for the first time by singer Kate Smith." },
         { "day":"11", "month":"11", "year":"1940", "text": "Britain’s Royal Navy attacks the Italian fleet at Taranto." },
         { "day":"11", "month":"11", "year":"1944", "text": "Private Eddie Slovik is convicted of desertion and sentenced to death for refusing to join his unit in the European Theater of Operations." },
         { "day":"11", "month":"11", "year":"1953", "text": "The polio virus is identified and photographed for the first time in Cambridge, Massachusetts." },
         { "day":"11", "month":"11", "year":"1966", "text": "The United States launches Gemini 12, a two-man orbiter, into orbit." },
         { "day":"11", "month":"11", "year":"1970", "text": "U.S. Army Special Forces raid the Son Tay prison camp in North Vietnam but find no prisoners." },
         { "day":"11", "month":"11", "year":"1973", "text": "Israel and Egypt sign a cease-fire." },
         { "day":"11", "month":"11", "year":"1973", "text": "The Soviet Union is kicked out of World Cup soccer for refusing to play Chile." },
         { "day":"11", "month":"11", "year":"1987", "text": "An unidentified buyer buys Vincent Van Gogh’s painting \"Irises\" from the estate of Joan Whitney Payson for $53.9 million at Sotheby’s in New York." },
         { "day":"11", "month":"11", "year":"1993", "text": "Sculpture honoring women who served in the Vietnam War dedicated at the Vietnam Veterans Memorial in Washington, DC." },
         { "day":"11", "month":"11", "year":"1999", "text": "House of Lords Act reforming Britain’s House of Lords, given Royal Assent; the act removed the right to hereditary seats (sitting members were permitted to remain)." },
         { "day":"11", "month":"11", "year":"2001", "text": "Journalists Pierre Billaud (France), Johanne Sutton (France) and Voker Handloik (Germany) killed in Afghanistan during an attack on the convoy in which they were traveling." },
         { "day":"11", "month":"11", "year":"2004", "text": "New Zealand Tomb of the Unknown Warrior dedicated at the National War Museum, Wellington." },
         { "day":"11", "month":"11", "year":"2004", "text": "Palestine Liberation organization confirms the death of its longtime chairman Yasser Arafat; cause of death has never been conclusively determined." },
         { "day":"11", "month":"11", "year":"2006", "text": "Queen Elizabeth II unveils New Zealand War Memorial in London." },
         { "day":"11", "month":"11", "year":"2008", "text": "RMS Queen Elizabeth 2 (QE2)sets sail on her final voyage, bound for Dubai." }
      ]
   }
]
