[
   {
      "facts":[
         { "day":"12", "month":"11", "year":"1035", "text": "King Canute of Norway dies." },
         { "day":"12", "month":"11", "year":"1276", "text": "Suspicious of the intentions of Llywelyn ap Gruffydd, the Prince of Wales, English King Edward I resolves to invade Wales." },
         { "day":"12", "month":"11", "year":"1859", "text": "The first flying-trapeze circus act is performed by Jules Leotard at the Circus Napoleon." },
         { "day":"12", "month":"11", "year":"1863", "text": "Confederate General James Longstreet arrives at Loudon, Tennessee, to assist the attack on Union General Ambrose Burnside’s troops at Knoxville." },
         { "day":"12", "month":"11", "year":"1867", "text": "Mount Vesuvius erupts." },
         { "day":"12", "month":"11", "year":"1903", "text": "The Lebaudy brothers of France set an air-travel distance record of 34 miles in a dirigible." },
         { "day":"12", "month":"11", "year":"1923", "text": "Adolf Hitler is arrested for his attempted German coup." },
         { "day":"12", "month":"11", "year":"1927", "text": "Canada is admitted to the League of Nations." },
         { "day":"12", "month":"11", "year":"1928", "text": "The ocean liner Vestris sinks off the Virginia cape with 328 aboard, killing 111." },
         { "day":"12", "month":"11", "year":"1938", "text": "Mexico agrees to compensate the United States for land seizures." },
         { "day":"12", "month":"11", "year":"1941", "text": "Madame Lillian Evanti and Mary Cardwell Dawson establish the National Negro Opera Company." },
         { "day":"12", "month":"11", "year":"1944", "text": "U.S. fighters wipe out a Japanese convoy near Leyte, consisting of six destroyers, four transports and 8,000 troops." },
         { "day":"12", "month":"11", "year":"1944", "text": "The German battleship Tirpitz is sunk in a Norwegian fjord." },
         { "day":"12", "month":"11", "year":"1948", "text": "Hikedi Tojo, Japanese prime minister, and seven others are sentenced to hang by an international tribunal." },
         { "day":"12", "month":"11", "year":"1951", "text": "The U.S. Eighth Army in Korea is ordered to cease offensive operations and begin an active defense." },
         { "day":"12", "month":"11", "year":"1960", "text": "The satellite Discoverer XVII is launched into orbit from California’s Vandenberg AFB." },
         { "day":"12", "month":"11", "year":"1968", "text": "The U.S. Supreme Court voids an Arkansas law banning the teaching of evolution in public schools." },
         { "day":"12", "month":"11", "year":"1971", "text": "President Richard Nixon announces the withdrawal of about 45,000 U.S. troops from Vietnam by February." },
         { "day":"12", "month":"11", "year":"1987", "text": "Boris Yeltsin is fired as head of Moscow’s Communist Party for criticizing the slow pace of reform." },
         { "day":"12", "month":"11", "year":"1990", "text": "Crown Prince Akihito is formally installed as Emperor Akihito of Japan." },
         { "day":"12", "month":"11", "year":"1990", "text": "Sir Timothy John \"Tim\" Berners-Lee, a British computer scientist, publishes a formal proposal for the creation of the World Wide Web." },
         { "day":"12", "month":"11", "year":"1996", "text": "A Saudi Arabian Airlines Boeing 747 collides with a Kazakh Illyushin II-76 cargo plane near New Delhi, killing 349. It is the deadliest mid-air collision to date (2013) and third-deadliest aircraft accident." },
         { "day":"12", "month":"11", "year":"1997", "text": "Ramzi Yousef convicted of masterminding the 1993 World Trade Center bombing." },
         { "day":"12", "month":"11", "year":"2003", "text": "The first Italians to die in the Iraq War are among 23 fatalities from a suicide bomb attack on an Italian police base in Nasiriya, iraq." },
         { "day":"12", "month":"11", "year":"2003", "text": "Shanghai Transrapid sets a new world speed record (311 mph or 501 kph) for commercial railway systems." }
      ]
   }
]
