[
   {
      "facts":[
         { "day":"13", "month":"11", "year":"1474", "text": "In the Swiss-Burgundian Wars, Swiss infantry shatters the army of Charles the Bold at Hericourt near Belfort, countering his march to Lorraine." },
         { "day":"13", "month":"11", "year":"1835", "text": "Texans officially proclaim independence from Mexico, and calls itself the Lone Star Republic, after its flag, until its admission to the Union in 1845." },
         { "day":"13", "month":"11", "year":"1851", "text": "The London-to-Paris telegraph begins operation." },
         { "day":"13", "month":"11", "year":"1860", "text": "South Carolina’s legislature calls a special convention to discuss secession from the Union." },
         { "day":"13", "month":"11", "year":"1862", "text": "Lewis Carroll writes in his diary, “Began writing the fairy-tale of Alice–I hope to finish it by Christmas.”" },
         { "day":"13", "month":"11", "year":"1878", "text": "New Mexico Governor Lew Wallace offers amnesty to many participants of the Lincoln County War, but not to gunfighter Billy the Kid." },
         { "day":"13", "month":"11", "year":"1897", "text": "The first metal dirigible is flown from Tempelhof Field in Berlin." },
         { "day":"13", "month":"11", "year":"1907", "text": "Paul Corno achieves the first helicopter flight." },
         { "day":"13", "month":"11", "year":"1914", "text": "The brassiere, invented by Caresse Crosby, is patented." },
         { "day":"13", "month":"11", "year":"1927", "text": "New York’s Holland Tunnel officially opens for traffic." },
         { "day":"13", "month":"11", "year":"1940", "text": "U.S. Supreme Court rules in Hansberry v. Lee that African Americans cannot be barred from white neighborhoods." },
         { "day":"13", "month":"11", "year":"1941", "text": "A German U-boat, the U-81 torpedoes Great Britain’s premier aircraft carrier, the HMS Ark Royal. The ship sinks the next day." },
         { "day":"13", "month":"11", "year":"1942", "text": "Lt. Gen. Dwight D. Eisenhower flies to Algeria to conclude an agreement with French Admiral Jean Darlan.." },
         { "day":"13", "month":"11", "year":"1945", "text": "Charles de Gaulle is elected president of France." },
         { "day":"13", "month":"11", "year":"1952", "text": "Harvard’s Paul Zoll becomes the first man to use electric shock to treat cardiac arrest." },
         { "day":"13", "month":"11", "year":"1956", "text": "The U.S. Supreme Court unanimously strikes down two Alabama laws requiring racial segregation on public buses." },
         { "day":"13", "month":"11", "year":"1969", "text": "Anti-war protesters stage a symbolic “March Against Death” in Washington, DC." },
         { "day":"13", "month":"11", "year":"1970", "text": "A powerful tropical cyclone strikes the Ganges Delta region of East Pakistan (now Bangladesh), causing an estimated half-million deaths in a single night; the Bhola cyclone is regarded as the worst natural disaster of the 20th century." },
         { "day":"13", "month":"11", "year":"1982", "text": "The Vietnam Veterans Memorial dedicated in Washington, DC." },
         { "day":"13", "month":"11", "year":"1985", "text": "Some 23,000 people die when the Nevado del Ruiz erupts, melting a glacier and causing a massive mudslide that buries Armero, Columbia." },
         { "day":"13", "month":"11", "year":"1989", "text": "Compact of Free Association: the Federated States of Micronesia, the Republic of the Marshall Islands, and the Republic of Palau—places US troops wrested from Japanese control in WWII—become sovereign nations, associated states of the United States." },
         { "day":"13", "month":"11", "year":"1989", "text": "Hans-Adam II becomes Prince of Liechtenstein (1989– ) upon the death of his father, Franz Joseph II." },
         { "day":"13", "month":"11", "year":"2000", "text": "Articles of impeachment passed against Philippine President Joseph Estrada." },
         { "day":"13", "month":"11", "year":"2001", "text": "US President George W. Bush signs an executive order allowing military tribunals against foreigners suspected of connections to planned or actual terrorist acts against the US." }
      ]
   }
]
