[
   {
      "facts":[
         { "day":"14", "month":"11", "year":"1501", "text": "Arthur Tudor of England marries Katherine of Aragon." },
         { "day":"14", "month":"11", "year":"1812", "text": "As Napoleon Bonaparte’s army retreats form Moscow, temperatures drop to 20 degrees below zero." },
         { "day":"14", "month":"11", "year":"1851", "text": "Herman Melville’s novel Moby Dick is published in New York." },
         { "day":"14", "month":"11", "year":"1882", "text": "Billy Clairborne, a survivor of the Gunfight at the O.K. Corral, loses his life in a shoot-out with Buckskin Frank Leslie." },
         { "day":"14", "month":"11", "year":"1908", "text": "Albert Einstein presents his quantum theory of light." },
         { "day":"14", "month":"11", "year":"1910", "text": "Lieutenant Eugene Ely, U.S. Navy, becomes the first man to take off in an airplane from the deck of a ship. He flew from the ship Birmingham at Hampton Roads to Norfolk." },
         { "day":"14", "month":"11", "year":"1921", "text": "The Cherokee Indians ask the U.S. Supreme Court to review their claim to 1 million acres of land in Texas." },
         { "day":"14", "month":"11", "year":"1922", "text": "The British Broadcasting Company (BBC) begins the first daily radio broadcasts from Marconi House." },
         { "day":"14", "month":"11", "year":"1930", "text": "Right-wing militarists in Japan attempt to assassinate Premier Hamagushi." },
         { "day":"14", "month":"11", "year":"1935", "text": "Manuel Luis Quezon is sworn in as the first Filipino president, as the Commonwealth of the Philippines is inaugurated." },
         { "day":"14", "month":"11", "year":"1940", "text": "German bombers devastate Coventry in Great Britain, killing 1,000 in the worst air raid of the war." },
         { "day":"14", "month":"11", "year":"1951", "text": "The United States and Yugoslavia sign a military aid pact." },
         { "day":"14", "month":"11", "year":"1951", "text": "French paratroopers capture Hoa Binh, Vietnam." },
         { "day":"14", "month":"11", "year":"1960", "text": "New Orleans integrates two all-white schools." },
         { "day":"14", "month":"11", "year":"1960", "text": "President Dwight Eisenhower orders U.S. naval units into the Caribbean after Guatemala and Nicaragua charge Castro with starting uprisings." },
         { "day":"14", "month":"11", "year":"1961", "text": "President Kennedy increases the number of American advisors in Vietnam from 1,000 to 16,000." },
         { "day":"14", "month":"11", "year":"1963", "text": "Iceland gets a new island when a volcano pushes its way up out of the sea five miles off the southern coast." },
         { "day":"14", "month":"11", "year":"1963", "text": "Greece frees hundreds who were jailed in the Communist uprising of 1944-1950." },
         { "day":"14", "month":"11", "year":"1965", "text": "The U.S. First Cavalry Division battles with the North Vietnamese Army in the Ia Drang Valley, the first ground combat for American troops." },
         { "day":"14", "month":"11", "year":"1968", "text": "Yale University announces its plan to go co-ed." },
         { "day":"14", "month":"11", "year":"1969", "text": "The United States launches Apollo 12, the second mission to the Moon, from Cape Kennedy." },
         { "day":"14", "month":"11", "year":"1979", "text": "US President Jimmy Carter freezes all Iranian assets in the United States in response to Iranian militants holding more than 50 Americans hostage." },
         { "day":"14", "month":"11", "year":"1982", "text": "Lech Walesa, leader of Poland’s outlawed Solidarity movement, is released by communist authorities after 11 months confinement; he would win the Nobel Peace Prize in 1983 and be elected Poland’s president in 1990." },
         { "day":"14", "month":"11", "year":"1984", "text": "The Space Shuttle Discovery‘s crew rescues a second satellite." },
         { "day":"14", "month":"11", "year":"1990", "text": "Poland and the Federal Republic of Germany sign a treaty officially making the Oder-Neisse line the border between their countries." },
         { "day":"14", "month":"11", "year":"1995", "text": "Budget standoff between Democrats and Republicans in the US Congress forces temporary closure of national parks and museums; federal agencies forced to operate with skeleton staff." },
         { "day":"14", "month":"11", "year":"2001", "text": "Northern Alliance fighters take control of Afghanistan’s capital, Kabul." },
         { "day":"14", "month":"11", "year":"2008", "text": "First G-20 economic summit convenes, in Washington, DC." },
         { "day":"14", "month":"11", "year":"2012", "text": "Israel launches Operation Pillar of Defense against the Hamas-governed Gaza Strip." }
      ]
   }
]
