[
   {
      "facts":[
         { "day":"17", "month":"11", "year":"375", "text": "Enraged by the insolence of barbarian envoys, Valentinian, the Emperor of the West, dies of apoplexy in Pannonia in Central Europe." },
         { "day":"17", "month":"11", "year":"1558", "text": "Queen Elizabeth ascends to the throne of England." },
         { "day":"17", "month":"11", "year":"1558", "text": "The Church of England is re-established." },
         { "day":"17", "month":"11", "year":"1636", "text": "Henrique Dias, Brazilian general, wins a decisive battle against the Dutch in Brazil." },
         { "day":"17", "month":"11", "year":"1796", "text": "Napoleon Bonaparte defeats an Italian army near the Alpone River, Italy." },
         { "day":"17", "month":"11", "year":"1800", "text": "The Sixth Congress (2nd session) convenes for the first time in Washington, D.C." },
         { "day":"17", "month":"11", "year":"1842", "text": "A grim abolitionist meeting is held in Marlboro Chapel, Boston, after the imprisonment of a mulatto named George Latimer, one of the first fugitive slaves to be apprehended in Massachusetts." },
         { "day":"17", "month":"11", "year":"1862", "text": "Union General Ambrose Burnside marches north out of Washington, D.C., to begin the Fredericksburg campaign." },
         { "day":"17", "month":"11", "year":"1869", "text": "The Suez Canal is formally opened." },
         { "day":"17", "month":"11", "year":"1877", "text": "Russia launches a surprise night attack that overruns Turkish forces at Kars, Armenia." },
         { "day":"17", "month":"11", "year":"1885", "text": "The Serbian Army, with Russian support, invades Bulgaria." },
         { "day":"17", "month":"11", "year":"1903", "text": "Vladimir Lenin’s efforts to impose his own radical views on the Russian Social Democratic Labor Party splits the party into two factions, the Bolsheviks, who support Lenin, and the Mensheviks." },
         { "day":"17", "month":"11", "year":"1913", "text": "The first ship sails through the Panama Canal, which connects the Atlantic and Pacific oceans." },
         { "day":"17", "month":"11", "year":"1918", "text": "Influenza deaths reported in the United States have far exceeded World War I casualties." },
         { "day":"17", "month":"11", "year":"1918", "text": "German troops evacuate Brussels." },
         { "day":"17", "month":"11", "year":"1931", "text": "Charles Lindbergh inaugurates Pan Am service from Cuba to South America in the Sikorsky flying boat American Clipper." },
         { "day":"17", "month":"11", "year":"1941", "text": "German Luftwaffe general and World War I fighter-ace Ernst Udet commits suicide. The Nazi government tells the public that he died in a flying accident." },
         { "day":"17", "month":"11", "year":"1951", "text": "Britain reports development of the world’s first nuclear-powered heating system." },
         { "day":"17", "month":"11", "year":"1965", "text": "The NVA ambushes American troops of the 7th Cavalry at Landing Zone Albany in the Ia Drang Valley, almost wiping them out." },
         { "day":"17", "month":"11", "year":"1967", "text": "The American Surveyor 6 makes a six-second flight on the moon, the first liftoff on the lunar surface." },
         { "day":"17", "month":"11", "year":"1970", "text": "Soviet unmanned Luna 17 touches down on the moon." },
         { "day":"17", "month":"11", "year":"1980", "text": "WHHM Television in Washington, D.C., becomes the first African-American public-broadcasting television station." },
         { "day":"17", "month":"11", "year":"1986", "text": "Renault President Georges Besse is shot to death by leftists of the Direct Action Group in Paris." },
         { "day":"17", "month":"11", "year":"1989", "text": "Student demonstration in Prague put down by riot police, leading to an uprising (the Velvet Revolution) that will topple the communist government on Dec. 29." },
         { "day":"17", "month":"11", "year":"1993", "text": "US House of Representatives passes resolution to establish the North American Free Trade Agreement." },
         { "day":"17", "month":"11", "year":"1993", "text": "Gen. Sani Abacha leads a military coup in Nigeria that overthrows the government of Ernest Shonekan." },
         { "day":"17", "month":"11", "year":"2000", "text": "Controversial President of Peru Alberto Fujimori removed from office." }

      ]
   }
]
