[
   {
      "facts":[
         { "day":"18", "month":"11", "year":"1477", "text": "William Claxton publishes the first dated book printed in England. It is a translation from the French of The Dictes and Sayings of the Philosopers by Earl Rivers." },
         { "day":"18", "month":"11", "year":"1626", "text": "St. Peter’s Cathedral in Rome is officially dedicated." },
         { "day":"18", "month":"11", "year":"1861", "text": "The first provisional meeting of the Confederate Congress is held in Richmond, Virginia." },
         { "day":"18", "month":"11", "year":"1865", "text": "Mark Twain’s first story \"The Celebrated Jumping Frog of Calaveras County\" is published in the New York Saturday Press." },
         { "day":"18", "month":"11", "year":"1901", "text": "The second Hay-Pauncefote Treaty is signed. The United States is given extensive rights by Britain for building and operating a canal through Central America." },
         { "day":"18", "month":"11", "year":"1905", "text": "The Norwegian Parliament elects Prince Charles of Denmark to be the next King of Norway. Prince Charles takes the name Haakon VII." },
         { "day":"18", "month":"11", "year":"1906", "text": "Anarchists bomb St. Peter’s Basilica in Rome." },
         { "day":"18", "month":"11", "year":"1912", "text": "Cholera breaks out in Constantinople, in the Ottoman Empire." },
         { "day":"18", "month":"11", "year":"1921", "text": "New York City considers varying work hours to avoid long traffic jams." },
         { "day":"18", "month":"11", "year":"1928", "text": "Mickey mouse makes his film debut in Steamboat Willie, the first animated talking picture." },
         { "day":"18", "month":"11", "year":"1936", "text": "The main span of the Golden Gate Bridge in San Francisco is joined." },
         { "day":"18", "month":"11", "year":"1939", "text": "The Irish Republican Army explodes three bombs in Piccadilly Circus." },
         { "day":"18", "month":"11", "year":"1943", "text": "RAF bombs Berlin, using 440 aircraft and losing nine of those and 53 air crew members; damage to the German capital is light, with 131 dead." },
         { "day":"18", "month":"11", "year":"1949", "text": "The U.S. Air Force grounds B-29s after two crashes and 23 deaths in three days." },
         { "day":"18", "month":"11", "year":"1950", "text": "The Bureau of Mines discloses its first production of oil from coal in practical amounts." },
         { "day":"18", "month":"11", "year":"1968", "text": "Soviets recover the Zond 6 spacecraft after a flight around the moon." },
         { "day":"18", "month":"11", "year":"1978", "text": "Peoples Temple cult leader Jim Jones leads his followers to a mass murder-suicide in Jonestown, Guyana, hours after cult member killed Congressman Leo J. Ryan of California." },
         { "day":"18", "month":"11", "year":"1983", "text": "Argentina announces its ability to produce enriched uranium for nuclear weapons." },
         { "day":"18", "month":"11", "year":"1984", "text": "The Soviet Union helps deliver American wheat during the Ethiopian famine." },
         { "day":"18", "month":"11", "year":"1991", "text": "The Croatian city of Vukovar surrenders to Yugoslav People’s Army and allied Serb paramilitary forces after an 87-day siege." },
         { "day":"18", "month":"11", "year":"1993", "text": "Twenty-one political parties approve a new constitution for South Africa that expands voter rights and ends the rule of the country’s white minority." },
         { "day":"18", "month":"11", "year":"2002", "text": "UN weapons inspectors under Hans Blix arrive in Iraq." },
         { "day":"18", "month":"11", "year":"2003", "text": "Massachusetts Supreme Judicial Court rules the state’s ban on same-sex marriages is unconstitutional; the legislature fails to act within the mandated 180 days, and on May 17, 2004, Massachusetts becomes the first US state to legalize same-sex marriage." }
      ]
   }
]
