[
   {
      "facts":[
         { "day":"20", "month":"11", "year":"269", "text": "Diocletian is proclaimed emperor of Numerian in Asia Minor by his soldiers. He had been the commander of the emperor’s bodyguard." },
         { "day":"20", "month":"11", "year":"1695", "text": "Zumbi dos Palmares, the Brazilian leader of a 100-year-old rebel slave group, is killed in an ambush." },
         { "day":"20", "month":"11", "year":"1700", "text": "Sweden’s 17-year-old King Charles XII defeats the Russians at Narva." },
         { "day":"20", "month":"11", "year":"1903", "text": "In Cheyenne, Wyoming, 42-year-old hired gunman Tom Horn is hanged for the murder of 14-year-old Willie Nickell." },
         { "day":"20", "month":"11", "year":"1914", "text": "Bulgaria proclaims its neutrality in the First World War." },
         { "day":"20", "month":"11", "year":"1928", "text": "Mrs. Glen Hyde becomes the first woman to dare the Grand Canyon rapids in a scow (a flat-bottomed boat that is pushed along with a pole)." },
         { "day":"20", "month":"11", "year":"1931", "text": "Japan and China reject the League of Council terms for Manchuria at Geneva." },
         { "day":"20", "month":"11", "year":"1943", "text": "U.S. Army and Marine soldiers attack the Japanese-held islands of Makin and Tarawa, respectively, in the Central Pacific." },
         { "day":"20", "month":"11", "year":"1945", "text": "The Nazi war crime trials begin at Nuremberg." },
         { "day":"20", "month":"11", "year":"1947", "text": "Princess Elizabeth (future Queen Elizabeth II) marries Philip, Duke of Edinburgh, in Westminster Abbey." },
         { "day":"20", "month":"11", "year":"1950", "text": "U.S. troops push to the Yalu River, within five miles of Manchuria." },
         { "day":"20", "month":"11", "year":"1955", "text": "The Maryland National Guard is ordered desegregated." },
         { "day":"20", "month":"11", "year":"1962", "text": "President John F. Kennedy bars religious or racial discrimination in federally funded housing." },
         { "day":"20", "month":"11", "year":"1967", "text": "U.S. census reports the population at 200 million." },
         { "day":"20", "month":"11", "year":"1971", "text": "The United States announces it will give Turkey $35 million for farmers who agree to stop growing opium poppies." },
         { "day":"20", "month":"11", "year":"1974", "text": "The United States files an antitrust suit to break up ATT." },
         { "day":"20", "month":"11", "year":"1978", "text": "South Africa backs down on a plan to install black rule in neighboring Namibia." },
         { "day":"20", "month":"11", "year":"1981", "text": "Microsoft Windows 1.0 released." },
         { "day":"20", "month":"11", "year":"1992", "text": "Fire in England’s Windsor Castle causes over £50 million in damages." },
         { "day":"20", "month":"11", "year":"1998", "text": "First module of the International Space Station, Zarya, is launched." },
         { "day":"20", "month":"11", "year":"2008", "text": "Dow Jones Industrial Average sinks to lowest level in 11 years in response to failures in the US financial system." }
      ]
   }
]
