[
   {
      "facts":[
         { "day":"23", "month":"11", "year":"1248", "text": "The city of Seville, Spain, surrenders to Ferdinand III of Castile after a two-year siege." },
         { "day":"23", "month":"11", "year":"1785", "text": "John Hancock is elected president of the Continental Congress for the second time." },
         { "day":"23", "month":"11", "year":"1863", "text": "Union forces win the Battle of Orchard Knob, Tennessee." },
         { "day":"23", "month":"11", "year":"1863", "text": "The Battle of Chattanooga, one of the most decisive battles of the American Civil War, begins (also in Tennessee)." },
         { "day":"23", "month":"11", "year":"1903", "text": "Italian tenor Enrico Caruso makes his American debut in a Metropolitan Opera production of Verdi’s Rigoletto." },
         { "day":"23", "month":"11", "year":"1904", "text": "Russo-German talks break down because of Russia’s insistence to consult France." },
         { "day":"23", "month":"11", "year":"1909", "text": "The Wright brothers form a million-dollar corporation for the commercial manufacture of their airplanes." },
         { "day":"23", "month":"11", "year":"1921", "text": "President Warren G. Harding signs the Willis Campell Act, better known as the anti-beer bill. It forbids doctors to prescribe beer or liquor for medicinal purposes." },
         { "day":"23", "month":"11", "year":"1933", "text": "President Franklin D. Roosevelt recalls the American ambassador from Havana, Cuba, and urges stability in the island nation." },
         { "day":"23", "month":"11", "year":"1934", "text": "The United States and Great Britain agree on a 5-5-3 naval ratio, with both countries allowed to build five million tons of naval ships while Japan can only build three. Japan will denounce the treaty." },
         { "day":"23", "month":"11", "year":"1936", "text": "The United States abandons the American embassy in Madrid, Spain, which is engulfed by civil war." },
         { "day":"23", "month":"11", "year":"1941", "text": "U.S. troops move into Dutch Guiana to guard the bauxite mines." },
         { "day":"23", "month":"11", "year":"1942", "text": "The film Casablanca premieres in New York City." },
         { "day":"23", "month":"11", "year":"1943", "text": "U.S. Marines declare the island of Tarawa secure." },
         { "day":"23", "month":"11", "year":"1945", "text": "Wartime meat and butter rationing ends in the United States." },
         { "day":"23", "month":"11", "year":"1953", "text": "North Korea signs 10-year aid pact with Peking." },
         { "day":"23", "month":"11", "year":"1968", "text": "Four men hijack an American plane, with 87 passengers, from Miami to Cuba." },
         { "day":"23", "month":"11", "year":"1980", "text": "In Europe’s biggest earthquake since 1915, 3,000 people are killed in Italy." },
         { "day":"23", "month":"11", "year":"1981", "text": "US Pres. Ronald Reagan signs top secret directive giving the CIA authority to recruit and support Contra rebels in Nicaragua." },
         { "day":"23", "month":"11", "year":"1990", "text": "The first all-woman expedition to South Pole sets off from Antarctica on the part of a 70-day trip; the group includes 12 Russians, 3 Americans and 1 Japanese." },
         { "day":"23", "month":"11", "year":"1992", "text": "The first Smartphone, IBM Simon, introduced at COMDEX in Las Vegas, Nevada." },
         { "day":"23", "month":"11", "year":"2005", "text": "Ellen Johnson Sirleaf elected president of Liberia; she is the first woman to lead an African nation." },
         { "day":"23", "month":"11", "year":"2006", "text": "In the second-deadliest day of sectarian violence in Iraq since the beginning of the 2003 war, 215 people are killed and nearly 260 injured by bombs in Sadr City." },
         { "day":"23", "month":"11", "year":"2011", "text": "Yemeni President Ali Abullah Saleh signs a deal to to transfer power to the vice president, in exchange for legal immunity; the agreement came after 11 months of protests." }
      ]
   }
]
