[
   {
      "facts":[
          { "day":"24", "month":"11", "year":"1542", "text": "The English defeat the Scots at the Battle of Solway Moss in England." },
          { "day":"24", "month":"11", "year":"1859", "text": "Charles Darwin publishes The Origin of Species by Means of Natural Selection, or The Preservation of Favored Races in the Struggle for Life. The first printing of 1,250 copies sells out in a single day." },
          { "day":"24", "month":"11", "year":"1863", "text": "In the Battle Above the Clouds, Union Maj. Gen. Joseph Hooker’s forces take Lookout Mountain, near Chattanooga, Tennessee." },
          { "day":"24", "month":"11", "year":"1864", "text": "Kit Carson and his 1st Cavalry, New Mexico Volunteers, attack a camp of Kiowa Indians in the First Battle of Adobe Walls." },
          { "day":"24", "month":"11", "year":"1874", "text": "Joseph Glidden receives a patent for barbed wire." },
          { "day":"24", "month":"11", "year":"1902", "text": "The first Congress of Professional Photographers convenes in Paris." },
          { "day":"24", "month":"11", "year":"1912", "text": "Austria denounces Serbian gains in the Balkans; Russia and France back Serbia while Italy and Germany back Austria." },
          { "day":"24", "month":"11", "year":"1927", "text": "Federal officials battle 1,200 inmates after prisoners in Folsom Prison revolt." },
          { "day":"24", "month":"11", "year":"1938", "text": "Mexico seizes oil land adjacent to Texas." },
          { "day":"24", "month":"11", "year":"1939", "text": "In Czechoslovakia, the Gestapo execute 120 students who are accused of anti-Nazi plotting." },
          { "day":"24", "month":"11", "year":"1944", "text": "American B-29s flying from Saipan bomb Tokyo." },
          { "day":"24", "month":"11", "year":"1949", "text": "The Iron and Steel Act nationalizes the steel industry in Britain." },
          { "day":"24", "month":"11", "year":"1950", "text": "UN troops begin an assault into the rest of North Korea, hoping to end the Korean War by Christmas." },
          { "day":"24", "month":"11", "year":"1961", "text": "The United Nations adopts bans on nuclear arms over American protests." },
          { "day":"24", "month":"11", "year":"1963", "text": "Jack Ruby fatally shoots the accused assassin of President Kennedy, Lee Harvey Oswald, in the garage of the Dallas Police Department." },
          { "day":"24", "month":"11", "year":"1977", "text": "Greece announces the discovery of the tomb of King Philip II, father of Alexander the Great." },
          { "day":"24", "month":"11", "year":"1979", "text": "The United States admits that thousands of troops in Vietnam were exposed to the toxic Agent Orange." },
          { "day":"24", "month":"11", "year":"1992", "text": "US Congress passes the Brady Bill requiring a 5-day waiting period for handgun sales; the bill is named for Pres. Ronald Reagan’s press secretary who was left partially paralyzed by a bullet during an assassination attempt on Reagan." },
          { "day":"24", "month":"11", "year":"1995", "text": "Ireland votes 50.28% to 49.72% to end its 70-year-old ban on divorce." },
          { "day":"24", "month":"11", "year":"2012", "text": "A fire at a clothing factory in Dhaka, Bangladesh, kills over 110 people." }
      ]
   }
]
