[
   {
      "facts":[
         { "day":"26", "month":"11", "year":"1688", "text":"Louis XIV declares war on the Netherlands." },
         { "day":"26", "month":"11", "year":"1774", "text":"A congress of colonial leaders criticizes British influence in the colonies and affirms their right to \"Life, liberty and property.\"" },
         { "day":"26", "month":"11", "year":"1789", "text":"George Washington proclaims this a National Thanksgiving Day in honor of the new Constitution. This date was later used to set the date for Thanksgiving." },
         { "day":"26", "month":"11", "year":"1812", "text":"Napoleon Bonaparte’s army begins crossing the Beresina River over two hastily constructed bridges." },
         { "day":"26", "month":"11", "year":"1825", "text":"The Kappa Alpha Society, the second American college Greek-letter fraternity, is founded." },
         { "day":"26", "month":"11", "year":"1863", "text":"The first National Thanksgiving is celebrated." },
         { "day":"26", "month":"11", "year":"1901", "text":"The Hope diamond is brought to New York." },
         { "day":"26", "month":"11", "year":"1907", "text":"The Duma lends support to Czar in St. Petersburg, who claims he has renounced autocracy." },
         { "day":"26", "month":"11", "year":"1917", "text":"The Bolsheviks offer an armistice between Russian and the Central Powers." },
         { "day":"26", "month":"11", "year":"1922", "text":"Lord Carnarvon and Howard Carter, archeologists, open King Tut’s tomb, undisturbed for 3,000 years." },
         { "day":"26", "month":"11", "year":"1938", "text":"Poland renews nonaggression pact with the Soviet Union to protect against a German invasion." },
         { "day":"26", "month":"11", "year":"1939", "text":"The Soviet Union charges Finland with artillery attack on border." },
         { "day":"26", "month":"11", "year":"1941", "text":"The Japanese fleet departs from the Kuril Islands en route to its attack on Pearl Harbor." },
         { "day":"26", "month":"11", "year":"1947", "text":"France expels 19 Soviet citizens, charging them with intervention in internal affairs." },
         { "day":"26", "month":"11", "year":"1949", "text":"India becomes a sovereign Democratic republic." },
         { "day":"26", "month":"11", "year":"1950", "text":"North Korean and Chinese troops halt a UN offensive." },
         { "day":"26", "month":"11", "year":"1957", "text":"President Eisenhower suffers a minor stroke." },
         { "day":"26", "month":"11", "year":"1975", "text":"Lynette \"Squeaky\" Fromme is found guilty of an attempt on President Gerald Ford’s life." },
         { "day":"26", "month":"11", "year":"1979", "text":"Oil deposits equaling OPEC reserves are found in Venezuela." },
         { "day":"26", "month":"11", "year":"1982", "text":"Yasuhiro Nakasone is elected the 71st Japanese prime minister." },
         { "day":"26", "month":"11", "year":"1983", "text":"At London’s Heathrow Airport, almost 6,800 gold bars worth nearly £26 million stolen from Brinks-MAT vault." },
         { "day":"26", "month":"11", "year":"1998", "text":"Tony Blair becomes the first Prime Minister of the United Kingdom to address the Republic of Ireland’s parliament." },
         { "day":"26", "month":"11", "year":"2000", "text":"Republican candidate George W. Bush is certified the winner of Florida’s electoral votes, giving him enough electoral votes to defeat Democrat Al Gore Jr. for the US presidency, despite losing the popular vote." },
         { "day":"26", "month":"11", "year":"2011", "text":"NATO forces in Afghanistan attack a Pakistani checkpost in a friendly fire incident, killing 24 soldiers and wounding 13 others." }
      ]
   }
]
