[
  {
    "facts":[
      {
        "day":"27",
        "month":"11",
        "year":"511",
        "text":"Clovis, king of the Franks, dies and his kingdom is divided between his four sons."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1095",
        "text":"In Clermont, France, Pope Urbana II makes an appeal for warriors to relieve Jerusalem. He is responding to false rumors of atrocities in the Holy Land."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1382",
        "text":"The French nobility, led by Olivier de Clisson, crush the Flemish rebels at Flanders."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1812",
        "text":"One of the two bridges being used by Napoleon Bonaparte’s army across the Beresina River in Russia collapses during a Russian artillery barrage."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1826",
        "text":"Jebediah Smith’s expedition reaches San Diego, becoming the first Americans to cross the southwestern part of the continent."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1862",
        "text":"George Armstrong Custer meets his future bride, Elizabeth Bacon, at a Thanksgiving party."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1868",
        "text":"Lieutenant Colonel George A. Custer‘s 7th Cavalry kills Chief Black Kettle and about 100 Cheyenne (mostly women and children) on the Washita River."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1887",
        "text":"U.S. Deputy Marshall Frank Dalton, brother of the three famous outlaws, is killed in the line of duty near Fort Smith, Ark."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1904",
        "text":"The German colonial army defeats Hottentots at Warm bad in southwest Africa."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1909",
        "text":"U.S. troops land in Blue fields, Nicaragua, to protect American interests there."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1919",
        "text":"Bulgaria signs peace treaty with Allies at Unequally, France, fixing war reparations and recognizing Yugoslavian independence."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1922",
        "text":"Allied delegates bar the Soviets from the Near East peace conference."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1936",
        "text":"Great Britain’s Anthony Eden warns Hitler that Britain will fight to protect Belgium."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1942",
        "text":"The French fleet in Toulon is scuttled to keep it from Germany."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1950",
        "text":"East of the Choosing River, Chinese forces annihilate an American task force."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1954",
        "text":"Alger Hiss, convicted of being a Soviet spy, is freed after 44 months in prison."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1959",
        "text":"Demonstrators march in Tokyo to protest a defense treaty with the United States."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1967",
        "text":"Lyndon Johnson appoints Robert McNamara to presidency of the World Bank."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1967",
        "text":"Charles DeGaulle vetoes Great Britain’s entry into the Common Market again."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1970",
        "text":"Syria joins the pact linking Libya, Egypt and Sudan."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1973",
        "text":"US Senate votes to confirm Gerald Ford as President of the United States, following President Richard Nixon’s resignation; the House will confirm Ford on Dec. 6."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1978",
        "text":"San Francisco mayor George Moscone and Harvey Milk, the city’s first openly gay supervisor, assassinated by former city supervisor Dan White."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1978",
        "text":"Kurdistan Workers’ Party (Parti Karkerani Kurdistan, or PKK) founded; militant group that fought an armed struggle for an independent Kurdistan."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1984",
        "text":"Britain and Spain sign the Brussels Agreement to enter discussions over the status of Gibraltar."
      },
      {
        "day":"27",
        "month":"11",
        "year":"1999",
        "text":"Helen Clark becomes first elected female Prime Minister of New Zealand."
      },
      {
        "day":"27",
        "month":"11",
        "year":"2001",
        "text":"Hubble Space Telescope discovers a hydrogen atmosphere on planet Osiris, the first atmosphere detected on an extrasolar planet."
      },
      {
        "day":"27",
        "month":"11",
        "year":"2004",
        "text":"Pope John Paul II returns relics of Saint John Chrysostom to the Eastern Orthodox Church."
      },
      {
        "day":"27",
        "month":"11",
        "year":"2005",
        "text":"First partial human face transplant completed Amiens, France."
      },
      {
        "day":"27",
        "month":"11",
        "year":"2006",
        "text":"Canadian House of Commons approves a motion, tabled by Prime Minister Stephen Harper, recognizing the Quebecois as a nation within Canada."
      }
    ]
  }
]