[
  {
    "facts":[
        { "day":"28", "month":"11", "year":"1520", "text": "Spanish explorer Ferdinand Magellan, having discovered a strait at the tip of South America, enters the Pacific." },
        { "day":"28", "month":"11", "year":"1729", "text": "Natchez Indians massacre most of the 300 French settlers and soldiers at Fort Rosalie, Louisiana." },
        { "day":"28", "month":"11", "year":"1861", "text": "The Confederate Congress admits Missouri to the Confederacy, although Missouri has not yet seceded from the Union." },
        { "day":"28", "month":"11", "year":"1868", "text": "Mt. Etna in Sicily violently erupts." },
        { "day":"28", "month":"11", "year":"1872", "text": "The Modoc War of 1872-73 begins in northern California when fighting breaks out between Modoc Chief Captain Jack and a cavalry detail led by Captain James Jackson." },
        { "day":"28", "month":"11", "year":"1899", "text": "The British are victorious over the Boers at Modder River." },
        { "day":"28", "month":"11", "year":"1919", "text": "Lady Astor is elected the first woman in Parliament." },
        { "day":"28", "month":"11", "year":"1925", "text": "The forerunner of the Grand Ole Opry, called the WSM Barn Dance, opens in Nashville, Tennessee." },
        { "day":"28", "month":"11", "year":"1935", "text": "The German Reich declares all men ages 18 to 45 as army reservists." },
        { "day":"28", "month":"11", "year":"1937", "text": "Spanish leader Francisco Franco blockades the Spanish coast." },
        { "day":"28", "month":"11", "year":"1939", "text": "The Soviet Union scraps its nonaggression pact with Finland." },
        { "day":"28", "month":"11", "year":"1941", "text": "The aircraft carrier USS Enterprise departs from Pearl Harbor to deliver F4F Wildcat fighters to Wake Island. This mission saves the carrier from destruction when the Japanese attack." },
        { "day":"28", "month":"11", "year":"1943", "text": "Sir Winston Churchill, Joseph Stalin and Franklin D. Roosevelt meet at Tehran, Iran, to hammer out war aims." },
        { "day":"28", "month":"11", "year":"1944", "text": "The first shipment of supplies reach Antwerp by convoy, a new route for the Allies." },
        { "day":"28", "month":"11", "year":"1948", "text": "Dr. Edwin Land’s first Polaroid cameras go on sale in Boston." },
        { "day":"28", "month":"11", "year":"1950", "text": "In Korea, 200,000 Communist troops launch attack on UN forces." },
        { "day":"28", "month":"11", "year":"1961", "text": "Ernie Davis becomes the first African American to win the Heisman Trophy." },
        { "day":"28", "month":"11", "year":"1963", "text": "Cape Canaveral is renamed Cape Kennedy." },
        { "day":"28", "month":"11", "year":"1971", "text": "The Anglican Church ordains the first two women as priests." },
        { "day":"28", "month":"11", "year":"1975", "text": "East Timor declares independence from Portugal." },
        { "day":"28", "month":"11", "year":"1980", "text": "Operation Morvarid (Iran-Iraq War); Iranian Navy destroys over 70% of Iraqi Navy." },
        { "day":"28", "month":"11", "year":"1984", "text": "Republican Robert Dole is elected Senate majority leader." },
        { "day":"28", "month":"11", "year":"1989", "text": "Communist Party of Czechoslovakia announces it will give up its monopoly on political power." },
        { "day":"28", "month":"11", "year":"1991", "text": "South Ossetia declares independence from Georgia." },
        { "day":"28", "month":"11", "year":"2002", "text": "Suicide bombers blow up an Israeli-owned hotel in Mombasa, Kenya." }
    ]
  }
]