[
   {
      "facts":[
         { "day":"3", "month":"11", "year":"1493", "text": "Christopher Columbus arrives at the Caribbee Isles (Dominica) during his second expedition." },
         { "day":"3", "month":"11", "year":"1507", "text": "Leonardo da Vinci is commissioned to paint Lisa Gherardini (\"Mona Lisa\")." },
         { "day":"3", "month":"11", "year":"1529", "text": "The first parliament for five years opens in England and the Commons put forward bills against abuses amongst the clergy and in the church courts." },
         { "day":"3", "month":"11", "year":"1794", "text": "Thomas Paine is released from a Parisian jail with help from the American ambassador James Monroe. He was arrested for having offended the Robespierre faction." },
         { "day":"3", "month":"11", "year":"1813", "text": "American troops destroy the Indian village of Tallushatchee in the Mississippi Valley." },
         { "day":"3", "month":"11", "year":"1868", "text": "Ulysses S. Grant elected the 18th president of the United States." },
         { "day":"3", "month":"11", "year":"1883", "text": "A poorly trained Egyptian army, led by British General William Hicks, marches toward El Obeid in the Sudan–straight into a Mahdist ambush and massacre." },
         { "day":"3", "month":"11", "year":"1883", "text": "The U.S. Supreme Court declares American Indians to be \"dependent aliens.\"" },
         { "day":"3", "month":"11", "year":"1892", "text": "First automatic telephone exchange goes into operation in La Porte, Indiana." },
         { "day":"3", "month":"11", "year":"1896", "text": "William McKinley is elected 25th president of the United States." },
         { "day":"3", "month":"11", "year":"1912", "text": "The first all-metal plane flies near Issy, France, piloted by Ponche and Prinard." },
         { "day":"3", "month":"11", "year":"1918", "text": "The German fleet at Kiel mutinies. This is the first act leading to Germany’s capitulation in World War I." },
         { "day":"3", "month":"11", "year":"1921", "text": "Milk drivers on strike dump thousands of gallons of milk onto New York City’s streets." },
         { "day":"3", "month":"11", "year":"1935", "text": "Left-wing groups in France form the Socialist and Republican Union." },
         { "day":"3", "month":"11", "year":"1957", "text": "The Soviet Union launches Sputnik II with the dog Laika, the first animal in space, aboard." },
         { "day":"3", "month":"11", "year":"1964", "text": "For the first time residents of Washington, D.C., are allowed to vote in a presidential election." },
         { "day":"3", "month":"11", "year":"1964", "text": "Lyndon B. Johnson is elected the 36th president of the United States." },
         { "day":"3", "month":"11", "year":"1964", "text": "Robert Kennedy, brother of the slain president, is elected as a senator from New York." },
         { "day":"3", "month":"11", "year":"1967", "text": "The Battle of Dak To begins in Vietnam’s Central Highlands; actually a series of engagements, the battle would continue through Nov. 22." },
         { "day":"3", "month":"11", "year":"1969", "text": "US President Richard Nixon, speaking on TV and radio, asks the \"silent majority\" of the American people to support his policies and the continuing war effort in Vietnam." },
         { "day":"3", "month":"11", "year":"1973", "text": "NASA launches Mariner 10, which will become the first probe to reach Mercury." },
         { "day":"3", "month":"11", "year":"1979", "text": "Ku Klux Klansmen and neo-Nazis kill 5 and wound 7 members of the Communist Workers Party during a \"Death to the Klan\" rally in Greensboro, NC; the incident becomes known as the Greensboro Massacre." },
         { "day":"3", "month":"11", "year":"1983", "text": "Jesse Jackson announces his candidacy for the office of president of the United States." },
         { "day":"3", "month":"11", "year":"1986", "text": "The Lebanese magazine Ash-Shiraa reports the US has secretly been selling weapons to Iran in order to secure the release of 7 American hostages being held by pro-Iranian groups in Lebanon." },
         { "day":"3", "month":"11", "year":"1992", "text": "Arkansas Governor Bill (William Jefferson) Clinton is elected 42nd president of the United States." },
         { "day":"3", "month":"11", "year":"1997", "text": "US imposes economic sanctions against Sudan in response to human rights abuses and support of Islamic extremist groups." }
      ]
   }
]
