[
   {
      "facts":[
         { "day":"30", "month":"11", "year":"1782", "text":"The British sign a preliminary agreement in Paris, recognizing American independence." },
         { "day":"30", "month":"11", "year":"1838", "text":"Mexico declares war on France." },
         { "day":"30", "month":"11", "year":"1861", "text":"The British Parliament sends to Queen Victoria an ultimatum for the United States, demanding the release of two Confederate diplomats who were seized on the British ship Trent." },
         { "day":"30", "month":"11", "year":"1864", "text":"The Union wins the Battle of Franklin, Tennessee." },
         { "day":"30", "month":"11", "year":"1900", "text":"The French government denounces British actions in South Africa, declaring sympathy for the Boers." },
         { "day":"30", "month":"11", "year":"1900", "text":"Oscar Wilde dies in a Paris hotel room after saying of the room’s wallpaper: \"One of us had to go.\"" },
         { "day":"30", "month":"11", "year":"1906", "text":"President Theodore Roosevelt publicly denounces segregation of Japanese schoolchildren in San Francisco." },
         { "day":"30", "month":"11", "year":"1919", "text":"Women cast votes for the first time in French legislative elections." },
         { "day":"30", "month":"11", "year":"1935", "text":"Non-belief in Nazism is proclaimed grounds for divorce in Germany." },
         { "day":"30", "month":"11", "year":"1945", "text":"Russian forces take Danzig in Poland and invade Austria." },
         { "day":"30", "month":"11", "year":"1948", "text":"The Soviet Union complete the division of Berlin, installing the government in the Soviet sector." },
         { "day":"30", "month":"11", "year":"1950", "text":"President Truman declares that the United States will use the A-bomb to get peace in Korea." },
         { "day":"30", "month":"11", "year":"1956", "text":"The United States offers emergency oil to Europe to counter the Arab ban." },
         { "day":"30", "month":"11", "year":"1961", "text":"The Soviet Union vetoes a UN seat for Kuwait, pleasing Iraq." },
         { "day":"30", "month":"11", "year":"1974", "text":"India and Pakistan decide to end a 10-year trade ban." },
         { "day":"30", "month":"11", "year":"1974", "text":"Pioneer II sends photos back to NASA as it nears Jupiter." },
         { "day":"30", "month":"11", "year":"1979", "text":"Pope John Paul II becomes the first pope in 1,000 years to attend an Orthodox mass." },
         { "day":"30", "month":"11", "year":"1981", "text":"Representatives of the US and USSR meet in Geneva, Switzerland, to begin negotiations on reducing the number of intermediate-range nuclear weapons in Europe." },
         { "day":"30", "month":"11", "year":"1982", "text":"Thriller, Michael Jackson’s second solo album, released; the album, produced by Quincy Jones, became the best-selling album in history." },
         { "day":"30", "month":"11", "year":"1993", "text":"US President Bill Clinton signs the Brady Handgun Violence Prevention Act (better known as the Brady Bill) into law." },
         { "day":"30", "month":"11", "year":"1994", "text":"MS Achille Lauro, a ship with long history of problems including a 1985 terrorist hijacking, catches fire off the coast of Somalia." },
         { "day":"30", "month":"11", "year":"1995", "text":"Operation Desert Storm officially comes to an end." },
         { "day":"30", "month":"11", "year":"1998", "text":"Exxon and Mobil oil companies agree to a $73.7 billion merge, creating the world’s largest company, Exxon-Mobil." },
         { "day":"30", "month":"11", "year":"2004", "text":"On the game show Jeopardy! contestant Ken Jennings loses after 74 consecutive victories. It is the longest winning streak in game-show history, earning him a total of over $3 million." },
         { "day":"30", "month":"11", "year":"2005", "text":"John Sentamu becomes Archbishop of York, making him the Church of England’s first black archbishop." }
      ]
   }
]
