[
   {
      "facts":[
         { "day":"4", "month":"11", "year":"644" , "text": "Umar of Arabia is assassinated at Medina and is succeeded as caliph by Uthman." },
         { "day":"4", "month":"11", "year":"1493", "text": "Christopher Columbus discovers Guadeloupe during his second expedition." },
         { "day":"4", "month":"11", "year":"1677", "text": "William III and Mary of England wed on William’s birthday." },
         { "day":"4", "month":"11", "year":"1760", "text": "Following the Russian capture of Berlin, Frederick II of Prussia defeats the Austrians at the Battle of Torgau." },
         { "day":"4", "month":"11", "year":"1791", "text": "General Arthur St. Clair, governor of Northwest Territory, is badly defeated by a large Indian army near Fort Wayne." },
         { "day":"4", "month":"11", "year":"1798", "text": "Congress agrees to pay a yearly tribute to Tripoli, considering it the only way to protect U.S. shipping." },
         { "day":"4", "month":"11", "year":"1842", "text": "Abraham Lincoln marries Mary Todd in Springfield, Ill." },
         { "day":"4", "month":"11", "year":"1854", "text": "Florence Nightingale and her nurses arrive in the Crimea." },
         { "day":"4", "month":"11", "year":"1863", "text": "From the main Confederate Army at Chattanooga, Tennessee, Lt. Gen. James Longstreet’s troops are sent northeast to besiege Knoxville." },
         { "day":"4", "month":"11", "year":"1918", "text": "Austria signs an armistice with the Allies." },
         { "day":"4", "month":"11", "year":"1922", "text": "The U.S. Postmaster General orders all homes to get mailboxes or relinquish delivery of mail." },
         { "day":"4", "month":"11", "year":"1922", "text": "The entrance to King Tut’s tomb is discovered." },
         { "day":"4", "month":"11", "year":"1924", "text": "Calvin Coolidge is elected 30th president of the United States." },
         { "day":"4", "month":"11", "year":"1924", "text": "Nellie Tayloe Ross and Miriam Ferguson are elected first and second women governors (Wyoming and Texas)." },
         { "day":"4", "month":"11", "year":"1946", "text": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) is established." },
         { "day":"4", "month":"11", "year":"1952", "text": "General Dwight D. Eisenhower is elected 34th president of the United States." },
         { "day":"4", "month":"11", "year":"1956", "text": "Russian troops attack Budapest, Hungary." },
         { "day":"4", "month":"11", "year":"1979", "text": "At the American Embassy in Teheran, Iran, 90 people, including 63 Americans, are taken hostage by militant student followers of Ayatollah Khomeini. The students demand the return of Shah Mohammad Reza Pablavi, who is undergoing medical treatment in New York City." },
         { "day":"4", "month":"11", "year":"1980", "text": "Ronald Reagan is elected the 40th president of the United States." },
         { "day":"4", "month":"11", "year":"1992", "text": "Carol Moseley Braun becomes the first African American woman to be elected to the U.S. Senate." },
         { "day":"4", "month":"11", "year":"1995", "text": "Israeli Prime Minister Yitzhak Rabin is assassinated at a peace rally in Tel Aviv." },
         { "day":"4", "month":"11", "year":"2008", "text": "Senator Barack Obama of Illinois elected 44th president of the United States, the first African American to hold that position." }
      ]
   }
]
