[
   {
      "facts":[
         { "day":"6", "month":"11", "year":"1429", "text": "Henry VI is crowned King of England." },
         { "day":"6", "month":"11", "year":"1812", "text": "The first winter snow falls on the French Army as Napoleon Bonaparte retreats form Moscow." },
         { "day":"6", "month":"11", "year":"1860", "text": "Abraham Lincoln is elected 16th president of the United States." },
         { "day":"6", "month":"11", "year":"1861", "text": "Jefferson Davis is elected to a six-year term as president of the Confederacy." },
         { "day":"6", "month":"11", "year":"1863", "text": "A Union force surrounds and scatters defending Confederates at the Battle of Droop Mountain, in West Virginia." },
         { "day":"6", "month":"11", "year":"1891", "text": "Comanche, the only 7th Cavalry horse to survive George Armstrong Custer’s \"Last Stand\" at the Little Bighorn, dies at Fort Riley, Kansas." },
         { "day":"6", "month":"11", "year":"1911", "text": "Maine becomes a dry state." },
         { "day":"6", "month":"11", "year":"1917", "text": "The Bolshevik \"October Revolution\" (October 25 on the old Russian calendar), led by Vladimir Lenin and Leon Trotsky, seizes power in Petrograd." },
         { "day":"6", "month":"11", "year":"1923", "text": "As European inflation soars, one loaf of bread in Berlin is reported to be worth about 140 billion German marks." },
         { "day":"6", "month":"11", "year":"1945", "text": "The first landing of a jet on a carrier takes place on USS Wake Island when an FR-1 Fireball touches down." },
         { "day":"6", "month":"11", "year":"1973", "text": "Coleman Young becomes the first African-American mayor of Detroit, Michigan." },
         { "day":"6", "month":"11", "year":"1985", "text": "Guerrillas of the leftist 19th of April Movement seize Colombia’s Palace of Justice in Bogata; during the two-day siege and the military assault to retake the building over 100 people are killed, including 11 of the 25 Supreme Court justices." },
         { "day":"6", "month":"11", "year":"1986", "text": "A British International Helicopters Boeing 234LRR Chinook crashes 2.5 miles east of Sumburgh Airport; 45 people are killed, the deadliest civilian helicopter crash to date (2013)." },
         { "day":"6", "month":"11", "year":"1986", "text": "The Iran arms-for-hostages deal is revealed, damaging the Reagan administration." },
         { "day":"6", "month":"11", "year":"1995", "text": "The Rova of Antananarivo, home of Madagascar’s sovereigns from the 16th to the 19th centuries, is destroyed by fire." },
         { "day":"6", "month":"11", "year":"1999", "text": "Australia’s voters reject a referendum to make the country a republic with a president appointed by Parliament." }
      ]
   }
]
