[
   {
      "facts":[
         { "day":"10", "month":"5", "year":"1285", "text": "Philip III of Spain is succeeded by Philip IV (\"the Fair\")." },
         { "day":"10", "month":"5", "year":"1503", "text": "Christopher Columbus discovers the Cayman Islands." },
         { "day":"10", "month":"5", "year":"1676", "text": "Bacon’s Rebellion begins in the New World." },
         { "day":"10", "month":"5", "year":"1773", "text": "To keep the troubled East India Company afloat, Parliament passes the Tea Act, taxing all tea in the American colonies." },
         { "day":"10", "month":"5", "year":"1774", "text": "Louis XVI succeeds his father Louis XV as King of France." },
         { "day":"10", "month":"5", "year":"1775", "text": "American troops capture Fort Ticonderoga from the British." },
         { "day":"10", "month":"5", "year":"1794", "text": "Elizabeth, the sister of King Louis XVI, is beheaded." },
         { "day":"10", "month":"5", "year":"1796", "text": "Napoleon Bonaparte wins a brilliant victory against the Austrians at Lodi bridge in Italy." },
         { "day":"10", "month":"5", "year":"1840", "text": "Mormon leader Joseph Smith moves his band of followers to Illinois to escape the hostilities they experienced in Missouri." },
         { "day":"10", "month":"5", "year":"1857", "text": "The Bengal Army in India revolts against the British." },
         { "day":"10", "month":"5", "year":"1863", "text": "General Thomas \"Stonewall\" Jackson succumbs to illness and wounds received during the Battle of Chancellorsville." },
         { "day":"10", "month":"5", "year":"1865", "text": "Union cavalry troops capture Confederate President Jefferson Davis near Irvinville, Georgia." },
         { "day":"10", "month":"5", "year":"1869", "text": "The Central Pacific and Union Pacific railroads meet in Promontory, Utah." },
         { "day":"10", "month":"5", "year":"1859", "text": "French emperor Napoleon III leaves Paris to join his troops preparing to battle the Austrian army in Northern Italy." },
         { "day":"10", "month":"5", "year":"1872", "text": "Victoria Woodhull becomes first woman nominated for U.S. president." },
         { "day":"10", "month":"5", "year":"1917", "text": "Allied ships get destroyer escorts to fend off German attacks in the Atlantic." },
         { "day":"10", "month":"5", "year":"1924", "text": "J. Edgar Hoover is appointed head of the Federal Bureau of Investigation." },
         { "day":"10", "month":"5", "year":"1928", "text": "WGY-TV in Schenectady, New York, begins regular television programming." },
         { "day":"10", "month":"5", "year":"1933", "text": "Nazis begin burning books by \"unGerman\" writers such as Heinrich Mann and Erich Maria Remarque, author of All Quiet on the Western Front." },
         { "day":"10", "month":"5", "year":"1940", "text": "German forces begin a blitzkrieg of the Netherlands, Belgium and Luxembourg, skirting France’s \"impenetrable\" Maginot Line." },
         { "day":"10", "month":"5", "year":"1940", "text": "Winston Churchill succeeds Neville Chamberlain as British Prime Minister." },
         { "day":"10", "month":"5", "year":"1941", "text": "England’s House of Commons is destroyed during the worst of the London Blitz: 550 German bombers drop 100,000 incendiary bombs." },
         { "day":"10", "month":"5", "year":"1960", "text": "The USS Nautilus completes first circumnavigation of globe underwater." },
         { "day":"10", "month":"5", "year":"1994", "text": "Nelson Mandela is sworn in as South Africa’s first black president." }
      ]
   }
]
