[
   {
      "facts":[
         { "day":"18", "month":"5", "year":"526	", "text": "St. John I ends his reign as Catholic Pope." },
         { "day":"18", "month":"5", "year":"1643", "text": "Queen Anne, the widow of Louis XIII, is granted sole and absolute power as regent by the Paris parliament, overriding the late king’s will." },
         { "day":"18", "month":"5", "year":"1652", "text": "A law is passed in Rhode Island banning slavery in the colonies but it causes little stir and seems unlikely to be enforced." },
         { "day":"18", "month":"5", "year":"1792", "text": "Russian troops invade Poland." },
         { "day":"18", "month":"5", "year":"1802", "text": "Britain declares war on France." },
         { "day":"18", "month":"5", "year":"1804", "text": "Napoleon Bonaparte becomes the Emperor of France." },
         { "day":"18", "month":"5", "year":"1828", "text": "The Battle of Las Piedras, between Uruguay and Brazil, ends." },
         { "day":"18", "month":"5", "year":"1860", "text": "Abraham Lincoln is nominated for president." },
         { "day":"18", "month":"5", "year":"1864", "text": "The fighting at Spotsylvania in Virginia, reaches its peak at the Bloody Angle." },
         { "day":"18", "month":"5", "year":"1896", "text": "The Supreme Court’s decision on Plessy v. Ferguson upholds the \"separate but equal\" policy in the United States." },
         { "day":"18", "month":"5", "year":"1904", "text": "Brigand Raizuli kidnaps American Ion H. Perdicaris in Morocco." },
         { "day":"18", "month":"5", "year":"1917", "text": "The U.S. Congress passes the Selective Service act, calling up soldiers to fight World War I." },
         { "day":"18", "month":"5", "year":"1931", "text": "Japanese pilot Seiji Yoshihara crashes his plane in the Pacific Ocean while trying to be the first to cross the ocean nonstop. He is picked up seven hours later by a passing ship." },
         { "day":"18", "month":"5", "year":"1933", "text": "President Franklin Roosevelt signs the Tennessee Valley Authority Act." },
         { "day":"18", "month":"5", "year":"1942", "text": "New York ends night baseball games for the rest of World War II." },
         { "day":"18", "month":"5", "year":"1944", "text": "The Allies finally capture Monte Cassino in Italy." },
         { "day":"18", "month":"5", "year":"1951", "text": "The United Nations moves its headquarters to New York city." },
         { "day":"18", "month":"5", "year":"1969", "text": "Two battalions of the 101st Airborne Division assault Hill 937 but cannot reach the top because of muddy conditions." },
         { "day":"18", "month":"5", "year":"1974", "text": "India becomes sixth nation to explode an atomic bomb." },
         { "day":"18", "month":"5", "year":"1980", "text": "After rumbling for two months, Mount Saint Helens, in Washington, erupts 3 times in 24 hours." }
      ]
   }
]
