[
   {
      "facts":[
         { "day":"2", "month":"5", "year":"1670", "text": "The Hudson Bay Company is founded." },
         { "day":"2", "month":"5", "year":"1598", "text": "Henry IV signs Treaty of Vervins, ending Spain’s interference in France." },
         { "day":"2", "month":"5", "year":"1668", "text": "Peace of Aix-la-Chapelle ends the War of Devolution in France." },
         { "day":"2", "month":"5", "year":"1776", "text": "France and Spain agree to donate arms to American rebels fighting the British." },
         { "day":"2", "month":"5", "year":"1797", "text": "A mutiny in the British navy spreads from Spithead to the rest of the fleet." },
         { "day":"2", "month":"5", "year":"1798", "text": "The black General Toussaint L’ouverture forces British troops to agree to evacuate the port of Santo Domingo." },
         { "day":"2", "month":"5", "year":"1808", "text": "The citizens of Madrid rise up against Napoleon." },
         { "day":"2", "month":"5", "year":"1813", "text": "Napoleon defeats a Russian and Prussian army at Grossgorschen." },
         { "day":"2", "month":"5", "year":"1863", "text": "Stonewall Jackson smashes Hooker’s flank at Chancellorsville, Virginia." },
         { "day":"2", "month":"5", "year":"1865", "text": "President Andrew Johnson offers a $100,000 reward for the capture of Confederate President" },
         { "day":"2", "month":"5", "year":"1885", "text": "King Leopold II of Belgium establishes the Congo Free State." },
         { "day":"2", "month":"5", "year":"1890", "text": "The Territory of Oklahoma is created." },
         { "day":"2", "month":"5", "year":"1919", "text": "The first U.S. air passenger service starts." },
         { "day":"2", "month":"5", "year":"1923", "text": "Lieutenants Okaley Kelly and John Macready take off from New York for the West Coast on what will become the first successful nonstop transcontinental flight." },
         { "day":"2", "month":"5", "year":"1941", "text": "Hostilities break out between British forces in Iraq and that country’s pro-German faction." },
         { "day":"2", "month":"5", "year":"1942", "text": "Admiral Chester J. Nimitz, convinced that the Japanese will attack Midway Island, visits the island to review its readiness." },
         { "day":"2", "month":"5", "year":"1945", "text": "Russian forces take Berlin after 12 days of fierce house-to-house fighting." },
         { "day":"2", "month":"5", "year":"1946", "text": "Prisoners revolt at California’s Alcatraz prison." },
         { "day":"2", "month":"5", "year":"1968", "text": "The U.S. Army attacks Nhi Ha in South Vietnam and begins a fourteen-day battle to wrestle it away from Vietnamese Communists." },
         { "day":"2", "month":"5", "year":"1970", "text": "Student anti-war protesters at Ohio’s Kent State University burn down the campus ROTC building. The National Guard takes control of campus." }
      ]
   }
]
