[
   {
      "facts":[
         { "day":"22", "month":"5", "year":"1246", "text": "Henry Raspe is elected anti-king by the Rhenish prelates in France." },
         { "day":"22", "month":"5", "year":"1455", "text": "King Henry VI is taken prisoner by the Yorkists at the Battle of St. Albans, during the War of the Roses." },
         { "day":"22", "month":"5", "year":"1804", "text": "The Lewis and Clark Expedition officially begins as the Corps of Discovery departs from St. Charles, Missouri." },
         { "day":"22", "month":"5", "year":"1856", "text": "U.S. Congressman Preston Brooks of South Carolina beats Senator Charles Sumner with a cane for Sumner’s earlier condemnation of slavery, which included an insult to Brooks’ cousin, Senator Andrew Butler." },
         { "day":"22", "month":"5", "year":"1863", "text": "Union General Ulysses S. Grant’s second attack on Vicksburg fails and a siege begins." },
         { "day":"22", "month":"5", "year":"1868", "text": "The \"Great Train Robbery\" takes place as seven members of the Reno Gang make off with $98,000 in cash from a train’s safe in Indiana." },
         { "day":"22", "month":"5", "year":"1872", "text": "The Amnesty Act restores civil rights to Southerners." },
         { "day":"22", "month":"5", "year":"1882", "text": "The United States formally recognizes Korea." },
         { "day":"22", "month":"5", "year":"1908", "text": "The Wright brothers register their flying machine for a U.S. patent." },
         { "day":"22", "month":"5", "year":"1939", "text": "Adolf Hitler and Benito Mussolini sign a \"Pact of Steel\" forming the Axis powers." },
         { "day":"22", "month":"5", "year":"1947", "text": "The Truman Doctrine brings aid to Turkey and Greece." },
         { "day":"22", "month":"5", "year":"1967", "text": "The children’s program Mister Rogers’ Neighborhood premiers." },
         { "day":"22", "month":"5", "year":"1972", "text": "Ceylon becomes the Republic of Sri Lanka as its constitution is ratified." },
         { "day":"22", "month":"5", "year":"1985", "text": "Baseball player Pete Rose passes Hank Aaron as National League run scoring leader with 2,108." },
         { "day":"22", "month":"5", "year":"1990", "text": "In the Middle East, North and South Yemen merge to become a single state." },
         { "day":"22", "month":"5", "year":"1992", "text": "Johnny Carson’s final appearance on The Tonight Show on NBC, after 30 years as the program’s host." },
         { "day":"22", "month":"5", "year":"2004", "text": "An EF4 tornado with a record-setting width of 2.5 miles wipes out Hallam, Nebraska, killing 1 person." },
         { "day":"22", "month":"5", "year":"2004", "text": "Farenheit 9-11, directed by Michael Moore, becomes the first documentary ever to win the Palme d’Or at the Cannes Film Festival." },
         { "day":"22", "month":"5", "year":"2010", "text": "Following a 200-year search for the tomb of Polish astronomer Nicolaus Copernicus his remains are reburied in Frombork Cathedral" },
         { "day":"22", "month":"5", "year":"2011", "text": "An EF5 tornado kills at least 158 people in Joplin, Missouri, the largest death toll from a tornado since record-keeping began in 1950." },
         { "day":"22", "month":"5", "year":"2015", "text": "The Republic of Ireland, long known as a conservative, predominantly Catholic country, becomes the first nation in the world to legalize gay marriage in a public referendum." }
      ]
   }
]
