[
   {
      "facts":[
         { "day":"24", "month":"5", "year":"1543", "text": "Nicolaus Copernicus publishes proof of a sun-centered solar system. He dies just after publication." },
         { "day":"24", "month":"5", "year":"1607", "text": "Captain Christopher Newport and 105 followers found the colony of Jamestown at the mouth of the James River on the coast of Virginia." },
         { "day":"24", "month":"5", "year":"1610", "text": "Sir Thomas Gates institutes \"laws divine moral and marshal, \" a harsh civil code for Jamestown." },
         { "day":"24", "month":"5", "year":"1624", "text": "After years of unprofitable operation, Virginia’s charter is revoked and it becomes a royal colony." },
         { "day":"24", "month":"5", "year":"1689", "text": "English Parliament passes the Act of Toleration, protecting Protestants. Roman Catholics are specifically excluded from exemption." },
         { "day":"24", "month":"5", "year":"1738", "text": "The Methodist Church is established." },
         { "day":"24", "month":"5", "year":"1764", "text": "Boston lawyer James Otis denounces \"taxation without representation,\" calling for the colonies to unite in opposition to Britain’s new tax measures." },
         { "day":"24", "month":"5", "year":"1798", "text": "Believing that a French invasion of Ireland is imminent, Irish nationalists rise up against the British occupation." },
         { "day":"24", "month":"5", "year":"1844", "text": "Samuel Morse taps out the first telegraph message." },
         { "day":"24", "month":"5", "year":"1846", "text": "General Zachary Taylor captures Monterey." },
         { "day":"24", "month":"5", "year":"1861", "text": "General Benjamin Butler declares slaves to be the contraband of war." },
         { "day":"24", "month":"5", "year":"1863", "text": "Bushwackers led by Captain William Marchbanks attack a Federal militia party in Nevada, Missouri." },
         { "day":"24", "month":"5", "year":"1878", "text": "The first American bicycle race is held in Boston." },
         { "day":"24", "month":"5", "year":"1930", "text": "Amy Johnson becomes the first woman to fly from England to Australia." },
         { "day":"24", "month":"5", "year":"1941", "text": "The British battleship Hood is sunk by the German battleship Bismarck. There are only three survivors." },
         { "day":"24", "month":"5", "year":"1951", "text": "Willie Mays begins playing for the New York Giants." },
         { "day":"24", "month":"5", "year":"1961", "text": "Civil rights activists are arrested in Jackson, Mississippi." }
      ]
   }
]
