[
   {
      "facts":[
         { "day":"27", "month":"5", "year":"1564", "text": "John Calvin, one of the dominant figures of the Protestant Reformation, dies in Geneva." },
         { "day":"27", "month":"5", "year":"1647", "text": "Achsah Young becomes the first woman known to be executed as a witch in Massachusetts." },
         { "day":"27", "month":"5", "year":"1668", "text": "Three colonists are expelled from Massachusetts for being Baptists." },
         { "day":"27", "month":"5", "year":"1813", "text": "Americans capture Fort George, Canada." },
         { "day":"27", "month":"5", "year":"1907", "text": "The Bubonic Plague breaks out in San Francisco." },
         { "day":"27", "month":"5", "year":"1919", "text": "A U.S. Navy seaplane completes the first transatlantic flight." },
         { "day":"27", "month":"5", "year":"1929", "text": "Colonel Charles Lindbergh marries Anne Spencer Murrow." },
         { "day":"27", "month":"5", "year":"1935", "text": "The Supreme Court declares President Franklin Roosevelt’s National Recovery Act unconstitutional." },
         { "day":"27", "month":"5", "year":"1937", "text": "San Francisco’s Golden Gate Bridge opens." },
         { "day":"27", "month":"5", "year":"1941", "text": "The German battleship Bismarck is sunk by British naval and air forces." },
         { "day":"27", "month":"5", "year":"1942", "text": "German General Rommel begins a major offensive in Libya with his Afrika Korps." },
         { "day":"27", "month":"5", "year":"1944", "text": "American General MacArthur lands on Biak Island in New Guinea." },
         { "day":"27", "month":"5", "year":"1960", "text": "A military coup overthrows the democratic government of Turkey." },
         { "day":"27", "month":"5", "year":"1969", "text": "Construction begins on Walt Disney World in Florida." },
         { "day":"27", "month":"5", "year":"1972", "text": "President Richard M. Nixon and Soviet Communist Party chief Leonid Brezhnev sign an arms reduction agreement." },
         { "day":"27", "month":"5", "year":"1999", "text": "The international war crimes tribunal indicts Yugoslav president Slobodan Milosevic for war atrocities." }
      ]
   }
]
