   [
   {
      "facts":[
         { "day":"5", "month":"5", "year":"1494", "text": "Christopher Columbus lands on the island of Jamaica, which he names Santa Gloria." },
         { "day":"5", "month":"5", "year":"1814", "text": "British attack the American forces at Ft. Ontario, Oswego, New York." },
         { "day":"5", "month":"5", "year":"1821", "text": "Napoleon Bonaparte dies in exile on the island of St. Helena." },
         { "day":"5", "month":"5", "year":"1834", "text": "The first mainland railway line opens in Belgium." },
         { "day":"5", "month":"5", "year":"1862", "text": "Union and Confederate forces clash at the Battle of Williamsburg, part of the Peninsula Campaign." },
         { "day":"5", "month":"5", "year":"1862", "text": "Mexican forces loyal to Benito Juarez defeat troops sent by Napoleon III in the Battle of Puebla." },
         { "day":"5", "month":"5", "year":"1865", "text": "The 13th Amendment is ratified, abolishing slavery." },
         { "day":"5", "month":"5", "year":"1886", "text": "A bomb explodes on the fourth day of a workers’ strike in Chicago." },
         { "day":"5", "month":"5", "year":"1912", "text": "Soviet Communist Party newspaper Pravda begins publishing." },
         { "day":"5", "month":"5", "year":"1916", "text": "U.S. Marines invade the Dominican Republic." },
         { "day":"5", "month":"5", "year":"1917", "text": "Eugene Jacques Bullard becomes the first African-American aviator when he earns a flying certificate with the French Air Service." },
         { "day":"5", "month":"5", "year":"1920", "text": "Anarchists Nicola Sacco and Bartolomeo Vanzetti are arrested for murder." },
         { "day":"5", "month":"5", "year":"1935", "text": "American Jesse Owens sets the long jump record." },
         { "day":"5", "month":"5", "year":"1942", "text": "General Joseph Stilwell learns that the Japanese have cut his railway out of China and is forced to lead his troops into India." },
         { "day":"5", "month":"5", "year":"1945", "text": "Holland and Denmark are liberated from Nazi control." },
         { "day":"5", "month":"5", "year":"1961", "text": "Alan Shepard becomes the first American in space." },
         { "day":"5", "month":"5", "year":"1965", "text": "173rd Airborne Brigade arrives in Bien Hoa-Vung, Vietnam, the first regular U.S. Army unit deployed to that country." },
         { "day":"5", "month":"5", "year":"1968", "text": "U.S. Air Force planes hit Nhi Ha, South Vietnam in support of attacking infantrymen." },
         { "day":"5", "month":"5", "year":"1969", "text": "Pulitzer Prize awarded to Norman Mailer for his ‘nonfiction novel’ Armies of the Night, an account of the 1967 anti-Vietnam War march on the Pentagon." },
         { "day":"5", "month":"5", "year":"1987", "text": "Congress opens Iran-Contra hearings." },
         { "day":"5", "month":"5", "year":"2000", "text": "The Sun, Earth, Mercury, Venus, Mars, Jupiter and Saturn align – Earth’s moon is also almost in this alignment – leading to Doomsday predictions of massive natural disasters, although such a ‘grand confluence’ occurs about once in every century." }
      ]
   }
]
