[
   {
      "facts":[
         { "day":"6", "month":"5", "year":"1527", "text": "German troops begin sacking Rome. Libraries are destroyed, the Pope is captured and thousands are killed." },
         { "day":"6", "month":"5", "year":"1529", "text": "Babur defeats the Afgan Chiefs in the Battle of Ghagra, India." },
         { "day":"6", "month":"5", "year":"1682", "text": "King Louis XIV moves his court to Versailles, France." },
         { "day":"6", "month":"5", "year":"1856", "text": "U.S. Army troops from Fort Tejon and Fort Miller prepare to ride out to protect Keyesville, California, from Yokut Indian attack." },
         { "day":"6", "month":"5", "year":"1861", "text": "Arkansas becomes the ninth state to secede from the Union." },
         { "day":"6", "month":"5", "year":"1862", "text": "Henry David Thoreau dies of tuberculosis at age 44." },
         { "day":"6", "month":"5", "year":"1864", "text": "In the second day of the Battle of Wilderness between Union General Ulysses S. Grant and Confederate General Robert E. Lee, Confederate Gen. James Longstreet is wounded by his own men." },
         { "day":"6", "month":"5", "year":"1877", "text": "Chief Crazy Horse surrenders to U.S. troops in Nebraska.Crazy Horse brought General Custer to his end." },
         { "day":"6", "month":"5", "year":"1937", "text": "The dirigible Hindenburg explodes in flames at Lakehurst, New Jersey." },
         { "day":"6", "month":"5", "year":"1941", "text": "Bob Hope gives his first USO show at California’s March Field." },
         { "day":"6", "month":"5", "year":"1942", "text": "General Jonathan Wainwright surrenders Corregidor to the Japanese." },
         { "day":"6", "month":"5", "year":"1944", "text": "The Red Army besieges and captures Sevastopol in the Crimea." },
         { "day":"6", "month":"5", "year":"1945", "text": "Axis Sally makes her final propaganda broadcast to Allied troops." },
         { "day":"6", "month":"5", "year":"1954", "text": "British runner Roger Banister breaks the four minute mile." },
         { "day":"6", "month":"5", "year":"1960", "text": "President Dwight D. Eisenhower signs the Civil Rights Act of 1960." },
         { "day":"6", "month":"5", "year":"1962", "text": "The first nuclear warhead is fired from a Polaris submarine." },
         { "day":"6", "month":"5", "year":"1994", "text": "The Channel Tunnel linking England to France is officially opened." }
      ]
   }
]
