[
   {
      "facts":[
         { "day":"8", "month":"5", "year":"1450", "text": "Jack Cade’s Rebellion–Kentishmen revolt against King Henry VI." },
         { "day":"8", "month":"5", "year":"1541", "text": "Hernando de Soto discovers the Mississippi River which he calls Rio de Espiritu Santo." },
         { "day":"8", "month":"5", "year":"1559", "text": "An act of supremacy defines Queen Elizabeth I as the supreme governor of the church of England." },
         { "day":"8", "month":"5", "year":"1794", "text": "The United States Post Office is established." },
         { "day":"8", "month":"5", "year":"1846", "text": "The first major battle of the Mexican War is fought at Palo Alto, Texas." },
         { "day":"8", "month":"5", "year":"1862", "text": "General ‘Stonewall’ Jackson repulses the Federals at the Battle of McDowell, in the Shenendoah Valley." },
         { "day":"8", "month":"5", "year":"1864", "text": "Union troops arrive at Spotsylvania Court House to find the Confederates waiting for them." },
         { "day":"8", "month":"5", "year":"1886", "text": "Atlanta pharmacist John Pemberton invents Coca Cola." },
         { "day":"8", "month":"5", "year":"1895", "text": "China cedes Taiwan to Japan under Treaty of Shimonoseki." },
         { "day":"8", "month":"5", "year":"1904", "text": "U.S. Marines land in Tangier, North Africa, to protect the Belgian legation." },
         { "day":"8", "month":"5", "year":"1919", "text": "The first transatlantic flight by a navy seaplane takes-off." },
         { "day":"8", "month":"5", "year":"1933", "text": "Mahatma Gandhi—actual name Mohandas Karamchand Gandhi—begins a hunger strike to protest British oppression in India." },
         { "day":"8", "month":"5", "year":"1940", "text": "German commandos in Dutch uniforms cross the Dutch border to hold bridges for the advancing German army." },
         { "day":"8", "month":"5", "year":"1942", "text": "The Battle of the Coral Sea between the Japanese Navy and the U.S. Navy ends." },
         { "day":"8", "month":"5", "year":"1945", "text": "The final surrender of German forces is celebrated as VE (Victory Europe) day." },
         { "day":"8", "month":"5", "year":"1952", "text": "Allied fighter-bombers stage the largest raid of the war on North Korea." },
         { "day":"8", "month":"5", "year":"1958", "text": "President Eisenhower orders the National Guard out of Little Rock as Ernest Green becomes the first black to graduate from an Arkansas public school." },
         { "day":"8", "month":"5", "year":"1967", "text": "Boxer Muhammad Ali is indicted for refusing induction in U.S. Army." },
         { "day":"8", "month":"5", "year":"1984", "text": "The Soviet Union announces it will not participate in Summer Olympics planned for Los Angeles." },
         { "day":"8", "month":"5", "year":"1995", "text": "Jacques Chirac is elected president of France." }
      ]
   }
]
