[
   {
      "facts":[
         { "day":"10", "month":"12", "year":"1817", "text": "Mississippi is admitted as the 20th state." },
         { "day":"10", "month":"12", "year":"1861", "text": "Kentucky is admitted to the Confederate States of America." },
         { "day":"10", "month":"12", "year":"1862", "text": "The U.S. House of Representatives passes a bill creating the state of West Virginia." },
         { "day":"10", "month":"12", "year":"1869", "text": "Governor John Campbell signs the bill that grants women in Wyoming Territory the right to vote as well as hold public office." },
         { "day":"10", "month":"12", "year":"1898", "text": "The United States and Spain sign the Treaty of Paris, ceding Spanish possessions, including the Philippines, to the United States." },
         { "day":"10", "month":"12", "year":"1917", "text": "The Nobel Peace Prize is awarded to the International Red Cross." },
         { "day":"10", "month":"12", "year":"1918", "text": "U.S. troops are called to guard Berlin as a coup is feared." },
         { "day":"10", "month":"12", "year":"1919", "text": "Captain Ross Smith becomes the first person to fly 11,500 miles from England to Australia." },
         { "day":"10", "month":"12", "year":"1936", "text": "Edward VIII abdicates to marry Wallis Warfield Simpson, an American-born divorcee." },
         { "day":"10", "month":"12", "year":"1941", "text": "Japanese troops invade the Philippine island of Luzon." },
         { "day":"10", "month":"12", "year":"1941", "text": "The siege of Tobruk in North Africa is raised." },
         { "day":"10", "month":"12", "year":"1943", "text": "Franklin D. Roosevelt signs a bill that postpones a draft of pre-Pearl Harbor fathers." },
         { "day":"10", "month":"12", "year":"1943", "text": "Allied forces bomb Sofia, the capital of Bulgaria." },
         { "day":"10", "month":"12", "year":"1949", "text": "150,000 French troops mass at the border in Vietnam to prevent a Chinese invasion." },
         { "day":"10", "month":"12", "year":"1950", "text": "Dr. Ralph J. Bunche becomes the first African-American to be awarded the Nobel Peace Prize." },
         { "day":"10", "month":"12", "year":"1977", "text": "On UN Human Rights Day, the Soviet Union places 20 prominent dissidents under house arrest, cutting off telephones and threatening to break up a planned silent demonstration in Moscow’s Pushkin Square. Soviet newspapers decry human rights violations elsewhere in the world." },
         { "day":"10", "month":"12", "year":"1978", "text": "President of Egypt Anwar Sadat and Prime Minister of Israel Menachem Begin are jointly awarded the Nobel Peace Prize." },
         { "day":"10", "month":"12", "year":"1983", "text": "Democracy restored to Argentina with the assumption of Raul Alfonsin." },
         { "day":"10", "month":"12", "year":"1989", "text": "Tsakhiagiin Elbegdorj announces the establishment of Mongolia’s democratic movement that changes the second oldest communist country into a democracy." },
         { "day":"10", "month":"12", "year":"1993", "text": "The Wearmouth Colliery in Sunderland, East England, closes, marking the end of the County Durham coalfield, which had been in operation since the Middle Ages." }
      ]
   }
]
