[
   {
      "facts":[
         { "day":"16", "month":"12", "year":"1431", "text": "Henry VI of England is crowned King of France." },
         { "day":"16", "month":"12", "year":"1653", "text": "Oliver Cromwell takes on dictatorial powers with the title of \"Lord Protector.\"" },
         { "day":"16", "month":"12", "year":"1773", "text": "To protest the tax on tea from England, a group of young Americans, disguised as Indians, throw chests of tea from British ships in Boston Harbor." },
         { "day":"16", "month":"12", "year":"1835", "text": "A fire in New York City destroys property estimated to be worth $20,000,000. It lasts two days, ravages 17 blocks, and destroys 674 buildings including the Stock Exchange, Merchants’ Exchange, Post Office, and the South Dutch Church." },
         { "day":"16", "month":"12", "year":"1863", "text": "Confederate General Joseph Johnston takes command of the Army of Tennessee." },
         { "day":"16", "month":"12", "year":"1864", "text": "Union forces under General George H. Thomas win the battle at Nashville, smashing an entire Confederate army." },
         { "day":"16", "month":"12", "year":"1930", "text": "In Spain, a general strike is called in support of the revolution." },
         { "day":"16", "month":"12", "year":"1939", "text": "The National Women’s Party urges immediate congressional action on equal rights." },
         { "day":"16", "month":"12", "year":"1940", "text": "British troops carry out an air raid on Italian Somalia." },
         { "day":"16", "month":"12", "year":"1944", "text": "Germany mounts a major offensive in the Ardennes Forest in Belgium. As the center of the Allied line falls back, it creates a bulge, leading to the name–the Battle of the Bulge." },
         { "day":"16", "month":"12", "year":"1949", "text": "Chinese Communist leader Mao Tse-tung is received at the Kremlin in Moscow." },
         { "day":"16", "month":"12", "year":"1950", "text": "President Harry Truman declares a state of National Emergency as Chinese communists invade deeper into South Korea." },
         { "day":"16", "month":"12", "year":"1976", "text": "President Jimmy Carter appoints Andrew Young as Ambassador to the United Nations." },
         { "day":"16", "month":"12", "year":"1978", "text": "Cleveland becomes the first U.S. city to default since the depression." },
         { "day":"16", "month":"12", "year":"1998", "text": "The United States launches a missile attack on Iraq for failing to comply with United Nations weapons inspectors." },
         { "day":"16", "month":"12", "year":"2003", "text": "President George W. Bush signs the CAN-SPAM Act of 2003, which establishes the United States’ first national standards regarding email and gives the Federal Trade Commission authority to enforce the act." }
      ]
   }
]
