[
   {
      "facts":[
         { "day":"18", "month":"12", "year": "1118", "text": "Afonso the Battler, the Christian King of Aragon captures Saragossa, Spain, causing a major blow to Muslim Spain." },
         { "day":"18", "month":"12", "year": "1812", "text": "Napoleon Bonaparte arrives in Paris after his disastrous campaign in Russia." },
         { "day":"18", "month":"12", "year": "1862", "text": "Nathan Bedford Forrest engages and defeats a Federal cavalry force near Lexington in his continued effort to disrupt supply lines." },
         { "day":"18", "month":"12", "year": "1862", "text": "Union General Ulysses S. Grant announces the organization of his army in the West. Sherman, Hurlbut, McPherson, and McClernand are to be corps commanders." },
         { "day":"18", "month":"12", "year": "1865", "text": "Slavery is abolished in the United States. The 13th Amendment is formally adopted into the U.S. Constitution, ensuring that \"neither slavery nor involuntary servitude… shall exist within the United States, or any place subject to their jurisdiction.\"" },
         { "day":"18", "month":"12", "year": "1915", "text": "In a single night, about 20,000 Australian and New Zealand troops withdraw from Gallipoli, Turkey, undetected by the Turks defending the peninsula." },
         { "day":"18", "month":"12", "year": "1916", "text": "The Battle of Verdun ends with the French and Germans each having suffered more than 330,000 killed and wounded in 10 months. It was the longest engagement of World War I." },
         { "day":"18", "month":"12", "year": "1925", "text": "Soviet leaders Lev Kamenev and Grigori Zinoviev break with Joseph Stalin." },
         { "day":"18", "month":"12", "year": "1940", "text": "Adolf Hitler issues his secret plans for the invasion of the Soviet Union–Operation Barbarossa." },
         { "day":"18", "month":"12", "year": "1941", "text": "Defended by 610 fighting men, the American-held island of Guam falls to more than 5,000 Japanese invaders in a three-hour battle." },
         { "day":"18", "month":"12", "year": "1941", "text": "Japan invades Hong Kong." },
         { "day":"18", "month":"12", "year": "1942", "text": "Adolf Hitler meets with Benito Mussolini and Pierre Laval." },
         { "day":"18", "month":"12", "year": "1944", "text": "Japanese forces are repelled from northern Burma by British troops." },
         { "day":"18", "month":"12", "year": "1951", "text": "North Koreans give the United Nations a list of 3,100 POWs." },
         { "day":"18", "month":"12", "year": "1956", "text": "Japan is admitted to the United Nations." },
         { "day":"18", "month":"12", "year": "1960", "text": "A rightist government is installed under Prince Boun Oum in Laos as the United States resumes arms shipments." },
         { "day":"18", "month":"12", "year": "1965", "text": "U.S. Marines attack VC units in the Que Son Valley during Operation Harvest Moon." },
         { "day":"18", "month":"12", "year": "1970", "text": "An atomic leak in Nevada forces hundreds of citizens to flee the test site." },
         { "day":"18", "month":"12", "year": "1972", "text": "President Richard M. Nixon declares that the bombing of North Vietnam will continue until an accord can be reached (Operation Linebacker II)." },
         { "day":"18", "month":"12", "year": "1989", "text": "The European Economic Community and the Soviet Union sign an agreement on trade and economic communication." },
         { "day":"18", "month":"12", "year": "2002", "text": "California Gov. Gray Davis announces the state faces a record budget deficit; the looming $35 billion shortfall is almost double the amount reported a month earlier during the state’s gubernatorial campaign." },
         { "day":"18", "month":"12", "year": "2005", "text": "Civil war begins in Chad with an rebel assault on in Adre; the rebels are believed to be backed by Chad’s neighbor, The Sudan." },
         { "day":"18", "month":"12", "year": "2008", "text": "United Arab Emirates holds it first-ever elections." },
         { "day":"18", "month":"12", "year": "2010", "text": "In an opening act of Arab Spring, anti-government protests erupt in Tunisia." }      ]
   }
]
