[
   {
      "facts":[
        { "day":"2", "month":"12", "year":"1804", "text": "Napoleon Bonaparte crowns himself Emperor of France in Notre Dame Cathedral." },
        { "day":"2", "month":"12", "year":"1805", "text": "Napoleon Bonaparte celebrates the first anniversary of his coronation with a victory at Austerlitz over a Russian and Austrian army." },
        { "day":"2", "month":"12", "year":"1823", "text": "President James Monroe proclaims the principles known as the Monroe Doctrine, "that the American continents, by the free and independent condition which they have assumed and maintained, are henceforth not to be considered as subjects for future colonization by European powers."" },
        { "day":"2", "month":"12", "year":"1863", "text": "General Braxton Bragg turns over command of the Army of Tennessee to General William Hardee at Dalton, Ga." },
        { "day":"2", "month":"12", "year":"1864", "text": "Major General Grenville M. Dodge is named to replace General William Rosecrans as Commander of the Department of Missouri." },
        { "day":"2", "month":"12", "year":"1867", "text": "People wait in mile-long lines to hear Charles Dickens give his first reading in New York City." },
        { "day":"2", "month":"12", "year":"1907", "text": "Spain and France agree to enforce Moroccan measures adopted in 1906." },
        { "day":"2", "month":"12", "year":"1909", "text": "J.P. Morgan acquires majority holdings in Equitable Life Co. This is the largest concentration of bank power to date." },
        { "day":"2", "month":"12", "year":"1914", "text": "Austrian troops occupy Belgrade, Serbia." },
        { "day":"2", "month":"12", "year":"1918", "text": "Armenia proclaims independence from Turkey." },
        { "day":"2", "month":"12", "year":"1921", "text": "The first successful helium dirigible, C-7, makes a test flight in Portsmouth, Va." },
        { "day":"2", "month":"12", "year":"1927", "text": "The new Ford Model A is introduced to the American public." },
        { "day":"2", "month":"12", "year":"1932", "text": "Bolivia accepts Paraguay’s terms for a truce in the Chaco War." },
        { "day":"2", "month":"12", "year":"1942", "text": "The Allies repel a strong Axis attack in Tunisia, North Africa." },
        { "day":"2", "month":"12", "year":"1944", "text": "General George S. Patton’s troops enter the Saar Valley and break through the Siegfried line." },
        { "day":"2", "month":"12", "year":"1946", "text": "The United States and Great Britain merge their German occupation zones." },
        { "day":"2", "month":"12", "year":"1964", "text": "Brazil sends Juan Peron back to Spain, foiling his efforts to return to his native land." },
        { "day":"2", "month":"12", "year":"1970", "text": "The U.S. Senate votes to give 48,000 acres of New Mexico back to the Taos Indians." },
        { "day":"2", "month":"12", "year":"1980", "text": "A death squad in El Salvador murders four US nuns and churchwomen." },
        { "day":"2", "month":"12", "year":"1982", "text": "Dentist Barney Clark receives the first permanent artificial heart, developed by Dr. Robert K. Jarvik." },
        { "day":"2", "month":"12", "year":"1993", "text": "NASA launches Space Shuttle Endeavor on a mission to repair the Hubble Space Telescope." },
        { "day":"2", "month":"12", "year":"1999", "text": "UK devolves political power in Northern Ireland to the Northern Ireland Executive, the administrative branch of the North Ireland legislature." },
        { "day":"2", "month":"12", "year":"2001", "text": "Enron files for Chapter 11 bankruptcy, one of the most complex bankruptcy cases in US history." }
      ]
   }
]
