[
   {
      "facts":[
         { "day":"22", "month":"12", "year": "1135", "text": "Stephen of Blois is crowned the king of England." },
         { "day":"22", "month":"12", "year": "1775", "text": "Esek Hopkins takes command of the Continental Navy — a total of seven ships." },
         { "day":"22", "month":"12", "year": "1807", "text": "Congress passes the Embargo Act, which halts all trading completely. It is hoped that the act will keep the United States out the European Wars." },
         { "day":"22", "month":"12", "year": "1829", "text": "The Baltimore & Ohio Railroad opens the first passenger railway line." },
         { "day":"22", "month":"12", "year": "1918", "text": "The last of the food restrictions, enforced because of the shortages during World War I, are lifted." },
         { "day":"22", "month":"12", "year": "1929", "text": "Soviet troops leave Manchuria after a truce is reached with the Chinese over the Eastern Railway dispute." },
         { "day":"22", "month":"12", "year": "1941", "text": "Japanese troops make an amphibious landing on the coast of Lingayen Gulf on Luzon, the Philippines." },
         { "day":"22", "month":"12", "year": "1942", "text": "The Soviets drive German troops back 15 miles at the Don River." },
         { "day":"22", "month":"12", "year": "1944", "text": "During the Battle of the Bulge, General Anthony McAuliffe responds to a German surrender request with a one word answer: \"Nuts!\"" },
         { "day":"22", "month":"12", "year": "1945", "text": "The United States recognizes Tito’s government in Yugoslavia." },
         { "day":"22", "month":"12", "year": "1965", "text": "The EF-105F Wild Weasel makes its first kill over Vietnam." },
         { "day":"22", "month":"12", "year": "1966", "text": "The United States announces the allocation of 900,000 tons of grain to fight the famine in India." },
         { "day":"22", "month":"12", "year": "1989", "text": "The Romanian government of Nicolae Ceausescu is overthrown, ending 42 years of communist rule." },
         { "day":"22", "month":"12", "year": "1989", "text": "The division of East and West Germany effectively ends when the Brandenburg Gate in Berlin reopens for the first time in nearly 30 years." },
         { "day":"22", "month":"12", "year": "1992", "text": "What became known as the Archives of Terror are discovered in a police station near the capital of Paraguay, records detailing tens of thousands of Latin Americans who had been secretly imprisoned, tortured and / or killed by the security services of several South American governments." },
         { "day":"22", "month":"12", "year": "1997", "text": "Hussein Farrah Aidid relinquishes his disputed title of President of Somalia, an important step toward reconciliation in the country." },
         { "day":"22", "month":"12", "year": "2001", "text": "President of Afghanistan, Hamid Karzai, takes over an interim government." },
         { "day":"22", "month":"12", "year": "2001", "text": "A passenger on American Airlines Flight 63 from Paris, Richard Reid, unsuccessfully attempts to destroy the plane in flight by igniting explosives he’d hidden in his shoes." },
         { "day":"22", "month":"12", "year": "2008", "text": "Some 1.1 billion gallons of coal fly ash slurry flood part of Tennessee after an ash dike breaks at a solid waste containment area in Roane County, in the eastern part of the state." },
         { "day":"22", "month":"12", "year": "2010", "text": "US President Barack Obama signs a law officially repealing the 17-year-old policy known as \"Don’t ask, don’t tell\"; the new law permits homosexuals to serve openly in the US military." }
      ]
   }
]
