[
   {
      "facts":[
         { "day":"25", "month":"12", "year": "376", "text": "In Milan, Ambrose, the Bishop of Milan, forces the emperor Theodosius to perform public penance for his massacre." },
         { "day":"25", "month":"12", "year": "800", "text": "The pope crowns Charlemagne emperor in Rome." },
         { "day":"25", "month":"12", "year": "1066", "text": "William I is crowned king of England." },
         { "day":"25", "month":"12", "year": "1621", "text": "The governor of New Plymouth prevents newcomers from playing cards." },
         { "day":"25", "month":"12", "year": "1651", "text": "The General Court of Boston levies a five shilling fine on anyone caught "observing any such day as Christmas."" },
         { "day":"25", "month":"12", "year": "1776", "text": "Patriot General George Washington crosses the Delaware River with 5,400 troops during the American Revolution. Washington hoped to surprise a Hessian force celebrating Christmas at their winter quarters in Trenton, New Jersey." },
         { "day":"25", "month":"12", "year": "1861", "text": "Stonewall Jackson spends Christmas with his wife; their last together." },
         { "day":"25", "month":"12", "year": "1862", "text": "John Hunt Morgan and his raiders clash with Union forces near Bear Wallow, Kentucky." },
         { "day":"25", "month":"12", "year": "1862", "text": "President and Mrs. Lincoln visit hospitals in the Washington D.C. area on this Christmas Day." },
         { "day":"25", "month":"12", "year": "1912", "text": "Italy lands troops in Albania to protect its interests during a revolt there." },
         { "day":"25", "month":"12", "year": "1914", "text": "German and British troops on the Western Front declare an unofficial truce to celebrate Christmas during World War I." },
         { "day":"25", "month":"12", "year": "1918", "text": "A revolt erupts in Berlin." },
         { "day":"25", "month":"12", "year": "1925", "text": "U.S. troops in Nicaragua disarm insurgents in support of the Diaz regime." },
         { "day":"25", "month":"12", "year": "1927", "text": "The Mexican congress opens land to foreign investors, reversing the 1917 ban enacted to preserve the domestic economy." },
         { "day":"25", "month":"12", "year": "1939", "text": "Finnish troops enter Soviet territory." },
         { "day":"25", "month":"12", "year": "1941", "text": "Free French troops occupy the French Islands of St. Pierre and Miquelon off the Canadian coast." },
         { "day":"25", "month":"12", "year": "1944", "text": "Prime Minister Winston Churchill goes to Athens to seek an end to the Greek civil war." },
         { "day":"25", "month":"12", "year": "1946", "text": "Chiang Kai-shek offers a new Chinese constitution in Nanking pledging universal suffrage." },
         { "day":"25", "month":"12", "year": "1950", "text": "Scottish nationalists steal the Stone of Scone from the British coronation throne in Westminster Abbey. The 485 pound stone was recovered in April 1951." },
         { "day":"25", "month":"12", "year": "1962", "text": "The Bay of Pigs captives, upon their return to the United States, vow to return to Cuba and topple Fidel Castro." },
         { "day":"25", "month":"12", "year": "1965", "text": "Entertainer Chris Noel gives her first performance for the USO at two hospitals in California; became a star on Armed Forces Radio and Television, entertaining troops in Vietnam; in 1984 Veterans Network honored her with a Distinguished Vietnam Veteran award." },
         { "day":"25", "month":"12", "year": "1973", "text": "U.S. astronauts onboard the Skylab space station take a seven-hour walk in space and photograph the comet Kohoutek." },
         { "day":"25", "month":"12", "year": "1976", "text": "Over 100 Muslims, returning from a pilgrimage to Mecca, die when their boat sinks." },
         { "day":"25", "month":"12", "year": "1979", "text": "Egypt begins major restoration of the Sphinx." },
         { "day":"25", "month":"12", "year": "1991", "text": "Mikhail Gorbachev, the Soviet Union’s first and last executive president, resigns. The Soviet Union no longer exsists." },
         { "day":"25", "month":"12", "year": "2006", "text": "James Brown, the \"Godfather of Soul\", dies at age 73." }
      ]
   }
]
