[
   {
      "facts":[
         { "day":"27", "month":"12", "year": "1512", "text": "The laws of Burgos give New World natives legal protection against abuse and authorize Negro slavery." },
         { "day":"27", "month":"12", "year": "1831", "text": "HMS Beagle, with Charles Darwin on board, departs from Plymouth. It will eventually visit the Galapagos Islands where Darwin will form his theories on evolution." },
         { "day":"27", "month":"12", "year": "1862", "text": "Union General William Rosecrans’ army begins moving slowly toward Murfreesboro, Tennessee, from Nashville." },
         { "day":"27", "month":"12", "year": "1913", "text": "Charles Moyer, president of the Miners Union, is shot in the back and dragged through the streets of Chicago." },
         { "day":"27", "month":"12", "year": "1915", "text": "In Ohio, iron and steel workers go on strike for an eight-hour day and higher wages." },
         { "day":"27", "month":"12", "year": "1932", "text": "Radio City Music Hall opens." },
         { "day":"27", "month":"12", "year": "1933", "text": "Josef Stalin calls tensions with Japan a grave danger." },
         { "day":"27", "month":"12", "year": "1939", "text": "A series of vicious earthquakes take 11,000 lives in Turkey." },
         { "day":"27", "month":"12", "year": "1941", "text": "Japanese bombers attack Manila, despite its claim as an open city." },
         { "day":"27", "month":"12", "year": "1944", "text": "General George S. Patton’s Third Army, spearheaded by the 4th Armored Division, relieves the surrounded city of Bastogne in Belgium." },
         { "day":"27", "month":"12", "year": "1945", "text": "The International Monetary Fund and the Bank for Reconstruction and Development are created." },
         { "day":"27", "month":"12", "year": "1947", "text": "The new Italian constitution is promulgated in Rome." },
         { "day":"27", "month":"12", "year": "1950", "text": "The United States and Spain resume relations for the first time since the Spanish Civil War of the 1930s." },
         { "day":"27", "month":"12", "year": "1956", "text": "Segregation on buses in Tallahassee, Florida, is outlawed." },
         { "day":"27", "month":"12", "year": "1968", "text": "The United States agrees to sell F-4 Phantom jets to Israel." },
         { "day":"27", "month":"12", "year": "1979", "text": "President Hafizullah Amin of Afghanistan is ousted and murdered in a coup backed by the Soviet Union, beginning a war that will last more than 10 years." },
         { "day":"27", "month":"12", "year": "1983", "text": "President Reagan takes all responsibility for the lack of security in Beirut that allowed a terrorist on a suicide mission to kill 241 Marines." },
         { "day":"27", "month":"12", "year": "1984", "text": "Four Polish officers are tried for the slaying of Reverend Jerzy Popieluszko." },
         { "day":"27", "month":"12", "year": "1985", "text": "Palestinian guerrillas kill 18 people at airports in Rome and Vienna." },
         { "day":"27", "month":"12", "year": "1996", "text": "Taliban forces retake strategic Bagram Airfield during Afghan civil war." },
         { "day":"27", "month":"12", "year": "2001", "text": "China receives permanent normal trade relations with the US." },
         { "day":"27", "month":"12", "year": "2004", "text": "Radiation reaches Earth from the brightest extrasolar event ever witnessed, an explosion of magnetar SGR 1806-20." },
         { "day":"27", "month":"12", "year": "2007", "text": "Former Pakistani prime minister Benazir Bhutto assassinated." },
         { "day":"27", "month":"12", "year": "2007", "text": "After Mwai Kibaki is declared the winner of Kenya’s presidential elections, rioting begins in Mombasa, precipitating an economic, humanitarian and political crisis." }
      ]
   }
]
