[
   {
      "facts":[
         { "day":"3", "month":"12", "year":"1468",  "text": "Lorenzo the Magnificent and his brother Giuliano succeed their father, Piero de Medici, as rulers of Florence, Italy." },
         { "day":"3", "month":"12", "year":"1762",  "text": "France cedes to Spain all lands west of the Mississippi–the territory known as Upper Louisiana." },
         { "day":"3", "month":"12", "year":"1818",  "text": "Illinois admitted into the Union as the 21st state." },
         { "day":"3", "month":"12", "year":"1800",  "text": "The French defeat an Austrian army at the Battle of Hohenlinden, near Munich." },
         { "day":"3", "month":"12", "year":"1847",  "text": "Frederick Douglass and Martin R. Delaney establish the North Star, and anti-slavery paper." },
         { "day":"3", "month":"12", "year":"1862",  "text": "Confederate raiders attack a Federal forage train on the Hardin Pike near Nashville, Tenn." },
         { "day":"3", "month":"12", "year":"1863",  "text": "Confederate General James Longstreet moves his army east and north toward Greeneville. This withdrawal marks the end of the Fall Campaign in Tennessee." },
         { "day":"3", "month":"12", "year":"1864",  "text": "Major General William Tecumseh Sherman meets with slight resistance from Confederate troops at Thomas Station on his march to the sea." },
         { "day":"3", "month":"12", "year":"1906",  "text": "The U.S. Supreme Court orders Industrial Workers of the World (IWW) leaders extradited to Idaho for trial in the Steunenberg murder case." },
         { "day":"3", "month":"12", "year":"1915",  "text": "The United States expels German attaches on spy charges." },
         { "day":"3", "month":"12", "year":"1916",  "text": "French commander Joseph Joffre is dismissed after his failure at the Somme. General Robert Nivelle is the new French commander in chief." },
         { "day":"3", "month":"12", "year":"1918",  "text": "The Allied Conference ends in London where they decide that Germany must pay for the war." },
         { "day":"3", "month":"12", "year":"1925",  "text": "The League of Nations orders Greece to pay an indemnity for the October invasion of Bulgaria." },
         { "day":"3", "month":"12", "year":"1926",  "text": "British reports claim that German soldiers are being trained in the Soviet Union." },
         { "day":"3", "month":"12", "year":"1950",  "text": "The Chinese close in on Pyongyang, Korea, and UN forces withdraw southward." },
         { "day":"3", "month":"12", "year":"1965",  "text": "The National Council of Churches asks the United States to halt the massive bombings in North Vietnam." },
         { "day":"3", "month":"12", "year":"1977",  "text": "The State Department proposes the admission of 10,000 more Vietnamese refugees to the United States." },
         { "day":"3", "month":"12", "year":"1979",  "text": "Eleven are dead and eight injured in a mad rush to see a rock band (The Who) at a concert in Cincinnati, Ohio." },
         { "day":"3", "month":"12", "year":"1984",  "text": "Toxic gas leaks from a Union Carbide plant and results in the deaths of thousands in Bhopal, India." },
         { "day":"3", "month":"12", "year":"1989",  "text": "Presidents George Bush and Mikhail Gorbachev announce the official end to the Cold War at a meeting in Malta." },
         { "day":"3", "month":"12", "year":"1992",  "text": "A test engineer for Sema Group sends the world’s first text message, using a personal computer and the Vodafone network." },
         { "day":"3", "month":"12", "year":"1997",  "text": "Representatives of 121 nations sign the Ottawa Treaty prohibiting the manufacture or deployment of antipersonnel landmines; the People’s Republic of China, the US and the USSR do not sign." },
         { "day":"3", "month":"12", "year":"2005",  "text": "First manned rocket aircraft delivery of US Mail takes place in Mojave, Cal." },
         { "day":"3", "month":"12", "year":"2009",  "text": "Suicide bombing in Mogadishu, Somalia, kills 25 people, including three miniseries of the Transitional Federal Government." }
      ]
   }
]
