[
   {
      "facts":[
         { "day":"9", "month":"12", "year":"536	", "text": "Having captured Naples earlier in the year, Belisarius takes Rome." },
         { "day":"9", "month":"12", "year":"1861", "text": "The U.S. Senate approves establishment of a committee that would become the Joint Committee on the Conduct of War." },
         { "day":"9", "month":"12", "year":"1863", "text": "Major General John G. Foster replaces Maj. Gen. Ambrose E. Burnside as Commander of the Department of Ohio." },
         { "day":"9", "month":"12", "year":"1867", "text": "The capital of Colorado Territory is moved from Golden to Denver." },
         { "day":"9", "month":"12", "year":"1872", "text": "P.B.S. Pinchback becomes the first African-American governor of Louisiana." },
         { "day":"9", "month":"12", "year":"1900", "text": "The Russian czar rejects Boer Paul Kruger’s pleas for aid in South Africa against the British." },
         { "day":"9", "month":"12", "year":"1908", "text": "A child labor bill passes in the German Reichstag, forbidding work for children under age 13." },
         { "day":"9", "month":"12", "year":"1917", "text": "The new Finnish Republic demands the withdrawal of Russian troops." },
         { "day":"9", "month":"12", "year":"1940", "text": "The British army seizes 1,000 Italians in a sudden thrust in Egypt." },
         { "day":"9", "month":"12", "year":"1941", "text": "Franklin D. Roosevelt tells Americans to plan for a long war." },
         { "day":"9", "month":"12", "year":"1948", "text": "The United States abandons a plan to de-concentrate industry in Japan." },
         { "day":"9", "month":"12", "year":"1949", "text": "The United Nations takes trusteeship over Jerusalem." },
         { "day":"9", "month":"12", "year":"1950", "text": "President Harry Truman bans U.S. exports to Communist China." },
         { "day":"9", "month":"12", "year":"1950", "text": "Harry Gold gets 30 years imprisonment for passing atomic bomb secrets to the Soviet Union during World War II." },
         { "day":"9", "month":"12", "year":"1955", "text": "Sugar Ray Robinson knocks out Carl Olson to regain the world middleweight boxing title." },
         { "day":"9", "month":"12", "year":"1960", "text": "The Laos government flees to Cambodia as the capital city of Vientiane is engulfed in war." },
         { "day":"9", "month":"12", "year":"1990", "text": "Lech Walesa is elected president of Poland." },
         { "day":"9", "month":"12", "year":"1992", "text": "U.S. Marines land in Somalia to ensure food and medicine reaches the deprived areas of that country." },
         { "day":"9", "month":"12", "year":"2008", "text": "Governor of Illinois Rod Blagojevich is arrested on federal charges, including an attempt to sell the US Senate seat being vacated by President-elect Barack Obama." }
      ]
   }
]
