[
   {
      "facts":[
         { "day":"1", "month":"12", "year":"1135", "text": "Henry I of England dies and the crown is passed to his nephew Stephen of Bloise."},
         { "day":"1", "month":"12", "year":"1581", "text": "Edmund Champion and other Jesuit martyrs are hanged at Tyburn, England, for sedition, after being tortured."},
         { "day":"1", "month":"12", "year":"1861", "text": "The U.S. gunboat Penguin seizes the Confederate blockade runner Albion carrying supplies worth almost $100,000."},
         { "day":"1", "month":"12", "year":"1862", "text": "President Abraham Lincoln gives the State of the Union address to the 37th Congress."},
         { "day":"1", "month":"12", "year":"1863", "text": "Belle Boyd, a Confederate spy, is released from prison in Washington."},
         { "day":"1", "month":"12", "year":"1881", "text": "Virgil, Wyatt and Morgan Earp are exonerated in court for their action in the Gunfight at the O.K. Corral in Tombstone, Ariz."},
         { "day":"1", "month":"12", "year":"1900", "text": "Kaiser Wilhelm II refuses to meet with Boer leader Paul Kruger in Berlin."},
         { "day":"1", "month":"12", "year":"1905", "text": "Twenty officers and 230 guards are arrested in St. Petersburg, Russia, for the revolt at the Winter Palace."},
         { "day":"1", "month":"12", "year":"1908", "text": "The Italian Parliament debates the future of the Triple Alliance and asks for compensation for Austria’s action in Bosnia-Herzegovina."},
         { "day":"1", "month":"12", "year":"1909", "text": "President William Howard Taft severs official relations with Nicaragua’s Zelaya government and declares support for the revolutionaries."},
         { "day":"1", "month":"12", "year":"1916", "text": "King Constantine of Greece refuses to surrender to the Allies."},
         { "day":"1", "month":"12", "year":"1918", "text": "An American army of occupation enters Germany."},
         { "day":"1", "month":"12", "year":"1925", "text": "After a seven-year occupation, 7,000 British troops evacuate Cologne, Germany."},
         { "day":"1", "month":"12", "year":"1933", "text": "Nazi storm troops become an official organ of the Reich."},
         { "day":"1", "month":"12", "year":"1934", "text": "Josef Stalin’s aide, Sergei Kirov, is assassinated in Leningrad."},
         { "day":"1", "month":"12", "year":"1941", "text": "Japan’s Tojo rejects U.S. proposals for a Pacific settlement as fantastic and unrealistic."},
         { "day":"1", "month":"12", "year":"1941", "text": "Great Britain declares a state of emergency in Malaya following reports of Japanese attacks."},
         { "day":"1", "month":"12", "year":"1941", "text": "The first Civil Air Patrol is organized in the United States."},
         { "day":"1", "month":"12", "year":"1942", "text": "National gasoline rationing goes into effect in the United States."},
         { "day":"1", "month":"12", "year":"1955", "text": "Rosa Parks refuses to sit in the back of a Montgomery, Alabama, bus, defying the South’s segregationist laws."},
         { "day":"1", "month":"12", "year":"1969", "text": "America’s first draft lottery since 1942 is held."},
         { "day":"1", "month":"12", "year":"1971", "text": "Indian Army recaptures part of Kashmir, which had been occupied by Pakistan."},
         { "day":"1", "month":"12", "year":"1981", "text": "AIDS virus officially recognized."},
         { "day":"1", "month":"12", "year":"1986", "text": "Lieutenant Colonel Oliver North pleads the 5th Amendment before a Senate panel investigating the Iran-Contra arms sale."},
         { "day":"1", "month":"12", "year":"1988", "text": "Benazir Bhutto, politician, becomes the first woman to serve as Prime Minister of Pakistan and the first woman elected to lead a Muslim state"},
         { "day":"1", "month":"12", "year":"1989", "text": "East Germany’s parliament changes its constitution, abolishing a section that gave the Communist Party the leading role in the state."},
         { "day":"1", "month":"12", "year":"1990", "text": "Channel Tunnel sections from France and the UK meet beneath the English Channel."},
         { "day":"1", "month":"12", "year":"1991", "text": "Ukraine’s voters overwhelmingly approve a referendum for independence from the USSR."},
         { "day":"1", "month":"12", "year":"2001", "text": "Trans World Airlines’ final flight following the carrier’s purchase by American Airlines; TWA began operating 76 years earlier. The final flight, 220, piloted by Capt. Bill Compton, landed at St. Louis International Airport."}
      ]
   }
]
