[
   {
      "facts":[
         { "day":"11", "month":"12", "year":"1688", "text": "James II abdicates the throne because of William of Orange landing in England." },
         { "day":"11", "month":"12", "year":"1816", "text": "Indiana is admitted to the Union as the 19th state." },
         { "day":"11", "month":"12", "year":"1861", "text": "A raging fire sweeps the business district of Charleston, South Carolina, adding to an already depressed economic state." },
         { "day":"11", "month":"12", "year":"1862", "text": "Union General Ambrose Burnside occupies Fredericksburg and prepares to attack the Confederates under Robert E. Lee." },
         { "day":"11", "month":"12", "year":"1863", "text": "Union gunboats Restless, Bloomer and Caroline enter St. Andrew’s Bay, Fla., and begin bombardment of both Confederate quarters and saltworks." },
         { "day":"11", "month":"12", "year":"1882", "text": "A production of Gilbert and Sullivan’s Iolanthe at Boston’s Bijou Theatre becomes the first performance in a theatre lit by incandescent electric lights." },
         { "day":"11", "month":"12", "year":"1927", "text": "Nearly 400 world leaders sign a letter to President Calvin Coolidge asking the United States to join the World Court." },
         { "day":"11", "month":"12", "year":"1930", "text": "As the economic crisis grows, the Bank of the United States closes its doors." },
         { "day":"11", "month":"12", "year":"1933", "text": "Reports say Paraguay has captured 11,000 Bolivians in the war over Chaco." },
         { "day":"11", "month":"12", "year":"1936", "text": "Britain’s King Edward VIII abdicates the throne to marry American Wallis Warfield Simpson." },
         { "day":"11", "month":"12", "year":"1941", "text": "The United States declares war on Italy and Germany." },
         { "day":"11", "month":"12", "year":"1943", "text": "U.S. Secretary of State Cordell Hull demands that Hungary, Romania and Bulgaria withdraw from the war." },
         { "day":"11", "month":"12", "year":"1945", "text": "A Boeing B-29 Superfortress shatters all records by crossing the United States in five hours and 27 minutes." },
         { "day":"11", "month":"12", "year":"1951", "text": "Joe DiMaggio announces his retirement from baseball." },
         { "day":"11", "month":"12", "year":"1955", "text": "Israel raids Syrian positions on the Sea of Galilee." },
         { "day":"11", "month":"12", "year":"1964", "text": "Frank Sinatra, Jr., is returned home to his parents after being kidnapped for the ransom amount of $240,000." },
         { "day":"11", "month":"12", "year":"1967", "text": "The Concorde, a joint British-French venture and the world’s first supersonic airliner, is unveiled in Toulouse, France." },
         { "day":"11", "month":"12", "year":"1972", "text": "Challenger, the lunar lander for Apollo 17, touches down on the moon’s surface, the last time that men visit the moon." },
         { "day":"11", "month":"12", "year":"1978", "text": "Massive demonstrations take place in Tehran against the shah." },
         { "day":"11", "month":"12", "year":"1981", "text": "Military forces in El Salvador kill over 800 civilians in what is known as the El Mozote massacre during the Salvadoran Civil War." },
         { "day":"11", "month":"12", "year":"1997", "text": "The Kyoto Protocol international treaty intended to reduce emissions of greenhouse gasses, opens for signature." },
         { "day":"11", "month":"12", "year":"2001", "text": "People’s Republic of China joins the World Trade Organization." },
         { "day":"11", "month":"12", "year":"2005", "text": "Cronulla riots begin in Cronulla, a suburb of Sydney, New South Wales, Australia." },
         { "day":"11", "month":"12", "year":"2006", "text": "President of Mexico Felipe Calderon launches a military-led offensive against drug cartel violence in the state of Michoacan." },
         { "day":"11", "month":"12", "year":"2008", "text": "Bernard \"Bernie\" Madoff arrested and charged with securities fraud in what was called a $50-billion Ponzi scheme." }
      ]
   }
]
