[
   {
      "facts":[
        { "day":"12", "month":"12", "year":"1753", "text": "George Washington, the adjutant of Virginia, delivers an ultimatum to the French forces at Fort Le Boeuf, south of Lake Erie, reiterating Britain’s claim to the entire Ohio River valley." },
        { "day":"12", "month":"12", "year":"1770", "text": "The British soldiers responsible for the \"Boston Massacre\" are acquitted on murder charges." },
        { "day":"12", "month":"12", "year":"1862", "text": "The Union loses its first ship to a torpedo, USS Cairo, in the Yazoo River." },
        { "day":"12", "month":"12", "year":"1863", "text": "Orders are given in Richmond, Virginia, that no more supplies from the Union should be received by Federal prisoners." },
        { "day":"12", "month":"12", "year":"1901", "text": "Italian inventor Guglielmo Marconi receives the first transatlantic radio transmission in St. John’s Newfoundland." },
        { "day":"12", "month":"12", "year":"1927", "text": "Communists forces seize Canton, China." },
        { "day":"12", "month":"12", "year":"1930", "text": "The Spanish Civil War begins as rebels take a border town." },
        { "day":"12", "month":"12", "year":"1930", "text": "The last Allied troops withdraw from the Saar region in Germany." },
        { "day":"12", "month":"12", "year":"1931", "text": "Under pressure from the Communists in Canton, Chiang Kai-shek resigns as president of the Nanking Government but remains the head of the Nationalist government that holds nominal rule over most of China." },
        { "day":"12", "month":"12", "year":"1943", "text": "The German Army launches Operation Winter Tempest, the relief of the Sixth Army trapped in Stalingrad." },
        { "day":"12", "month":"12", "year":"1943", "text": "The exiled Czech government signs a treaty with the Soviet Union for postwar cooperation." },
        { "day":"12", "month":"12", "year":"1956", "text": "The United Nations calls for immediate Soviet withdrawal from Hungary." },
        { "day":"12", "month":"12", "year":"1964", "text": "Kenya becomes a republic." },
        { "day":"12", "month":"12", "year":"1964", "text": "Three Buddhist leaders begin a hunger strike to protest the government in Saigon." },
        { "day":"12", "month":"12", "year":"1967", "text": "The United States ends the airlift of 6,500 men in Vietnam." },
        { "day":"12", "month":"12", "year":"1979", "text": "South Korean Army Major General Chun Doo-hwan, acting without authorization from President Choi Kyu-ha, orders the arrest of Army Chief of Staff General Jeong Seung-hwa, alleging that the chief of staff was involved in the assassination of ex-President Park Chung Hee." },
        { "day":"12", "month":"12", "year":"1985", "text": "Arrow Air Flight 1285 crashes after takeoff at Gander, Newfoundland; among the 256 dead are 236 members of the US Army’s 101st Airborne Division." },
        { "day":"12", "month":"12", "year":"1991", "text": "The Russian Federation becomes independent from the USSR." },
        { "day":"12", "month":"12", "year":"1995", "text": "Willie Brown beats incumbent mayor Frank Jordon to become the first African-American mayor of San Francisco." },
        { "day":"12", "month":"12", "year":"2000", "text": "The US Supreme Court announces its decision in Bush v. Gore, effectively ending legal changes to the results of that year’s Presidential election." }
      ]
   }
]
