[
   {
      "facts":[
         { "day":"13", "month":"12", "year":"1789", "text": "The National Guard is created in France." },
         { "day":"13", "month":"12", "year":"1812", "text": "The last remnants of Napoleon Bonaparte’s Grand Armeé reach the safety of Kovno, Poland, after the failed Russian campaign. Napoleon’s costly retreat from Moscow" },
         { "day":"13", "month":"12", "year":"1814", "text": "General Andrew Jackson announces martial law in New Orleans, Louisiana, as British troops disembark at Lake Borne, 40 miles east of the city. The Battle of New Orleans" },
         { "day":"13", "month":"12", "year":"1862", "text": "The Battle of Fredericksburg ends with the bloody slaughter of onrushing Union troops at Marye’s Heights. Maine’s Colonel Chamberlain at Marye’s Heights." },
         { "day":"13", "month":"12", "year":"1902", "text": "The Committee of Imperial Defense holds its first meeting in London." },
         { "day":"13", "month":"12", "year":"1908", "text": "The Dutch take two Venezuelan Coast Guard ships." },
         { "day":"13", "month":"12", "year":"1937", "text": "The Japanese army occupies Nanking, China. Boeing’s Trailblazing P-26 Peashooters." },
         { "day":"13", "month":"12", "year":"1940", "text": "Adolf Hitler issues preparations for Operation Martita, the German invasion of Greece." },
         { "day":"13", "month":"12", "year":"1941", "text": "British forces launch an offensive in Libya." },
         { "day":"13", "month":"12", "year":"1945", "text": "France and Britain agree to quit Syria and Lebanon." },
         { "day":"13", "month":"12", "year":"1951", "text": "After meeting with FBI Director J. Edgar Hoover, President Harry S Truman vows to purge all disloyal government workers." },
         { "day":"13", "month":"12", "year":"1968", "text": "President Lyndon B. Johnson and Mexico’s President Gustavo Diaz Ordaz meet on a bridge at El Paso, Texas, to officiate at ceremonies returning the long-disputed El Chamizal area to the Mexican side of the border." },
         { "day":"13", "month":"12", "year":"1972", "text": "Astronaut Gene Cernan climbs into his lunar lander on the moon and prepares to lift off. He is the last man to set foot on the moon." },
         { "day":"13", "month":"12", "year":"1973", "text": "Great Britain cuts the work week to three days to save energy." },
         { "day":"13", "month":"12", "year":"1981", "text": "Polish labor leader Lech Walesa is arrested and the government decrees martial law, restricting civil rights and suspending operation of the independent trade union Solidarity." },
         { "day":"13", "month":"12", "year":"1985", "text": "France sues the United States over the discovery of an AIDS serum." },
         { "day":"13", "month":"12", "year":"2001", "text": "Terrorists attach the Parliament of India Sansad; 15 people are killed, including the terrorists" },
         { "day":"13", "month":"12", "year":"2003", "text": "Deposed Iraqi President Saddam Hussein captured; he is found hiding in near his home town of Tikrit." }
      ]
   }
]
