[
   {
      "facts":[
         { "day":"14", "month":"12", "year":"1799", "text": "George Washington dies on his Mount Vernon estate." },
         { "day":"14", "month":"12", "year":"1819", "text": "Alabama is admitted as the 22nd state, making 11 slave states and 11 free states." },
         { "day":"14", "month":"12", "year":"1861", "text": "Prince Albert of England, one of the Union’s strongest advocates, dies." },
         { "day":"14", "month":"12", "year":"1863", "text": "Confederate General James Longstreet attacks Union troops at Bean’s Station, Tenn." },
         { "day":"14", "month":"12", "year":"1900", "text": "Max Planck presents the quantum theory at the Physics Society in Berlin." },
         { "day":"14", "month":"12", "year":"1906", "text": "The first U1 submarine is brought into service in Germany. Italy’s MAS torpedo boats." },
         { "day":"14", "month":"12", "year":"1908", "text": "The first truly representative Turkish Parliament opens." },
         { "day":"14", "month":"12", "year":"1909", "text": "The Labor Conference in Pittsburgh ends with a \"declaration of war\" on U.S. Steel." },
         { "day":"14", "month":"12", "year":"1911", "text": "Roald Amundsen and four others discover the South Pole." },
         { "day":"14", "month":"12", "year":"1920", "text": "The League of Nations creates a credit system to aid Europe." },
         { "day":"14", "month":"12", "year":"1939", "text": "The League of Nations drops the Soviet Union from its membership. Joseph Avenol sold out the League of Nations." },
         { "day":"14", "month":"12", "year":"1941", "text": "German Field Marshal Wilhelm Keitel orders the construction of defensive positions along the European coastline. Desperate Hours on Omaha Beach" },
         { "day":"14", "month":"12", "year":"1946", "text": "The United Nations adopt a disarmament resolution prohibiting the A-Bomb." },
         { "day":"14", "month":"12", "year":"1949", "text": "Bulgarian ex-Premier Traicho Kostov is sentenced to die for treason in Sofia." },
         { "day":"14", "month":"12", "year":"1960", "text": "A U.S. Boeing B-52 bomber sets a 10,000-mile non-stop record without refueling." },
         { "day":"14", "month":"12", "year":"1980", "text": "NATO warns the Soviets to stay out of the internal affairs of Poland, saying that intervention would effectively destroy the détente between the East and West." },
         { "day":"14", "month":"12", "year":"1981", "text": "Israel’s Knesset passes the Golan Heights Law, extending Israeli law to the Golan Heights area." },
         { "day":"14", "month":"12", "year":"1994", "text": "Construction begins on China’s Three Gorges Dam on the Yangtze River." },
         { "day":"14", "month":"12", "year":"1995", "text": "The Dayton Agreement signed in Paris; establishes a general framework for ending the Bosnian War between Bosnia and Herzegovina." },
         { "day":"14", "month":"12", "year":"1999", "text": "Tens of thousands die as a result of flash floods caused by torrential rains in Vargas, Venezuela." },
         { "day":"14", "month":"12", "year":"2003", "text": "Pervez Musharraf, President of Pakistan, narrowly escapes and assassination attempt." },
         { "day":"14", "month":"12", "year":"2004", "text": "The Millau Viaduct, the world’s tallest bridge, official opens near Millau, France." },
         { "day":"14", "month":"12", "year":"2008", "text": "Iraqi broadcast journalist Muntadhar al-Zaidi throws his shoes at US President George W. Bush during a press conference in Baghdad." },
         { "day":"14", "month":"12", "year":"2012", "text": "At Sandy Hook Elementary School, Newtown, Conn., 20 children and six adults are shot to death by a 20-year-old gunman who then commits suicide." }
      ]
   }
]
