[
   {
      "facts":[
         { "day":"15", "month":"12", "year":"1862", "text": "Nathan Bedford Forrest crosses the Tennessee River at Clifton with 2,500 men to raid the communications around Vicksburg, Mississippi." },
         { "day":"15", "month":"12", "year":"1862", "text": "In New Orleans, Louisiana, Union Major General Benjamin F. Butler turns his command over to Nathaniel Banks. The citizens of New Orleans hold farewell parties for Butler, "The Beast" – but only after he leaves." },
         { "day":"15", "month":"12", "year":"1864", "text": "The battle at Nashville begins." },
         { "day":"15", "month":"12", "year":"1890", "text": "As U.S. Army soldiers attempt to arrest Sitting Bull at his cabin in Standing Rock, South Dakota, shooting breaks out and Lt. Bullhead shoots the great Sioux leader." },
         { "day":"15", "month":"12", "year":"1903", "text": "The British parliament places a 15-year ban on whale hunting in Norway." },
         { "day":"15", "month":"12", "year":"1920", "text": "China wins a place on the League Council; Austria is admitted." },
         { "day":"15", "month":"12", "year":"1924", "text": "The Soviet Union warns the United States against repeated entry of ships into Soviet territorial waters." },
         { "day":"15", "month":"12", "year":"1938", "text": "Washington sends its fourth note to Berlin demanding amnesty for Jews." },
         { "day":"15", "month":"12", "year":"1944", "text": "The battle for Luzon begins." },
         { "day":"15", "month":"12", "year":"1946", "text": "Vietnam leader Ho Chi Minh sends a note to the new French Premier, Leon Blum, asking for peace talks." },
         { "day":"15", "month":"12", "year":"1961", "text": "Adolf Eichmann, the former German Gestapo official accused of a major role in the Nazi murder of 6 million Jews, is sentenced by a Jerusalem court to be hanged." },
         { "day":"15", "month":"12", "year":"1965", "text": "The United States drops 12 tons of bombs on an industrial center near Haiphong Harbor, North Vietnam." },
         { "day":"15", "month":"12", "year":"1967", "text": "President Lyndon B. Johnson signs the meat bill in the presence of Upton Sinclair, the author of the controversial book The Jungle." },
         { "day":"15", "month":"12", "year":"1972", "text": "The Commonwealth of Australia orders equal pay for women." },
         { "day":"15", "month":"12", "year":"1973", "text": "The American Psychiatric Association votes 130 to remove homosexuality from its official list of psychiatric disorders." },
         { "day":"15", "month":"12", "year":"1976", "text": "The oil tanker MV Argo Merchant causes one of the worst marine oil spills in history when it runs aground near Nantucket, Massachusetts." },
         { "day":"15", "month":"12", "year":"1978", "text": "US President Jimmy Carter announces the United States will recognize the People’s Republic of China and will sever all relations with Taiwan." },
         { "day":"15", "month":"12", "year":"1981", "text": "In what is often called the first modern suicide bombing, a suicide car bomb kills 61 people at the Iraqi embassy in Beirut, Lebanon; Iraq’s ambassador to Lebanon is among the casualties." },
         { "day":"15", "month":"12", "year":"1993", "text": "The Downing Street Declaration, issued jointly by UK and the Republic of Ireland, affirms the UK would transfer Northern Ireland to the Republic of Ireland only if a majority of Northern Ireland’s people approved." },
         { "day":"15", "month":"12", "year":"2001", "text": "The Leaning Tower of Pisa reopens after an 11-year, $27 million project to fortify it without eliminating its famed lean." },
         { "day":"15", "month":"12", "year":"2005", "text": "F-22 Raptor Stealth fighter enters active service with the US Air Force." }
      ]
   }
]
