[
   {
      "facts":[
         { "day":"17", "month":"12", "year": "1399", "text": "Tamerlane’s Mongols destroy the army of Mahmud Tughluk, Sultan of Delhi, at Panipat." },
         { "day":"17", "month":"12", "year": "1861", "text": "The Stonewall Brigade begins to dismantle Dam No. 5 of the C&O Canal." },
         { "day":"17", "month":"12", "year": "1886", "text": "At a Christmas party, Sam Belle shoots his old enemy Frank West, but is fatally wounded himself." },
         { "day":"17", "month":"12", "year": "1903", "text": "Near Kitty Hawk, North Carolina, Orville and Wilbur Wright make the first successful flight in history of a self-propelled, heavier-than-air aircraft." },
         { "day":"17", "month":"12", "year": "1927", "text": "U.S. Secretary of State Frank B. Kellogg suggests a worldwide pact renouncing war." },
         { "day":"17", "month":"12", "year": "1938", "text": "Italy declares the 1935 pact with France invalid because ratifications had not been exchanged. France denies the argument." },
         { "day":"17", "month":"12", "year": "1939", "text": "In the Battle of River Plate near Montevideo, Uruguay, the British trap the German pocket battleship Graf Spee. German Captain Langsdorf sinks his ship believing that resistance is hopeless." },
         { "day":"17", "month":"12", "year": "1943", "text": "U.S. forces invade Japanese-held New Britain Island in New Guinea." },
         { "day":"17", "month":"12", "year": "1944", "text": "The German Army renews the attack on the Belgian town of Losheimergraben against the defending Americans during the Battle of the Bulge." },
         { "day":"17", "month":"12", "year": "1944", "text": "U.S. approves end to internment of Japanese Americans. U.S. Major General Henry C. Pratt issues Public Proclamation No. 21, declaring that Japanese American \"evacuees\" from the West Coast could return to their homes effective January 2, 1945." },
         { "day":"17", "month":"12", "year": "1948", "text": "The Smithsonian Institution accepts the Kitty Hawk – the Wright brothers’ plane." },
         { "day":"17", "month":"12", "year": "1950", "text": "The French government appoints Marshal de Lattre de Tassigny to command their troops in Vietnam." },
         { "day":"17", "month":"12", "year": "1952", "text": "Yugoslavia breaks relations with the Vatican." },
         { "day":"17", "month":"12", "year": "1965", "text": "Ending an election campaign marked by bitterness and violence, Ferdinand Marcos is declared president of the Philippines." },
         { "day":"17", "month":"12", "year": "1981", "text": "Red Brigade terrorists kidnap Brigadier General James Dozier, the highest-ranking U.S. NATO officer in Italy." },
         { "day":"17", "month":"12", "year": "1989", "text": "The Simpsons, television’s longest-running animated series, makes its US debut." },
         { "day":"17", "month":"12", "year": "1989", "text": "Fernando Color de Mello becomes Brazil’s first democratically elected president in nearly 30 years." },
         { "day":"17", "month":"12", "year": "1990", "text": "Jean-Bertrand Aristide wins Haiti’s first free election." },
         { "day":"17", "month":"12", "year": "2002", "text": "Congolese parties of the inter Congolese Dialogue sign a peace accord in the Second Congo War, proviidn for transitional government and elections within two years." },
         { "day":"17", "month":"12", "year": "2010", "text": "Mohamed Bouazizi immolates himself, the catalyst for the Tunisian revolution and the subsequent Arab Spring." }
      ]
   }
]
