[
   {
      "facts":[
         { "day":"19", "month":"12", "year": "1154", "text": "Henry II is crowned king of England." },
         { "day":"19", "month":"12", "year": "1562", "text": "The French Wars of Religion between the Huguenots and the Catholics begins with the Battle of Dreux." },
         { "day":"19", "month":"12", "year": "1793", "text": "French troops recapture Toulon from the British." },
         { "day":"19", "month":"12", "year": "1862", "text": "Confederate General Nathan B. Forrest begins tearing up the railroads in Union generals Grant and Rosecrans rear, causing considerable delays in the movement of Union supplies." },
         { "day":"19", "month":"12", "year": "1900", "text": "The French Parliament votes amnesty for everyone involved in the Dreyfus Affair." },
         { "day":"19", "month":"12", "year": "1909", "text": "American socialist women denounce suffrage as a movement of the middle class." },
         { "day":"19", "month":"12", "year": "1941", "text": "Japanese land on Hong Kong and clash with British troops." },
         { "day":"19", "month":"12", "year": "1941", "text": "Adolf Hitler assumes the position of commander in chief of the German army." },
         { "day":"19", "month":"12", "year": "1942", "text": "The British advance 40 miles into Burma in a drive to oust the Japanese from the colony." },
         { "day":"19", "month":"12", "year": "1944", "text": "During the Battle of the Bulge, American troops begin pulling back from the twin Belgian cities of Krinkelt and Rocherath in front of the advancing German Army." },
         { "day":"19", "month":"12", "year": "1945", "text": "Congress confirms Eleanor Roosevelt as U.S. delegate to the United Nations." },
         { "day":"19", "month":"12", "year": "1950", "text": "The North Atlantic Council names General Dwight D. Eisenhower as supreme commander of Western European defense forces." },
         { "day":"19", "month":"12", "year": "1959", "text": "Reputed to be the last civil war veteran, Walter Williams, dies at 117 in Houston." },
         { "day":"19", "month":"12", "year": "1974", "text": "Nelson Rockefeller is sworn in as vice president of the United states after a House of Representatives vote." },
         { "day":"19", "month":"12", "year": "1982", "text": "Four bombs explode at South Africa’s only nuclear power station in Johannesburg." },
         { "day":"19", "month":"12", "year": "1984", "text": "British Prime Minister Margaret Thatcher and Chinese Premier Zhao Ziyang sign an agreement that committed Britain to return Hong Kong to China in 1997 in return for terms guaranteeing a 50-year extension of its capitalist system. Hong Kong was leased by China to Great Britain in 1898 for 99 years." },
         { "day":"19", "month":"12", "year": "1998", "text": "President Bill Clinton is impeached. The House of Representatives approved two articles of impeachment against President Clinton, charging him with lying under oath to a federal grand jury and obstructing justice. Clinton was the second president in American history to be impeached." },
         { "day":"19", "month":"12", "year": "2001", "text": "The highest barometric pressure ever recorded (1085.6 hPa, 32.06 inHg) occurs at Tosontsengel, Khovsgol, Mongolia." },
         { "day":"19", "month":"12", "year": "2001", "text": "Rioting begins in Buenos Aires, Argentina, during the country’s economic crisis." },
         { "day":"19", "month":"12", "year": "2012", "text": "Park Geun-hye elected President of South Korea, the nation’s first female chief executive." }
      ]
   }
]
