[
   {
      "facts":[
         { "day":"20", "month":"12", "year": "69", "text": "Vespians’s supporters enter Rome and discover Vitellius in hiding. He is dragged through the streets before being brutally murdered." },
         { "day":"20", "month":"12", "year": "1355", "text": "Stephen Urosh IV of Serbia dies while marching to attack Constantinople." },
         { "day":"20", "month":"12", "year": "1802", "text": "The United States buys the Louisiana territory from France." },
         { "day":"20", "month":"12", "year": "1860", "text": "South Carolina secedes from the Union." },
         { "day":"20", "month":"12", "year": "1861", "text": "English transports loaded with 8,000 troops set sail for Canada so that troops are available if the \"Trent Affair\" is not settled without war." },
         { "day":"20", "month":"12", "year": "1924", "text": "Adolf Hitler is released from prison after serving less than one year of a five year sentence for treason." },
         { "day":"20", "month":"12", "year": "1930", "text": "Thousands of Spaniards sign a revolutionary manifesto." },
         { "day":"20", "month":"12", "year": "1933", "text": "The German government announces 400,000 citizens are to be sterilized because of hereditary defects." },
         { "day":"20", "month":"12", "year": "1938", "text": "First electronic television system is patented." },
         { "day":"20", "month":"12", "year": "1941", "text": "The Flying Tigers, American pilots in China, enter combat against the Japanese over Kunming." },
         { "day":"20", "month":"12", "year": "1943", "text": "Soviet forces halt a German army trying to relieve the besieged city of Stalingrad." },
         { "day":"20", "month":"12", "year": "1946", "text": "Viet Minh and French forces fight fiercely in Annamite section of Hanoi." },
         { "day":"20", "month":"12", "year": "1948", "text": "U.S. Supreme Court announces that it has no jurisdiction to hear the appeals of Japanese war criminals sentenced by the International Military Tribunal." },
         { "day":"20", "month":"12", "year": "1960", "text": "National Liberation Front is formed by guerrillas fighting the Diem regime in South Vietnam." },
         { "day":"20", "month":"12", "year": "1962", "text": "In its first free election in 38 years, the Dominican Republic chooses leftist Juan Bosch Gavino as president." },
         { "day":"20", "month":"12", "year": "1963", "text": "Four thousand cross the Berlin Wall to visit relatives under a 17-day Christmas accord." },
         { "day":"20", "month":"12", "year": "1989", "text": "U.S. troops invade Panama to oust General Manuel Noriega and replace him with Guillermo Endara." },
         { "day":"20", "month":"12", "year": "1995", "text": "NATO begins peacekeeping operation in Bosnia." },
         { "day":"20", "month":"12", "year": "1996", "text": "NeXT merges with Apple Computer, leading to the development of groundbreaking Mac OS X." },
         { "day":"20", "month":"12", "year": "2007", "text": "Queen Elizabeth II becomes the oldest monarch in the history of the UK; previously, that honor belonged to Queen Victoria." }
      ]
   }
]
