[
   {
      "facts":[
         { "day":"21", "month":"12", "year": "68", "text": "Vespian, a gruff-spoken general of humble origins, enters Rome and is named emperor by the Senate." },
         { "day":"21", "month":"12", "year": "1620", "text": "The Pilgrims land at or near Plymouth Rock." },
         { "day":"21", "month":"12", "year": "1708", "text": "French forces seize control of the eastern shore of Newfoundland after winning a victory at St. John’s." },
         { "day":"21", "month":"12", "year": "1790", "text": "Samuel Slater opens the first cotton mill in the United States (in Rhode Island)." },
         { "day":"21", "month":"12", "year": "1862", "text": "The U.S. Congress authorizes the Medal of Honor to be awarded to Navy personnel who have distinguished themselves by their gallantry in action." },
         { "day":"21", "month":"12", "year": "1866", "text": "Indians, led by Red Cloud and Crazy Horse, kill Captain William J. Fetterman and 79 other men who had ventured out from Fort Phil Kearny to cut wood." },
         { "day":"21", "month":"12", "year": "1910", "text": "Over 2.5 million plague victims are reported in the An-Hul province of China." },
         { "day":"21", "month":"12", "year": "1928", "text": "President Calvin Coolidge signs the Boulder Dam bill." },
         { "day":"21", "month":"12", "year": "1944", "text": "German troops surround the 101st Airborne Division at Bastogne in Belgium." },
         { "day":"21", "month":"12", "year": "1945", "text": "General George S. Patton dies at the age of 60 after being injured in a car accident." },
         { "day":"21", "month":"12", "year": "1946", "text": "An earthquake and tidal wave kill hundreds in Japan." },
         { "day":"21", "month":"12", "year": "1963", "text": "The Turk minority riots in Cyprus to protest anti-Turkish revisions in the constitution." },
         { "day":"21", "month":"12", "year": "1964", "text": "Great Britain’s House of Commons votes to ban the death penalty." },
         { "day":"21", "month":"12", "year": "1965", "text": "Four pacifists are indicted in New York for burning draft cards." },
         { "day":"21", "month":"12", "year": "1969", "text": "American draft evaders gather for a holiday dinner in Montreal, Canada." },
         { "day":"21", "month":"12", "year": "1986", "text": "500,000 Chinese students gather in Shanghai’s People’s Square calling for democratic reforms, including freedom of the press." },
         { "day":"21", "month":"12", "year": "1988", "text": "Pan Am Flight 103 from London to New York explodes in midair over Lockerbie, Scotland, an hour after departure. All 259 passengers were killed in the explosion caused by a bomb– hidden inside an audio cassette player — that detonated inside the cargo area when the plane was at an altitude of 31,000 feet. A shower of airplane parts falling from the sky also killed 11 Lockerbie residents." },
         { "day":"21", "month":"12", "year": "1994", "text": "Popocatepetl, a volcano in Mexico spews forth gases and ash after nearly a half-century of dormancy." },
         { "day":"21", "month":"12", "year": "1995", "text": "The city of Bethlehem passes from Israeli to Palestinian control." },
         { "day":"21", "month":"12", "year": "2004", "text": "A suicide bomber attacks the forward operating base next to the US military airfield at Mosul, Iraq, killing 22 people; it is the deadliest suicide attack on US soldiers during the Iraq War." }
      ]
   }
]
