[
   {
      "facts":[
         { "day":"23", "month":"12", "year": "1861", "text": "Lord Lyons, The British minister to America presents a formal complaint to secretary of state, William Seward, regarding the Trent affair." },
         { "day":"23", "month":"12", "year": "1900", "text": "The Federal Party, which recognizes American sovereignty, is formed in the Philippines." },
         { "day":"23", "month":"12", "year": "1919", "text": "Great Britain institutes a new constitution for India." },
         { "day":"23", "month":"12", "year": "1921", "text": "President Warren G. Harding frees Socialist Eugene Debs and 23 other political prisoners." },
         { "day":"23", "month":"12", "year": "1933", "text": "Pope Pius XI condemns the Nazi sterilization program." },
         { "day":"23", "month":"12", "year": "1937", "text": "London warns Rome to stop anti-British propaganda in Palestine." },
         { "day":"23", "month":"12", "year": "1939", "text": "The first Canadian troops arrive in Britain." },
         { "day":"23", "month":"12", "year": "1940", "text": "Chiang Kai-shek dissolves all Communist associations in China." },
         { "day":"23", "month":"12", "year": "1941", "text": "Despite throwing back an earlier Japanese amphibious assault, the U.S. Marines and Navy defenders on Wake Island capitulate to a second Japanese invasion." },
         { "day":"23", "month":"12", "year": "1944", "text": "General Dwight D. Eisenhower confirms the death sentence of Private Eddie Slovik, the only American shot for desertion since the Civil War." },
         { "day":"23", "month":"12", "year": "1947", "text": "President Harry S Truman grants a pardon to 1,523 who had evaded the World War II draft." },
         { "day":"23", "month":"12", "year": "1948", "text": "Japan’s Prime Minister, Hideki Tojo and six other collaborators are hanged for war crimes." },
         { "day":"23", "month":"12", "year": "1950", "text": "General Walton H. Walker, the commander of the Eighth Army in Korea, is killed in a jeep accident. Lieutenant General Matthew B. Ridgeway is named his successor." },
         { "day":"23", "month":"12", "year": "1967", "text": "U.S. Navy SEALs are ambushed during an operation southeast of Saigon." },
         { "day":"23", "month":"12", "year": "1974", "text": "The B-1 bomber makes its first successful test flight." },
         { "day":"23", "month":"12", "year": "1986", "text": "The Voyager completes the first nonstop flight around the globe on one load of fuel. The experimental aircraft, piloted Americans Dick Rutan and Jeana Yeager, landed at Edwards Air Force Base in California after nine days and four minutes in the sky." },
         { "day":"23", "month":"12", "year": "1990", "text": "In a referendum on Sovlenia’s independence from Yugoslovia, 88.5% vote in favor of independence." },
         { "day":"23", "month":"12", "year": "2002", "text": "An Iraqi MiG-25 shoots down a US MQ-1 Predator drone." }
      ]
   }
]
