[
   {
      "facts":[
         { "day":"24", "month":"12", "year": "1638", "text": "The Ottomans under Murad IV recapture Baghdad from Safavid Persia." },
         { "day":"24", "month":"12", "year": "1812", "text": "Joel Barlow, aged 58, American poet and lawyer, dies from exposure near Vilna, Poland, during Napoleon’s retreat from Moscow. Barlow was on a diplomatic mission to the emperor for President Madison." },
         { "day":"24", "month":"12", "year": "1814", "text": "A treaty of peace between the United States and Great Britain, ending the War of 1812, is signed at Ghent, Belgium. The news does not reach the United States until two weeks later (after the decisive American victory at New Orleans)." },
         { "day":"24", "month":"12", "year": "1861", "text": "The USS Gem of the Sea destroys the British blockade runner Prince of Wales off the coast at Georgetown, S.C." },
         { "day":"24", "month":"12", "year": "1862", "text": "A Christmas present arrives a day early for the Federal troops at Columbus, Kentucky, in the way of artillery on board the USS New Era." },
         { "day":"24", "month":"12", "year": "1914", "text": "Over 577,000 Allied soldiers are to spend Christmas as prisoners in Germany." },
         { "day":"24", "month":"12", "year": "1917", "text": "The Kaiser warns Russia that he will use \"iron fist\" and \"shining sword\" if peace is spurned." },
         { "day":"24", "month":"12", "year": "1943", "text": "General Dwight D. Eisenhower is appointed the Allied Supreme Commander, even though almost everyone believed the position would go to American Chief of Staff George C. Marshall." },
         { "day":"24", "month":"12", "year": "1947", "text": "An estimated 20,000 communists, led by guerrilla General Markos Vafthiades proclaim the Free Greek Government in northern Greece. They issue a call to arms to establish the regime throughout the nation." },
         { "day":"24", "month":"12", "year": "1956", "text": "African Americans defy a city law in Tallahassee, Florida, and occupy front bus seats." },
         { "day":"24", "month":"12", "year": "1963", "text": "New York’s Idlewild Airport is renamed JFK Airport in honor of the murdered President Kennedy." },
         { "day":"24", "month":"12", "year": "1964", "text": "The U.S. headquarters in Saigon is hit by a bomb killing two officers." },
         { "day":"24", "month":"12", "year": "1966", "text": "A Soviet research vehicle soft-lands on the moon." },
         { "day":"24", "month":"12", "year": "1967", "text": "The Greek Junta frees ex-Premier Papandreou." },
         { "day":"24", "month":"12", "year": "1968", "text": "The first pictures of an Earth-rise over the moon are seen as the crew of Apollo 8 orbits the moon." },
         { "day":"24", "month":"12", "year": "1970", "text": "Nine GIs are killed and nine are wounded by friendly fire in Vietnam." },
         { "day":"24", "month":"12", "year": "1972", "text": "Hanoi bars all peace talks with the United States until U.S. air raids over North Vietnam stop." },
         { "day":"24", "month":"12", "year": "1974", "text": "An oil tanker’s spill pollutes 1,600 square miles of Japan’s Inland Sea." },
         { "day":"24", "month":"12", "year": "1974", "text": "Cyclone Tracy devastates Darwin, Northern Territory, Australia, destroying more than 70 percent of the city’s buildings, including 80 percent of its houses." },
         { "day":"24", "month":"12", "year": "2005", "text": "Chad declares a state of war against Sudan in the wake of the Dec. 18 attack on the town of Adre, in which approximately 100 people were killed." }
      ]
   }
]
