[
   {
      "facts":[
         { "day":"26", "month":"12", "year": "1776", "text": "After crossing the Delaware River into New Jersey, George Washington leads an attack on Hessian mercenaries at Trenton, and takes 900 men prisoner." },
         { "day":"26", "month":"12", "year": "1786", "text": "Daniel Shay leads a rebellion in Massachusetts to protest the seizure of property for the non-payment of debt." },
         { "day":"26", "month":"12", "year": "1806", "text": "Napoleon’s army is checked by the Russians at the Battle of Pultusk." },
         { "day":"26", "month":"12", "year": "1862", "text": "38 Santee Sioux are hanged in Mankato, Minnesota for their part in the Sioux Uprising in Minnesota. Little Crow has fled the state." },
         { "day":"26", "month":"12", "year": "1866", "text": "Brig. Gen. Philip St. George Cooke, head of the Department of the Platte, receives word of the Fetterman Fight in Powder River County in the Dakota territory." },
         { "day":"26", "month":"12", "year": "1917", "text": "As a wartime measure, President Woodrow Wilson places railroads under government control, with Secretary of War William McAdoo as director general." },
         { "day":"26", "month":"12", "year": "1925", "text": "Six U.S. destroyers are ordered from Manila to China to protect interests in the civil war that is being waged there." },
         { "day":"26", "month":"12", "year": "1932", "text": "Over 70,000 people are killed in a massive earthquake in China." },
         { "day":"26", "month":"12", "year": "1941", "text": "General Douglas MacArthur declares Manila an open city in the face of the onrushing Japanese Army." },
         { "day":"26", "month":"12", "year": "1943", "text": "The German battleship Scharnhorst is sunk by British ships in an Arctic fight." },
         { "day":"26", "month":"12", "year": "1944", "text": "Advancing Soviet troops complete their encirclement of Budapest in Hungary." },
         { "day":"26", "month":"12", "year": "1945", "text": "The United States, Soviet Union and Great Britain, end a 10-day meeting, seeking an atomic rule by the UN Council." },
         { "day":"26", "month":"12", "year": "1953", "text": "The United States announces the withdrawal of two divisions from Korea." },
         { "day":"26", "month":"12", "year": "1962", "text": "Eight East Berliners escape to West Berlin, crashing through gates in an armor-plated bus." },
         { "day":"26", "month":"12", "year": "1966", "text": "Dr. Maulana Karenga celebrates the first Kwanza, a seven-day African-American celebration of family and heritage." },
         { "day":"26", "month":"12", "year": "1979", "text": "The Soviet Union flies 5,000 troops to intervene in the Afghanistan conflict." },
         { "day":"26", "month":"12", "year": "1982", "text": "Time magazine chooses a personal computer as it \"Man of the Year,\" the first non-human ever to receive th honor." },
         { "day":"26", "month":"12", "year": "1991", "text": "The Supreme Soviet of the Soviet Union formally dissolves the Soviet Union." },
         { "day":"26", "month":"12", "year": "1996", "text": "JonBenet Ramsey, a six-year-old beauty queen, is found beaten and strangled to death in the basement of her family’s home in Boulder, Colorado, one of the most high-profile crimes of the late 20th century in the US." },
         { "day":"26", "month":"12", "year": "1996", "text": "Workers in South Korea’s automotive and shipbuilding industries begin the largest labor strike in that country’s history, protesting a new law that made firing employees easier and would curtail the rights of labor groups to organize." },
         { "day":"26", "month":"12", "year": "1999", "text": "Lothar, a violent, 36-hour windstorm begins; it kills 137 and causes $1.3 billion (US dollars) damage in Central Europe." },
         { "day":"26", "month":"12", "year": "2004", "text": "A tsunami caused by a 9.3-magnitude earthquake kills more than 230,000 along the rim of the Indian Ocean." },
         { "day":"26", "month":"12", "year": "2006", "text": "Former U.S. President Gerald R. Ford dies at age 93. Ford was the only unelected president in America’s history." }
      ]
   }
]
