[
   {
      "facts":[
         { "day":"28", "month":"12", "year": "1688", "text": "William of Orange makes a triumphant march into London as James II flees." },
         { "day":"28", "month":"12", "year": "1694", "text": "George I of England gets divorced." },
         { "day":"28", "month":"12", "year": "1846", "text": "Iowa is admitted as the 29th State of the Union." },
         { "day":"28", "month":"12", "year": "1872", "text": "A U.S. Army force defeats a group of Apache warriors at Salt River Canyon, Arizona Territory, with 57 Indians killed but only one soldier." },
         { "day":"28", "month":"12", "year": "1904", "text": "Farmers in Georgia burn two million bales of cotton to prop up falling prices." },
         { "day":"28", "month":"12", "year": "1920", "text": "The United States resumes the deportation of communists and suspected communists." },
         { "day":"28", "month":"12", "year": "1933", "text": "President Franklin D. Roosevelt states, \"The definite policy of the United States, from now on, is one opposed to armed intervention.\"" },
         { "day":"28", "month":"12", "year": "1936", "text": "Benito Mussolini sends planes to Spain to support Francisco Franco’s forces." },
         { "day":"28", "month":"12", "year": "1938", "text": "France orders the doubling of forces in Somaliland; two warships are sent." },
         { "day":"28", "month":"12", "year": "1946", "text": "The French declare martial law in Vietnam as a full-scale war appears inevitable." },
         { "day":"28", "month":"12", "year": "1948", "text": "Premier Nokrashy Pasha of Egypt is assassinated by a member of the outlawed Muslim Brotherhood because of his failure to achieve victory in the war against Israel." },
         { "day":"28", "month":"12", "year": "1951", "text": "The United States pays $120,000 to free four fliers convicted of espionage in Hungary." },
         { "day":"28", "month":"12", "year": "1965", "text": "The United States bars oil sales to Rhodesia." },
         { "day":"28", "month":"12", "year": "1968", "text": "Israel attacks an airport in Beirut, destroying 13 planes." },
         { "day":"28", "month":"12", "year": "1971", "text": "The U.S. Justice Department sues Mississippi officials for ignoring the voting ballots of blacks in that state." }
      ]
   }
]
