[
   {
      "facts":[
         { "day":"29", "month":"12", "year": "1170", "text": "Thomas Becket, the archbishop of Canterbury, is murdered in Canterbury Cathedral by four knights of Henry II." },
         { "day":"29", "month":"12", "year": "1607", "text": "Indian chief Powhatan spares John Smith’s life after the pleas of his daughter Pocahontas." },
         { "day":"29", "month":"12", "year": "1778", "text": "British troops, attempting a new strategy to defeat the colonials in America, capture Savannah." },
         { "day":"29", "month":"12", "year": "1845", "text": "Texas (comprised of the present state of Texas and part of New Mexico, Colorado, and Wyoming) is admitted as the 28th state of the Union, with the provision that the area (389,166 square miles) should be divided into no more than five states "of convenient size."" },
         { "day":"29", "month":"12", "year": "1849", "text": "Gas lighting is installed in the White House." },
         { "day":"29", "month":"12", "year": "1862", "text": "Union General William T. Sherman’s troops try to gain the north side of Vicksburg in the Battle of Chickasaw Bluffs." },
         { "day":"29", "month":"12", "year": "1890", "text": "The last major conflict of the Indian wars takes place at Wounded Knee Creek in South Dakota after Colonel James W. Forsyth of the 7th Cavalry tries to disarm Chief Big Foot and his followers." },
         { "day":"29", "month":"12", "year": "1914", "text": "The production of Belgian newspapers is halted to protest German censorship." },
         { "day":"29", "month":"12", "year": "1921", "text": "Sears Roebuck president Julius Rosenwald pledges $20 million of his personal fortune to help Sears through hard times." },
         { "day":"29", "month":"12", "year": "1926", "text": "Germany and Italy sign an arbitration treaty." },
         { "day":"29", "month":"12", "year": "1934", "text": "Japan formally denounces Washington Naval Treaty of 1922." },
         { "day":"29", "month":"12", "year": "1940", "text": "In a radio interview, President Roosevelt proclaims the United States to be the \"arsenal of democracy.\"" },
         { "day":"29", "month":"12", "year": "1940", "text": "London suffers its most devastating air raid when Germans firebomb the city on the evening of December 29." },
         { "day":"29", "month":"12", "year": "1948", "text": "Tito declares Yugoslavia will follow its own path to Communism." },
         { "day":"29", "month":"12", "year": "1956", "text": "President Dwight Eisenhower asks Congress for the authority to oppose Soviet aggression in the Middle East." },
         { "day":"29", "month":"12", "year": "1965", "text": "A Christmas truce is observed in Vietnam, while President Johnson tries to get the North Vietnamese to the bargaining table." },
         { "day":"29", "month":"12", "year": "1981", "text": "President Ronald Reagan curtails Soviet trade in reprisal for its hash policies on Poland." }
      ]
   }
]
