[
   {
      "facts":[
         { "day":"30", "month":"12", "year": "1460", "text": "The Duke of York is defeated and killed by Lancastrians at the Battle of Wakefield." },
         { "day":"30", "month":"12", "year": "1803", "text": "The United States takes possession of the Louisiana area from France at New Orleans with a simple ceremony, the simultaneous lowering and raising of the national flags." },
         { "day":"30", "month":"12", "year": "1861", "text": "Banks in the United States suspend the practice of redeeming paper money for metal currency, a practice that would continue until 1879." },
         { "day":"30", "month":"12", "year": "1862", "text": "The draft of the Emancipation Proclamation is finished and circulated among President Abraham Lincoln’s cabinet for comment." },
         { "day":"30", "month":"12", "year": "1905", "text": "Governor Frank Steunenberg of Idaho is killed by an assassin’s bomb." },
         { "day":"30", "month":"12", "year": "1922", "text": "Soviet Russia is renamed the Union of Soviet Socialist Republics." },
         { "day":"30", "month":"12", "year": "1932", "text": "The Soviet Union bars food handouts for housewives under 36 years of age. They must now work to eat." },
         { "day":"30", "month":"12", "year": "1947", "text": "Romania’s King Michael is forced to abdicate by Soviet-backed Communists. Communists now control all of Eastern Europe." },
         { "day":"30", "month":"12", "year": "1965", "text": "Ferdinand E. Marcos is sworn in as the Philippine Republic’s sixth president." },
         { "day":"30", "month":"12", "year": "1972", "text": "After two weeks of heavy bombing raids on North Vietnam, President Nixon halts the air offensive and agrees to resume peace negotiations with Hanoi representative Le Duc Tho." },
         { "day":"30", "month":"12", "year": "1976", "text": "Governor Carey of New York pardons seven inmates, closing the book on the Attica uprising." },
         { "day":"30", "month":"12", "year": "2006", "text": "Saddam Hussein, former Iraq dictator, is executed by hanging for crimes committed against his own people during his rule." }
      ]
   }
]
