[
   {
      "facts":[
         { "day":"4", "month":"12", "year":"771", "text": "With the death of his brother Carloman, Charlemagne becomes sole ruler of the Frankish Empire." },
         { "day":"4", "month":"12", "year":"1861", "text": "The U.S. Senate, voting 36 to 0, expels Senator John C. Brekinridge of Kentucky because of his joining the Confederate Army." },
         { "day":"4", "month":"12", "year":"1861", "text": "Queen Victoria of Britain forbids the export of gunpowder, firearms and all materials for their production." },
         { "day":"4", "month":"12", "year":"1862", "text": "Winchester, Va., falls into Union hands, resulting in the capture of 145 Southern soldiers." },
         { "day":"4", "month":"12", "year":"1863", "text": "Seven solid days of bombardment ends at Charleston, S.C. The Union fires some 1,307 rounds." },
         { "day":"4", "month":"12", "year":"1872", "text": "The U.S. brigantine Marie Celeste is found adrift and deserted with its cargo intact, in the Atlantic Ocean between the Azores and Portugal." },
         { "day":"4", "month":"12", "year":"1900", "text": "The French National Assembly, successor to the States-General, rejects Nationalist General Mercier’s proposal to plan an invasion of England." },
         { "day":"4", "month":"12", "year":"1914", "text": "The first Seaplane Unit formed by the German Navy officially comes into existence and begins operations from Zeebrugge, Belgium." },
         { "day":"4", "month":"12", "year":"1918", "text": "France cancels trade treaties in order to compete in the postwar economic battles." },
         { "day":"4", "month":"12", "year":"1941", "text": "Operation Taifun (Typhoon), which was launched by the German armies on October 2, 1941, as a prelude to taking Moscow, is halted because of freezing temperatures and lack of serviceable aircraft." },
         { "day":"4", "month":"12", "year":"1942", "text": "U.S. planes make the first raids on Naples, Italy." },
         { "day":"4", "month":"12", "year":"1947", "text": "Tennessee William’s play A Streetcar Named Desire premieres on Broadway starring Marlon Brando and Jessica Tandy." },
         { "day":"4", "month":"12", "year":"1950", "text": "The University of Tennessee defies court rulings by rejecting five Negro applicants." },
         { "day":"4", "month":"12", "year":"1952", "text": "The Grumman XS2F-1 makes its first flight." },
         { "day":"4", "month":"12", "year":"1959", "text": "Peking pardons Pu Yi, ex-emperor of China and of the Japanese puppet-state of Manchukuo." },
         { "day":"4", "month":"12", "year":"1981", "text": "President Ronald Reagan broadens the power of the CIA by allowing spying in the United States." },
         { "day":"4", "month":"12", "year":"1985", "text": "Robert McFarland resigns as National Security Advisor. Admiral John Poindexter is named to succeed." },
         { "day":"4", "month":"12", "year":"1991", "text": "The last American hostages held in Lebanon are released." },
         { "day":"4", "month":"12", "year":"1992", "text": "US Pres. George H. W. Bush orders 28,000 troops to Somalia during the Somali Civil War." }
      ]
   }
]
