[
   {
      "facts":[
         { "day":"5", "month":"12", "year":"1484", "text": "Pope Innocent VIII issues a bill deploring the spread of witchcraft and heresy in Germany." },
         { "day":"5", "month":"12", "year":"1776", "text": "Phi Beta Kappa is organized as the first American college Greek letter-fraternity, at William and Mary College, Williamsburg, Va." },
         { "day":"5", "month":"12", "year":"1791", "text": "Composer Wolfgang Amadeus Mozart dies in Vienna." },
         { "day":"5", "month":"12", "year":"1861", "text": "In the U.S. Congress, petitions and bills calling for the abolition of slavery are introduced." },
         { "day":"5", "month":"12", "year":"1862", "text": "Union General Ulysses S. Grant’s cavalry receives a setback in an engagement on the Mississippi Central Railroad at Coffeeville, Mississippi." },
         { "day":"5", "month":"12", "year":"1864", "text": "Confederate General John Bell Hood sends Nathan Bedford Forrest’s cavalry and a division of infantry toward Murfreesboro, Tenn." },
         { "day":"5", "month":"12", "year":"1904", "text": "The Japanese destroy a Russian fleet at Port Arthur in Korea." },
         { "day":"5", "month":"12", "year":"1909", "text": "George Taylor makes the first manned glider flight in Australia in a glider that he designed himself." },
         { "day":"5", "month":"12", "year":"1912", "text": "Italy, Austria and Germany renew the Triple Alliance for six years." },
         { "day":"5", "month":"12", "year":"1916", "text": "David Lloyd George replaces Herbert Asquith as the British prime minister." },
         { "day":"5", "month":"12", "year":"1921", "text": "The British empire reaches an accord with the Irish revolutionary group the Sinn Fein; Ireland is to become a free state." },
         { "day":"5", "month":"12", "year":"1933", "text": "The 21st Amendment ends Prohibition in the United States, which had begun 13 years earlier." },
         { "day":"5", "month":"12", "year":"1934", "text": "Italian and Ethiopian troops clash at the Ualual on disputed the Somali-Ethiopian border." },
         { "day":"5", "month":"12", "year":"1936", "text": "The New Constitution in the Soviet Union promises universal suffrage, but the Communist Party remains the only legal political party." },
         { "day":"5", "month":"12", "year":"1937", "text": "The Lindberghs arrive in New York on a holiday visit after a two-year voluntary exile." },
         { "day":"5", "month":"12", "year":"1945", "text": "Four TBM Avenger bombers disappear approximately 100 miles off the coast of Florida." },
         { "day":"5", "month":"12", "year":"1950", "text": "Pyongyang in Korea falls to the invading Chinese army." },
         { "day":"5", "month":"12", "year":"1953", "text": "Italy and Yugoslavia agree to pull troops out of the disputed Trieste border." },
         { "day":"5", "month":"12", "year":"1955", "text": "A bus boycott begins under the leadership of the Rev. Martin Luther King, Jr., in Montgomery, Alabama." },
         { "day":"5", "month":"12", "year":"1966", "text": "Comedian and political activist Dick Gregory heads for Hanoi, North Vietnam, despite federal warnings against it." },
         { "day":"5", "month":"12", "year":"1978", "text": "The Soviet Union signs a 20-year friendship pact with Afghanistan." },
         { "day":"5", "month":"12", "year":"1983", "text": "Military Junta dissolves in Argentina." },
         { "day":"5", "month":"12", "year":"2006", "text": "Commodore Frank Bainimarama overthrows the government in Fiji." },
         { "day":"5", "month":"12", "year":"2007", "text": "A gunman armed with a semi-automatic rifle kills 8 people at Westroads Mall, Omaha, Neb., before taking his own life." }
      ]
   }
]
