[
   {
      "facts":[
         { "day":"6", "month":"12", "year":"1492", "text": "Christopher Columbus lands on the island of Santo Domingo in search of gold." },
         { "day":"6", "month":"12", "year":"1776", "text": "Phi Beta Kappa, the first scholastic fraternity, is founded at the College of William and Mary in Williamsburg." },
         { "day":"6", "month":"12", "year":"1812", "text": "The majority of Napoleon Bonaparte’s Grand Armeé staggers into Vilna, Lithuania, ending the failed Russian campaign." },
         { "day":"6", "month":"12", "year":"1861", "text": "Union General George G. Meade leads a foraging expedition to Gunnell’s farm near Dranesville, Virginia." },
         { "day":"6", "month":"12", "year":"1862", "text": "President Abraham Lincoln orders the hanging of 39 of the 303 convicted Indians who participated in the Sioux Uprising in Minnesota. They are to be hanged on December 26." },
         { "day":"6", "month":"12", "year":"1863", "text": "The monitor Weehawken sinks in Charleston Harbor." },
         { "day":"6", "month":"12", "year":"1876", "text": "Jack McCall is convicted for the murder of Wild Bill Hickok and sentenced to hang." },
         { "day":"6", "month":"12", "year":"1877", "text": "Thomas A. Edison makes the first sound recording when he recites \"Mary had a Little Lamb\" into his phonograph machine." },
         { "day":"6", "month":"12", "year":"1906", "text": "Lieutenant Thomas E. Selfridge flies a powered, man-carrying kite that carries him 168 feet in the air for seven minutes at Baddeck, Nova Scotia." },
         { "day":"6", "month":"12", "year":"1917", "text": "The Bolsheviks imprison Czar Nicholas II and his family in Tobolsk." },
         { "day":"6", "month":"12", "year":"1921", "text": "Ireland’s 26 southern counties become independent from Britain forming the Irish Free State." },
         { "day":"6", "month":"12", "year":"1922", "text": "Benito Mussolini threatens Italian newspapers with censorship if they keep reporting \"false\" information." },
         { "day":"6", "month":"12", "year":"1934", "text": "American Ambassador Davis says Japan is a grave security threat in the Pacific." },
         { "day":"6", "month":"12", "year":"1938", "text": "France and Germany sign a treaty of friendship." },
         { "day":"6", "month":"12", "year":"1939", "text": "Britain agrees to send arms to Finland, which is fighting off a Soviet invasion." },
         { "day":"6", "month":"12", "year":"1941", "text": "President Franklin D. Roosevelt issues a personal appeal to Emperor Hirohito to use his influence to avoid war." },
         { "day":"6", "month":"12", "year":"1945", "text": "The United States extends a $3 billion loan to Great Britain to help compensate for the termination of the Lend-Lease agreement." },
         { "day":"6", "month":"12", "year":"1947", "text": "Florida’s Everglades National Park is established." },
         { "day":"6", "month":"12", "year":"1948", "text": "The \"Pumpkin Spy Papers\" are found on the Maryland farm of Whittaker Chambers. They become evidence that State Department employee Alger Hiss is spying for the Soviet Union." },
         { "day":"6", "month":"12", "year":"1957", "text": "Vanguard TV3 explodes on the launchpad, thwarting the first US attempt to launch a satellite into Earth’s orbit." },
         { "day":"6", "month":"12", "year":"1967", "text": "Adrian Kantrowitz performs first human heart transplant in the US." },
         { "day":"6", "month":"12", "year":"1969", "text": "Hells Angels, hired to provide security at a Rolling Stones concert at the Altamont Speedway in California, beat to death concert-goer Meredith Hunter." },
         { "day":"6", "month":"12", "year":"1971", "text": "Pakistan severs diplomatic relations with India after New Delhi recognizes the state of Bangladesh." },
         { "day":"6", "month":"12", "year":"1973", "text": "US House of Representatives confirms Gerald Ford as Vice-President of the United States, 387–35." },
         { "day":"6", "month":"12", "year":"1975", "text": "A Provisional IRA unit takes a couple hostage in Balcombe Street, London, and a 6-day siege begins." },
         { "day":"6", "month":"12", "year":"1976", "text": "Democrat Tip O’Neill is elected speaker of the House of Representatives. He will serve the longest consecutive term as speaker." },
         { "day":"6", "month":"12", "year":"1992", "text": "The Babri Mosque in Ayodhya, India, is destroyed during a riot that started as a political protest." },
         { "day":"6", "month":"12", "year":"2006", "text": "NASA reveals photographs from Mars Global Surveyor that suggest the presence of water on the red planet." }
      ]
   }
]
