[
   {
      "facts":[
         { "day":"7", "month":"12", "year":"43 BC", "text": "Cicero, considered one of the greatest sons of Rome, is assassinated on the orders of Marcus Antonius." },
         { "day":"7", "month":"12", "year":"983", "text": "Otto III takes the throne after his father’s death in Italy. A power struggle between magnates ensues." },
         { "day":"7", "month":"12", "year":"1787", "text": "Delaware becomes the first state to ratify the Constitution of the United States." },
         { "day":"7", "month":"12", "year":"1808", "text": "James Madison is elected president in succession of Thomas Jefferson." },
         { "day":"7", "month":"12", "year":"1861", "text": "USS Santiago de Cuba, under Commander Daniel B. Ridgely, halts the British schooner Eugenia Smith and captures J.W. Zacharie, a New Orleans merchant and Confederate purchasing agent." },
         { "day":"7", "month":"12", "year":"1862", "text": "Confederate forces surprise an equal number of Union troops at the Battle of Prairie Grove, Arkansas." },
         { "day":"7", "month":"12", "year":"1863", "text": "Outlaw George Ives, an alleged member of an outlaw gang known as the \"Innocents,\" robs and then kills Nick Thiebalt in the Ruby Valley of what would become Montana." },
         { "day":"7", "month":"12", "year":"1917", "text": "The United States declares war on Austria-Hungary with only one dissenting vote in Congress." },
         { "day":"7", "month":"12", "year":"1918", "text": "Spartacists call for a German revolution." },
         { "day":"7", "month":"12", "year":"1931", "text": "A report indicates that Nazis would ensure \"Nordic dominance\" by sterilizing certain races." },
         { "day":"7", "month":"12", "year":"1941", "text": "Japanese planes raid Pearl Harbor, Hawaii, in a surprise attack, bringing the US into WWII." },
         { "day":"7", "month":"12", "year":"1942", "text": "The U.S. Navy launches USS New Jersey, the largest battleship ever built." },
         { "day":"7", "month":"12", "year":"1946", "text": "The president of the United Mine Workers, John L. Lewis, orders all striking miners back to work." },
         { "day":"7", "month":"12", "year":"1949", "text": "The A.F.L. and the C.I.O. organize a non-Communist international trade union." },
         { "day":"7", "month":"12", "year":"1970", "text": "Poland and West Germany sign a pact renouncing the use of force to settle disputes, recognizing the Oder-Neisse River as Poland’s western frontier, and acknowledging the transfer to Poland of 40,000 square miles of former German territory." },
         { "day":"7", "month":"12", "year":"1972", "text": "The crew of Apollo 17, the last manned mission to the moon, lifts off at Cape Canaveral, Florida." },
         { "day":"7", "month":"12", "year":"1981", "text": "The Reagan Administration predicts a record deficit in 1982 of $109 billion." },
         { "day":"7", "month":"12", "year":"1988", "text": "An earthquake in Armenia kills an estimated 100,000 people." },
         { "day":"7", "month":"12", "year":"1988", "text": "Palestinian leader Yasser Arafat recognizes Israel’s right to exist." },
         { "day":"7", "month":"12", "year":"1995", "text": "Galileo spacecraft arrives at Jupiter after a 6-year journey." },
         { "day":"7", "month":"12", "year":"1999", "text": "The Recording Industry Association of America files a copyright infringement suit against the file-sharing website Napster." },
         { "day":"7", "month":"12", "year":"2003", "text": "A tornado in Kensal Green, North West London, damages about 150 properties." },
         { "day":"7", "month":"12", "year":"2006", "text": "An earthquake in Armenia kills an estimated 100,000 people." }
      ]
   }
]
