[
   {
      "facts":[
         { "day":"8", "month":"12", "year":"1660", "text": "The first Shakespearian actress to appear on an English stage (she is believed to be a Ms. Norris) makes her debut as Desdemona." },
         { "day":"8", "month":"12", "year":"1861", "text": "CSS Sumter captures the whaler Eben Dodge in the Atlantic. The American Civil War is now affecting the Northern whaling industry." },
         { "day":"8", "month":"12", "year":"1863", "text": "Union General William Averell’s cavalry destroys railroads in the southwestern part of West Virginia." },
         { "day":"8", "month":"12", "year":"1914", "text": "The German cruisers Scharnhorst, Gneisenau, Nurnberg, and Liepzig are sunk by a British force in the Battle of the Falkland Islands." },
         { "day":"8", "month":"12", "year":"1920", "text": "President Woodrow Wilson declines to send a representative to the League of Nations in Geneva." },
         { "day":"8", "month":"12", "year":"1932", "text": "Japan tells the League of Nations that it has no control over her designs in China." },
         { "day":"8", "month":"12", "year":"1941", "text": "Japanese General Tomoyuki Yamashita begins his attack against the British army at Singapore." },
         { "day":"8", "month":"12", "year":"1943", "text": "U.S. carrier-based planes sink two cruisers and down 72 planes in the Marshall Islands." },
         { "day":"8", "month":"12", "year":"1944", "text": "The United States conducts the longest, most effective air raid on the Pacific island of Iwo Jima." },
         { "day":"8", "month":"12", "year":"1948", "text": "The United Nations approves the recognition of South Korea." },
         { "day":"8", "month":"12", "year":"1967", "text": "In the biggest battle yet in the Mekong Delta, 365 Viet Cong are killed." },
         { "day":"8", "month":"12", "year":"1968", "text": "South Vietnam’s Vice President Nguyen Cao Ky arrives in Paris for peace talks." },
         { "day":"8", "month":"12", "year":"1980", "text": "John Lennon is shot to death outside his Manhattan apartment building." },
         { "day":"8", "month":"12", "year":"1982", "text": "The Washington, D.C., police shoot and kill a man threatening to blow up the Washington Monument." },
         { "day":"8", "month":"12", "year":"1987", "text": "The Intermediate-Range Nuclear Forces Treaty signed." },
         { "day":"8", "month":"12", "year":"1987", "text": "An Israeli army tank transporter kills 4 Palestinian refugees and injures 7 others during a traffic accident at the Erez Crossing on the border between Israel and the Gaza Strip, leading to the First Intifada." },
         { "day":"8", "month":"12", "year":"1991", "text": "The leaders of Belarus, Russia, and Ukraine sign an agreement that dissolves the Soviet Union and establishes the Commonwealth of Independent States." },
         { "day":"8", "month":"12", "year":"2004", "text": "The Cuzco Declaration signed in Cuzco, Peru, establishing the South American Community of Nations." },
         { "day":"8", "month":"12", "year":"2010", "text": "SpaceX becomes the first privately held company to successfully launch, orbit and recover a spacecraft." },
         { "day":"8", "month":"12", "year":"2010", "text": "The Japanese solar-sail spacecraft IKAROS passes the planet Venus." }
      ]
   }
]
